{"conversations": ["when will the new dunkirk film be released on dvd", "18 December 2017", "what is this film about?", "Dunkirk evacuation of World War II", "can you mention a few members of the cast?", "Fionn Whitehead, Tom Glynn-Carney, Jack Lowden, Harry Styles", "where was it shot?", "Dunkirk and Urk, Netherlands", "can you tell me anything about the latter place's past?", "Until 1475 the High and Low Lordship of Urk and Emmeloord was in the hands of the Van Kuinre family", "what does the economy of this place depend upon?", "Fishery", "is there any waterbody nearby ?", "North Sea", "what kind of marine organisms are found in this sea?", "Cod, haddock, whiting, saithe, plaice, sole, mackerel, herring, pouting, sprat, and sandeel", "what kind of minerals are found in this sea?", "Sand, gravel and rolled pieces of amber", "does this place experiences any natural hazards?", "Storm surges and tsunamis", "are whales captured here?", "Whaling was an important economic activity from the 9th until the 13th century by by 1902 the whaling had ended", "any particular whale species that was hunted?", "Gray whale", "where are they found?", "Eastern North Pacific and western North Pacific", "what do they feed on?", "Benthic crustaceans"]}
{"conversations": ["the primary high energy molecule in human metabolism is", "Adenosine triphosphate (ATP)", "what is catabolism?", "It is the set of metabolic processes that breaks down large molecules.", "which hormones are related to it?", "Cortisol, glucagon, adrenaline, cytokines, orexin and melatonin.", "what is the emotional response due to the third one?", "Fear.", "how does the first hormone related to metabolism of glucose?", "Cortisol stimulates the synthesis of 'new' glucose from non-carbohydrate sources; this is known as gluconeogenesis..", "is process resisted by insulin?", "Yes.", "when was this substance which resists the process discovered?", "1921.", "can it be extracted?", "Yes.", "from where?", "Pancreas.", "can we find in plants the last hormone in the list of hormones mentioned above?", "Yes.", "is it responsible for any memory related disease?", "No.", "how does it affect immune system?", "An antiinflammatory effect seems to be the most relevant.", "is it also found in animals?", "Yes.", "what is its function in animals?", "Seasonal functions such as reproduction, behavior, coat growth, and camouflage coloring.", "can it be given through supplements?", "Melatonin is categorized by the US Food and Drug Administration (FDA) as a dietary supplement."]}
{"conversations": ["what does the song hotel california by the eagles mean", "Eagles described it as their \"interpretation of the high life in Los Angeles\"", "what is hotel california?", "Title track from the Eagles' album", "who is the singer of this song?", "Don Henley", "when did this song release?", "February 1977", "where was it recorded?", "Record Plant, Los Angeles and Criteria Studios, Miami.", "when was the first one established?", "1968", "does it also have branches in other places?", "Yes, Los Angeles branch and Sausalito, California, location", "did they also have a fan club?", "Yes, Jim Keltner Fan Club.", "how did the song perform according to the chart?", "Number one position on the \"Billboard\" Hot 100 and reached the top ten of several international charts.", "can you tell me one interpretation that was made about this song?", "Henley said \"a journey from innocence to experience\" to \"a sociopolitical statement\".", "did the song belong to a band or a single singer?", "It belongs to an album of the same name", "did the song win any award?", "Yes, Grammy Award", "were there any cover versions of this song?", "Yes, flamenco version, The Orb version, etc"]}
{"conversations": ["who sang all i want for christmas in 1995", "Mariah Carey.", "who is she?", "She is an American singer-songwriter and actress.", "what was her early days like?", "Racial tensions prevented the Carey family from integrating into their community though she excelled in the arts, such as music and literature in school.", "what are some famous songs she performed during 2010?", "Oh Santa! and Auld Lang Syne (The New Year's Anthem).", "who composed the former mentioned one?", "Mariah Carey.", "how did it perform in the charts?", "It became a record-breaking entry on the \"Billboard\" Adult Contemporary songs chart.", "how was it received critically?", "There were mixed reviews.", "what was her other song about?", "It is a re-write of \"Auld Lang Syne\" and Robert Burns and Mariah Carey had re-composed the poem into a house song.", "how was it received critically?", "Negative responses from critics.", "what are some philanthropic activities this singer is associated with?", "The Fresh Air Fund and the Make-A-Wish Foundation.", "what does the latter mentioned foundation do?", "They help fulfill the wishes of children with a critical illness between the ages of 2 and 18 years old.", "what is her style of music?", "Love is the subject of the majority of Carey's lyrics, although she has written about themes such as loss, sex, race, abuse and spirituality.", "what are some awards she has received?", "The World Music Awards' Best Selling Female Artist of the Millennium, the Grammy Award for Best New Artist in 1991, and \"Billboard\"s Special Achievement Award for the Artist of the Decade", "who did she marry?", "Tommy Mottola.", "what is his profession?", "He is an American music executive, producer and author.", "which music labels is he associated with?", "The Columbia label."]}
{"conversations": ["of the four galilean moons which is the closest to jupiter", "Io", "who discovered it?", "Galileo Galilei", "who was he?", "An Italian astronomer, physicist and engineer.", "has he invented anything?", "Thermoscope", "what is it used for?", "It is a device that shows changes in temperature.", "is there any references of him in any art form?", "Yes, in the \"opera\" section of the Queen song, \"Bohemian Rhapsody\".", "what is this rhapsody?", "A song by the British rock band Queen.", "who wrote it?", "Freddie Mercury", "when was it released?", "1975", "does it belong to any album?", "\"A Night at the Opera\""]}
{"conversations": ["when did victor start on young and restless", "February 8, 1980", "who is victor newman?", "Victor Newman is a fictional character from the American CBS soap opera \"The Young and the Restless\".", "who plays his role?", "Eric Braeden", "what is the full form of the channel you just mentioned?", "The Columbia Broadcasting System.", "when was it established?", "1974", "who owns it?", "ViacomCBS through its CBS Entertainment Group division.", "where is it located?", "At the CBS Building in New York City.", "who created the original character?", "William J. Bell and Lee Phillip Bell.", "how was he received?", "UNANSWERABLE", "is the original character married?", "Yes - With Julia Newman.", "describe him in a few words", "He was a despicable, contemptible, unfaithful wife abuser.", "what other shows or movies has the actor you mentioned before been a part of?", "Combat, Morituri, Twelve O'Clock High, Blue Light.", "is he still alive?", "UNANSWERABLE"]}
{"conversations": ["yo la tengo i can hear the heart beating as one full album", "True, its their eighth studio album.", "when was it released?", "April 22, 1997.", "what was the name of the record label that released it?", "Matador Records.", "how was this album received by public?", "It received considerable acclaim from music critics.", "can you mention a few songs from the album?", "\"Autumn Sweater\", \"Sugarcube\", and \"Little Honda\".", "who owns the above mentioned record company?", "Patrick Amory is Matador's label manager.", "when was this company launched?", "1989.", "can you name some others artists they have launched?", "M. Ward, Sleater-Kinney, Modest Mouse, and Superchunk to name a few.", "what can you tell me about the above mentioned manager?", "He is a historian and an executive in the recorded music industry.", "where is he from?", "New York City.", "where did he complete his graduation from?", "Commonwealth School.", "who established this school?", "Charles E. Merrill Jr. founded the school.", "did the school face any conflict with regards to its brand name?", "Yes, in June 2016, the Boston Globe reported that Commonwealth School sued Commonwealth Academy, a high school in Springfield, Massachusetts, over the use of the name \"Commonwealth\"", "how has the school performed till date, did it make a mark in the education industry?", "Academically, the school is one of the nation's elite."]}
{"conversations": ["in gossip girl who is blair's baby daddy", "Prince Louis", "who is blair waldorf?", "One of the main characters of \"Gossip Girl\"", "what is gossip girl?", "American teen drama television series", "who is the director of this television series?", "UNANSWERABLE", "when did it first come out?", "September 19, 2007", "what role does blair play in it?", "UNANSWERABLE", "are there novel series?", "Yes. American young adult novel series", "who wrote this story?", "Cecily von Ziegesar", "has he written other book series apart from the former one?", "The It Girl, Psycho Killer", "has he also written for television series?", "No but \"Gossip Girl\" was adapted for television", "when did that happen?", "2007", "and on which channel did it air?", "The CW network"]}
{"conversations": ["what is the total length of the lord of the rings movies", "Two hours each trilogy", "what is it's story about?", "It follows the hobbit Frodo Baggins as he and the Fellowship embark on a quest to destroy the One Ring, to ensure the destruction of its maker, the Dark Lord Sauron.", "when was the first movie in the series released?", "2001", "who produced it?", "New Line Cinema with the co-production of WingNut Films", "where is the first production company located?", "New York City", "did the company announce it's merger with any other company?", "Yes, Warner Bros.", "when did that happen?", "June, 2014", "did the group you just mentioned produce any other famous movie?", "Yes, \"Kings Row\", \"Casablanca\" and \"Cheyenne\"", "what is the genre of the first film?", "UNANSWERABLE", "who directed it?", "Sam Wood"]}
{"conversations": ["what is quoll?", "They  are carnivorous marsupials.", "where are they found?", "Australia and New Guinea", "where did the latter get it's name from?", "UNANSWERABLE", "what kind of people are seen here?", "The island is presently populated by almost a thousand different tribal groups", "what does the animal we talked about feed on?", "The smaller ones primarily eat insects, birds, frogs, lizards and fruit; the larger species eat birds, reptiles, and mammals, including echidnas and possums.", "where does it live?", "Each species of quoll lives in distinct geographical areas.", "were any attempts made to protect or conserve these?", "The Department of Environment and Conservation (Western Australia)", "what did they do?", "They monitors western quoll populations in the Jarrah Forest as part of its faunal management programs", "what threat on them did lead to do so?", "Predators such as foxes and cats prey on quolls and compete with them for food.", "when did the aforementioned department come into action?", "1 July 2006", "what is its main objective?", "It focuses on environmental regulation, approvals and appeals processes, and pollution prevention.", "what sort of vehicles are being used by it?", "pumpers, water bombers and tankers"]}
{"conversations": ["when did arsenal last won the fa cup", "2005", "how many league titles have they won?", "Thirteen", "who owns the club?", "Kroenke Sports", "when was this club established?", "In October 1886", "who are their fiercest rival?", "UNANSWERABLE", "can you name some of their most successful managers?", "Arsène Wenger, Herbert Chapman and Tom Whittaker.", "for how long was the second person in charge of the club?", "From 1925 to 1934", "has he managed any other clubs?", "Leeds City", "what are some of his most important contributions to the game of football?", "Chapman was one of the first football managers in the modern sense of the word, taking full charge of the team, rather than letting board members pick the side. As well as his tactical innovations, he was a strong believer in physical fitness in football", "as a player, which clubs was he associated with?", "Ashton North End"]}
{"conversations": ["at the beginning of world war i great britain", "Great Britain was a leading Allied Power during the First World War", "who was the prime minister of u.k. then?", "H. H. Asquith", "which political party did he represent?", "Liberal Party", "where was he born?", "Morley, in the West Riding of Yorkshire", "who all were there in his family?", "Joseph Dixon Asquith his father,  Emily his mother. The couple also had three daughters, of whom only one survived infancy.", "what did he start his career as?", "After his graduation in 1874, Asquith spent several months coaching Viscount Lymington, the 18-year-old son and heir of the Earl of Portsmouth. He found the experience of aristocratic country-house life agreeable.", "were women able to cast their votes then?", "Asquith had opposed votes for women as early as 1882, and he remained well known as an adversary throughout his time as prime minister.", "what were his leisure time activities?", "Reading the classics, poetry and a vast range of English literature consumed much of his time. Travelling, often to country houses owned by members of Margot's family, was almost constant, Asquith being a devoted \"weekender\".", "had he been a part of any notable events?", "Failures in both the East and the West began a tide of events that was to overwhelm Asquith's Liberal Government.  By the resignation of Admiral Fisher after continuing disagreements with Churchill and in frustration at the disappointing developments in Gallipoli.", "when did he resign?", "UNANSWERABLE", "when did he die?", "15 February 1928", "who was his descendant?", "Among his living descendants are his great-granddaughter, the actress Helena Bonham Carter (b. 1966), and two great-grandsons, Dominic Asquith, British High Commissioner to India since March 2016, and Raymond Asquith, 3rd Earl of Oxford and Asquith, who inherited Asquith's earldom.", "when was his party formed?", "UNANSWERABLE", "were any movies filmed in his birthplace?", "Yes,  Morley is a setting for David Peace's \"Red Riding Quartet\" novel and 2009 television series.  \"Emmerdale\" often use Morley for filming court and wedding scenes in the town hall."]}
{"conversations": ["name the fields in which nobel prize is given", "Physics, Chemistry, Physiology or Medicine, Literature, and Peace.", "why is this prize given?", "To those who, during the preceding year, have conferred the greatest benefit to humankind", "which organization gives away the prizes?", "The Nobel Foundation.", "when was this formed?", "29 June 1900.", "are nominations after death allowed?", "No.", "how are people nominated for this?", "Nomination forms are sent by the Nobel Committee.", "by whom was the concept of these prizes first created?", "Alfred Nobel.", "who was he?", "He was a Swedish chemist, engineer, inventor, businessman, and philanthropist.", "where was he born?", "Stockholm.", "what did he invent?", "He held 355 different patents, dynamite being the most famous.", "what is this patented thing that you just mentioned?", "It is an explosive made of nitroglycerin, sorbents (such as powdered shells or clay) and stabilizers.", "how can it be stored?", "Modern packaging places dynamite into sealed plastic bags, and using wax-coated cardboard.", "what are a few rules regarding this explosive?", "Explosive manuals recommend repeated turning over of boxes of dynamite in storage as sticks of dynamite will \"weep\" or \"sweat\" nitroglycerin, which can then pool in the bottom of the box or storage area.", "did the scientist, who is credited with the invention of this thing face any criticism?", "Yes, he was condemned for profiting from the sales of arms.", "when did he die?", "10 December 1896.", "how ?", "Stroke."]}
{"conversations": ["what is the man trap?", "The first episode of of the American science fiction television series", "who are the characters?", "Professor Robert Crater, his wife Nancy, Captain Kirk, Chief Medical Officer Dr. Leonard McCoy, and Crewman Darnell", "what is the name of the series?", "Star Trek", "who wrote the script of this episode?", "Gene Roddenberry", "who is the director?", "Marc Daniels", "when was it aired?", "September 8, 1966", "what was its critical response?", "\"The Daily Reporter\" said that \"Star Trek\" had the \"usual far-fetched suppositions\" present in other science fiction works, but praise was given to the acting skills of Shatner and the plots of the initial episodes", "who plays the protagonist ?", "Alfred Ryder", "what is his role?", "The only known inhabitants of the planet M-113, Professor Robert Crater", "what can you tell me about his personal life?", "He began to act aged eight and later studied with Robert Lewis and Lee Strasberg", "who is the latter?", "Polish-born American actor, director and theatre practitioner"]}
{"conversations": ["when was \"human nature\" released?", "July 3, 1983", "is it michael jackson song?", "Yes", "who was the record label for it?", "UNANSWERABLE", "where did its live performances take place?", "Jacksons' Victory Tour, Bad World Tour and Dangerous World Tour.", "when did the last tour start?", "June 27, 1992", "who were its broadcasters?", "HBO and BBC", "describe something about the former broadcaster?", "UNANSWERABLE", "where did the dangerous world tour take place?", "Oslo, Norway and Bucharest, Romania, etc.", "in which super bowl halftime show was it performed?", "Super Bowl XXVII halftime show", "when was the above super bowl organized?", "January 31, 1993", "any controversy that took place on that occasion?", "Yes", "what was it?", "NFL was to determine a host city for Super Bowl XXVII, Tempe was awarded the game, but committee warned that if the MLK Day ballot initiative went against adoption of the holiday, the NFL would pull the game and move it somewhere else.", "who won the bowl?", "Dallas Cowboys", "and who was the runner-up?", "Buffalo Bills", "who were the broadcasters of the super bowl?", "NBC"]}
{"conversations": ["when did the first episode of sesame street air", "10 November 1969.", "is it a series?", "Yes, an educational children's television series.", "is the series still running?", "Yes, it is on its second run.", "when was the pilot episode done?", "July 1969.", "is it a puppet show?", "Yes.", "name a few characters from the series?", "Human characters included Susan and muppet characters included Elmo.", "can you name more muppet characters?", "Big Bird and Oscar the Grouch.", "how do the latter look like?", "He has a green body with no visible nose.", "does the muppet perform any oscar related play?", "UNANSWERABLE", "who performed the aforementioned bird muppet?", "It was performed by Caroll Spinney till his retirement.", "who is he by profession?", "He was an American puppeteer, cartoonist, author and speaker.", "did he do comics too?", "Yes, a comic strip about military life.", "what is the name of the comic?", "\"Harvey\".", "when did he die?", "8 December 2019.", "was he commemorated in any way?", "He received the National Academy of Television Arts and Sciences' Lifetime Achievement Award and a full length documentary has been made on him."]}
{"conversations": ["who designed the ceilings of the natural history museum in london?", "Alfred Waterhouse", "what drawings do those depict?", "The central hall depicts plants considered significant to the history of the museum, o the British Empire and the smaller North Hall depicts plants growing in the British Isles.", "what special antique pieces will you find under that roof?", "UNANSWERABLE", "are they any room sections in the museum that come that ceiling?", "UNANSWERABLE", "are they any room sections in the museum that come under that specific ceiling?", "The Central Hall and the North Hall", "could you tell me the date of birth of that designer you had mentioned?", "19 July 1830", "where was he born?", "Stone Hill, Liverpool", "name a few educational institutions that he attended.", "Quaker Grove House School", "when was it established?", "1828", "who established it that year?", "Thomas Binns", "can you name a few of that designer's other works?", "He has designed the former Bassett and Harris Bank, National Provincial Bank and a few others."]}
{"conversations": ["system requirements for windows 10 pro 32 bit", "7 GB of disk space, The 64-bit variants require a CPU, USB flash drive etc", "who is the developer of this operating system?", "Microsoft", "when was this 10 version first released to the public?", "July 29, 2015", "on what devices can this operating system be installed?", "PCs, tablets, smartphones, embedded systems, Xbox One, Surface Hub and Mixed Reality.", "what are some of the special features of this system?", "Microsoft Edge web browser,  a virtual desktop system, Task View, support for fingerprint and face recognition login are some of them.", "what are some of the editions of this system?", "Windows 10 Home and Windows 10 Pro are some them.", "name a few patch updates which were released for the system?", "UNANSWERABLE", "you had mentioned the developer's name earlier, where is the developer headquartered?", "Redmond, Washington", "who is the founder?", "Bill Gates and Paul Allen", "when was it founded?", "April 4, 1975", "apart from the founders, name some employees who are part of that organization.", "Satya Nadella, Reid Hoffman, Hugh Johnston, Teri List-Stoll, Sandi Peterson, Penny Pritzker, Charles Scharf, Arne Sorenson, John W. Stanton, John W. Thompson, Emma Walmsley and Padmasree Warrior.", "what is the professional background of the first employee mentioned?", "He is the chief executive officer of Microsoft", "what all subjects did he study during his university days?", "electrical engineering,  M.S. in computer science", "name some of his recognitions", "He was a \"Time\" 100 honoree ,\"Financial Times\" Person of the Year and \"Fortune\" magazine Businessperson of the Year,  Global Indian Business Icon at CNBC-TV18's India Business Leader Awards"]}
{"conversations": ["what episode did pam and jim first kiss", "\"Casino Night\"", "what is it's premise about?", "It depicts the everyday lives of office employees in the Scranton, Pennsylvania branch of the fictional Dunder Mifflin Paper Company.", "which series does this episode belong to?", "\"The Office\"", "when was it released?", "March 24, 2005", "who produced it?", "Co-produced by Deedle-Dee Productions, and Reveille Productions (later Shine America), in association with Universal Television.", "who are the main characters in it?", "Michael Scott, Dwight Schrute, Jim Halpert, Pam Beesly", "what sort of a character is the first one?", "Apart from his masterful salesmanship, he is lacking in almost any other skills, management or otherwise; places personal interests as a priority over work; often resorts to scapegoating employees to cover himself.", "who played this character in it?", "Steve Carell", "was this his debut series?", "No, he started with \"The Dana Carvey Show\" and \"Saturday Night Live\".", "where did the former get broadcasted?", "ABC", "what does it stand for?", "American Broadcasting Company", "was the show received well?", "It received mixed reviews - Joyce Millman of \"Salon\" called the series a \"rousing blast of kamikaze satire\"; Caryn James of \"The New York Times\", however, gave a negative review, claiming, \"the debut already looked tired and old\".", "did he receive any award?", "Yes, he received the 2,570th star on the Hollywood Walk of Fame in 2016.", "where was ṭhe original series filmed?", "UNANSWERABLE", "did it get released online?", "Yes, on the iTunes Store, NBC.com, Amazon.com's Unbox video downloads etc."]}
{"conversations": ["who was lise meitner?", "She was an Austrian-Swedish physicist.", "in which country did she live in her early days?", "In the Leopoldstadt district of Vienna", "any particular educational institution that she attended as a student?", "University of Vienna", "why did she have to flee from germany?", "Because she lost her Austrian citizenship.", "why?", "UNANSWERABLE", "can you mention any of her contributions?", "She completed the work on beta ray spectrum that she had begun with Hahn and Baeyer, and also her own study of the uranium decay chain.", "could you please elaborate the last reaction?", "It refers to a series of radioactive decays of different radioactive decay products as a sequential series of transformations - a.k.a. \"radioactive cascade\".", "can you mention any health hazard caused by this decay?", "The dangers are not immediately recognized.", "who discovered this decay?", "Ernest Rutherford, Frederick Soddy", "who was the former?", "He was  a New Zealand–born British physicist who came to be known as the father of nuclear physics.", "what was his fabled experiment with gold ?", "The Geiger–Marsden experiment, which demonstrated the nuclear nature of atoms by deflecting alpha particles passing through a thin gold foil.", "what was his legacy?", "At the opening session of the 1938 Indian Science Congress,  astrophysicist James Jeans deemed him \"one of the greatest scientists of all time\""]}
{"conversations": ["what is ypresiomyrma?", "It is an extinct genus of ants in the subfamily Myrmeciinae.", "how are they classified?", "As \"incertae sedis\"", "who described them for thr first time?", "Bruce Archibald, Stefan Cover and Corrie Moreau", "who is the first person?", "UNANSWERABLE", "how do they look like?", "The waist connecting the thorax and the abdomen is composed of a single segment, the head is in various shapes, and mandibles are a distinct triangular shape and shorter than the head.", "what is thorax?", "It is the part of the anatomy of humans, mammals, other tetrapod animals located between the neck and the abdomen.", "from where did it get its name?", "The word comes from the Greek θώραξ \"thorax\" \"breastplate, cuirass, corslet.", "how does one experience pain in this part of the body?", "Cardiac arrest - feelings of sudden pressure in the chest or a crushing pain in the back, neck, and arms; noncardiac issues - burning feeling along the digestive tract or pain when deep breaths are attempted.", "how is its structure?", "Humans and hominids - the chest region of the body between the neck and the abdomen, along with its internal organs and other contents; protected and supported by the rib cage, spine, and shoulder girdle.", "what are the injuries one can have in this part of the body?", "Major pathophysiologies encountered in blunt chest trauma involve derangements in the flow of air, blood, or both in combination.", "how is this part of the body in arthropods?", "It is the area where the wings and legs attach in insects, or an area of multiple articulating plates in trilobites.", "and in tetrapods?", "The heart and the lungs reside in the thoracic cavity, as well as many blood vessels; inner organs are protected by the rib cage and the sternum.", "describe the relationship between chest pain and thorax?", "Injuries to this region, including rib cage and sternum is also a common cause of chest pain."]}
{"conversations": ["why is the hockey hall of fame in toronto", "Founded in Kingston, Ontario, the Hockey Hall of Fame was established in 1943.  It moved to Toronto in 1958 after the NHL withdrew its support for the International Hockey Hall of Fame in Kingston, Ontario, due to funding issues.", "when was it relocated?", "1993", "how many exhibit areas do they have?", "15", "what can you tell me about the place they are currently situated in?", "Toronto is the capital city of the Canadian province of Ontario. It is the most populous city in Canada", "what can you tell me about its culture?", "Toronto's theatre and performing arts scene has more than fifty ballet and dance companies, six opera companies, two symphony orchestras and a host of theatres.", "what are their major sources of economy?", "Banks, brokerage firms, the Toronto Stock Exchange, media, publishing, telecommunication", "can you name any tourist spots there?", "Royal Ontario Museum, Toronto Zoo, Ontario Science Centre", "when was this aforesaid museum established?", "16 April 1912", "what can you tell me about its curatorial centre?", "It's the southern section of the museum; it houses the museum's administrative and curatorial services and provides storage for artifacts that are not on exhibit", "what is romcan?", "Its fullform is Royal Ontario Museum Community Access Network. In 2008, ROMCAN was created to make the ROM more accessible to a variety of communities. ROMCAN provides free general admission tickets to participating community and charitable organizations."]}
{"conversations": ["who was adele spitzeder?", "German actress, folk singer, and con artist.", "what was she accused of?", "She was convicted instead of bad accounting and mishandling customers' money.", "where was she born?", "Berlin", "apart from acting did she have other jobs?", "Yes, she was a banker.", "which bank?", "Her own bank", "how did she die?", "Cardiac arrest", "what was her debut film?", "Deborah and Mary Stuart.", "we talked about her mishandling money, was it sort of a  scheme?", "Yes, Ponzi scheme", "what exactly is this scheme?", "Form of fraud that lures investors and pays profits to earlier investors with funds from more recent investors.", "what is an essential quality for the first person?", "Investors are owners of a company which entails responsibilities.", "what are their different types?", "Retail investors and institutional investors"]}
{"conversations": ["what is the boy scout order of the arrow", "The Order of the Arrow (OA) is the National Honor Society of the Boy Scouts of America (BSA)", "when was this honor society established?", "1915", "who established it?", "E. Urner Goodman, with the assistance of Carroll A. Edson", "what is the profession of this first person mentioned?", "National program director", "what were some of his recognitions?", "An influential leader in BSA, was Executive Director of Men's Work for the National Council of Churches to mention a few", "what are the eligibility criteria to be on this society's membership list?", "An youth must have spent at least 15 days and nights camping within the last two years including one long-term camp consisting of at least five consecutive nights, be under the age of 21", "what are some of the designations in this society?", "\"Arrowmen\" or \"Brothers\"", "what the some of the events they hold?", "Shows and the Outdoor Adventure Program exhibit", "what are some of the objectives of this society?", "Reinforcing the Scout Oath and the Scout Law", "what are some of the scouting laws one must adhere to?", "UNANSWERABLE", "what are the symbols of that honor scociety?", "OA membership and Lodge affiliation are indicated by the wearing of the lodge emblem (commonly known as a lodge flap), an embroidered patch is worn on the right pocket flap of the uniform shirt; has a unique design, generally reflecting the name, geography or history of the lodge"]}
{"conversations": ["what disney movie is the evil queen from", "\"Snow White and the Seven Dwarfs\"", "what is this movie about ?", "It is a story about a lonely princess Snow White living with her stepmother who worries that Snow White will be more beautiful than her and gets jealous. She then plots to kill her, but eventually fails.", "who are the main characters from this movie ?", "Snow White, Evil Queen, a Huntsman and seven dwarves are the main characters.", "what are the names of the dwarves ?", "Doc, Grumpy, Happy, Sleepy, Bashful, Sneezy, and Dopey", "when was this movie released ?", "1937", "what genre of film is this  ?", "Animated musical fantasy", "are there any theme parks based on this film ?", "Snow White's Scary Adventures is a popular theme park ride at Disneyland, Tokyo Disneyland, and Disneyland Paris. The Seven Dwarfs Mine Train roller coaster is a ride in Fantasyland.", "any broadway musicals based on this film ?", "\"Snow White and the Seven Dwarfs\" (also known as \"Snow White Live!\") at the Radio City Music Hall.", "when was the above mentioned hall established ?", "1932", "who built this hall ?", "It was built on the basis of blueprints by Benjamin Wistar Morris and designer Joseph Urban with endowment from John D. Rockefeller Jr.", "did it face bankruptcy ?", "Yes, it was heavily in debt.", "any concerts take place here ?", "Yes, shows by Pink Floyd, Devo, Liberace, Lady Gaga and Mariah Carey among many others."]}
{"conversations": ["what ocean zone does the sperm whale live in", "They are relatively abundant from the poles to the equator and are found in all the oceans.", "where does this whale species get its name from?", "It is a truncation of \"spermaceti whale\".", "what does it look like?", "It is distinguished by its large tooth.", "can it make sounds?", "Yes a \"creak\" and a \"coda\" are some of sound names used as per the situation they are in.", "what do they feed on?", "They feed on several species, notably the giant squid, colossal squid, octopuses and fishes such as demersal rays. However, their diet is mainly medium-sized squid.", "are they under threat of extinction?", "Currently, entanglement in fishing nets and collisions with ships represent the greatest threats. Other threats include ingestion of marine debris, ocean noise, and chemical pollution.", "can you name any water body in particular where this whale is found?", "Mediterranean Sea", "where is this located?", "it is a sea connected to the Atlantic Ocean, surrounded by the Mediterranean Basin and almost completely enclosed by land: on the north by Southern Europe and Anatolia, on the south by North Africa, and on the east by the Levant.", "what type of climate is experienced here?", "It enjoys a hot-summer climate. However, most of its southeastern coast has a hot desert climate, and much of Spain's coast has a cold semi-arid climate.", "is there a rise in the level of the sea?", "Yes, by 2100 the overall level could rise."]}
{"conversations": ["when did jungle book come out in theaters", "1967", "who was the director?", "Wolfgang Reitherman", "and the producer?", "Walt Disney", "what is the movie about?", "It follows Mowgli, a feral child raised in the Indian jungle by wolves, as his friends Bagheera the panther and Baloo the bear try to convince him to leave the jungle before the evil tiger Shere Khan arrives.", "how was it received by the public?", "It received positive reviews upon release, undoubtedly influenced by a nostalgic reaction to the death of Walt Disney.", "who was this person ?", "He was an American entrepreneur, animator, writer, voice actor and film producer.", "where was he born?", "Chicago's Hermosa neighborhood.", "could you mention character created by him?", "Mickey Mouse", "and did he win any awards for this one?", "Yes, \"Flowers and Trees\" won the Academy Award for best Short Subject (Cartoon) at the 1932 ceremony.", "did he set up any amusement park?", "Yes, Disneyland", "where is this located?", "Disneyland Resort in Anaheim, California", "when was it constructed?", "Construction began on July 16, 1954", "what was the main idea behind this ?", "He wanted to be in a clean, unspoiled park, where both children and their parents could have fun, and was heavily influenced by the cleanliness and layout of Tivoli Gardens in Copenhagen, Denmark."]}
{"conversations": ["what is operation pbfortune?", "It was a covert United States operation to overthrow the democratically elected Guatemalan President Jacobo Árbenz", "where did the place get its name?", "The name \"Guatemala\" comes from the Nahuatl word \"Cuauhtēmallān\" , or \"place of many trees\".", "name a few literatures associated with nahuatl?", "Chalco written by Chimalpahin, from Tlaxcala by Diego Muñoz Camargo, from Mexico-Tenochtitlan by Fernando Alvarado Tezozomoc and those of Texcoco by Fernando Alva Ixtlilxochitl", "when did the person against whom the operation was intended become president?", "March 15, 1951", "was he ever exiled?", "Yes, Árbenz and his family were the victims of a CIA-orchestrated and intense defamation campaign that led them to exile", "where did he spend his exile period?", "Paris, Prague, Montevideo, Uruguay", "is he alive?", "No, he died in 1970", "what was his ideology?", "To increase Guatemala's economic and political independence", "is there any pop culture reference on him?", "The Guatemalan movie \"The Silence of Neto\" and some books like \"American Propaganda, Media, And The Fall Of Jacobo Arbenz Guzman\" by Zachary Fisher (2014), as well as New York Times Best Seller \"The Devil's Chessboard\" by Author David", "did anyone from his family attempted suicide?", "Yes, his  daughter Arabella", "what are some of the cuisines at the second place of his exile?", "UNANSWERABLE", "mention a few research centres at prague?", "Czech Academy of Sciences, Siemens, Honeywell, Oracle", "what is the third one about?", "An American publicly traded, multinational conglomerate operates in  Aerospace, Building technologies, Performance Materials & Technologies (PMT), and Safety & Productivity Solutions (SPS).", "is it also in defense industry?", "Yes, they spun off their Defense and Marine Systems business into Alliant Techsystems, as well as their Test Instruments division and Signal Analysis Center", "when was it founded?", "1885"]}
{"conversations": ["what is a chain of underwater mountains called", "Seamount", "what can you tell about its geographic features?", "Seamounts can be found in every ocean basin in the world, distributed extremely widely both in space and in age. A seamount is technically defined as an isolated rise in elevation of or more from the surrounding seafloor, and with a limited summit area, of conical form.", "how are these chain of mountains formed?", "Formed millions of years ago by volcanism, they have since subsided far below sea level. This long chain of islands and seamounts extends thousands of kilometers northwest from the island of Hawaii.", "what can you tell about its structure?", "Seamounts can form in a wide variety of tectonic settings, resulting in a very diverse structural bank. Seamounts come in a wide variety of structural shapes, from conical to flat-topped to complexly shaped. Some are built very large and very low", "how can you describe its ecological role?", "Seamounts are exceptionally important to their biome ecologically, but their role in their environment is poorly understood. Because they project out above the surrounding sea floor, they disturb standard water flow, causing eddies and associated hydrological phenomena that ultimately result in water movement in an otherwise still ocean bottom.", "any type of danger associated with it?", "Yes, seamounts have not been mapped and thus pose a navigational danger.", "what can you tell about its fishing?", "Seamounts were first extensively fished in the second half of the 20th century, due to poor management practices and increased fishing pressure seriously depleting stock numbers on the typical fishing ground, the continental shelf. Seamounts have been the site of targeted fishing since that time.", "any fish you can mention?", "spiny lobster, mackerel, red king crab, red snapper, tuna", "how is the last one look like?", "Red snapper is a common name of several fish species.", "how did it receive its name?", "UNANSWERABLE"]}
{"conversations": ["when was kingdom of the crystal skull filmed", "2008", "what is its genre?", "UNANSWERABLE", "what is the significance of the crystal skull in the film?", "It was believed that it belonged to an alien life form and holds great psychic power, and finding more skulls will grant the Soviet Union the ability to rule the world through the use of telepathy.", "who played the role of jones?", "Harrison Ford.", "how is he related to aviation?", "He is a licensed pilot of both fixed-wing aircraft and helicopters.", "was he into archaeological expeditions as well?", "Yes, he serves as a General Trustee on the Governing Board of the Archaeological Institute of America.", "what opinions does he hold on politics?", "He holds the opinion of being a Democrat.", "any other famous movie he acted?", "\"A Time for Killing\"", "who was his co- star in this film regarding killing?", "\"Glenn Ford\" and \"George Hamilton\"", "what is the storyline of this film?", "It revolves during the Civil War period, Confederate soldiers escape from a Union prison and head for the Mexican border. Along the way, they kill a Union courier bearing the news that the war is over. Keeping the message a secret, the captain has his men go on and they soon find themselves in a battle with the Union search party who also is unaware of the war's end.", "where was the filming done?", "Columbia", "who directed it?", "The direction was initially by Roger Corman but was finished by Phil Karlson.", "any reason behind it?", "The reason is not known.", "which was his debut film?", "\"Five Guns West\"", "which film did he associate for columbia?", "\"The Long Ride Home\""]}
{"conversations": ["when does marvel's the defenders take place", "August 18, 2017", "what is the defenders?", "American streaming television miniseries", "who wrote this?", "Petrie and Ramirez", "who are the characters in this series?", "Daredevil, Jessica Jones, Luke Cage, and Iron Fist", "how did its development take place?", "Development began in late 2013, with Cox the first actor cast in May 2014", "where is the second mentioned actress from?", "UNANSWERABLE", "how was her early days like?", "UNANSWERABLE", "what is the definition of the type of series mentioned earlier?", "It is a television program that tells a story in a predetermined, limited number of episodes", "where did it first begin?", "The term was coined in the US in the early 1970s", "what is the historical account behind this?", "The term was coined in the US in the early 1970s; with the proliferation of the format in the 1980s and 90s, television films broadcast over even two or three nights were commonly referred to as miniseries", "how was it in the uk?", "The British television \"serial\" is rooted in dramatic radio productions developed between the First and the Second World Wars", "what happened to it in south korea?", "South Korea started to broadcast television series () in the 1960s"]}
{"conversations": ["how old was william shakespeare when he wrote hamlet", "Between 1589 and 1613 at the age of 49.", "who is he?", "He was an English playwright, poet, and actor.", "name a few of his poems?", "\"Venus and Adonis\", \"The Rape of Lucrece\", \"Metamorphoses\", \"A Lover's Complaint\".", "what is the third poem about?", "It is the history of the world from its creation to the deification of Julius Caesar within a loose mythico-historical framework.", "what are its themes?", "Mutability, love, violence, artistry, and power are just some of the unifying themes.", "what is metamorphosis in it?", "It is the transformation is a unifying theme amongst the episodes.", "describe the writing style of the author of the poem?", "It is conventional style extended, sometimes elaborate metaphors and conceits, and the language is often rhetorical in written.", "did he influence how plays are classified?", "It is classified as comedies, histories, and tragedies.", "what was his sexual orientation?", "Has evidence of heterosexual liaisons, expression of intense friendship rather than romantic love.", "where was he from?", "Snitterfield.", "with what did he start his theatrical career?", "In 1587,  \"Chronicles of England, Scotland, and Ireland\".", "any notable structure where he was from?", "The parish church of St. James the Great."]}
{"conversations": ["what is parnassius smintheus?", "It is a high-altitude butterfly found in the Rocky Mountains.", "where did this mountain take its name from?", "It is a translation of the Cree name ' is given as, \"When seen from across the prairies, they looked like a rocky mass\".", "what is the history behind this first mentioned name?", "The name is derived from the Algonkian-language exonym \"Kirištino.", "what are some different types of it?", "The Plains Cree and Attikamekw refer to themselves as \"nêhiyaw\" and \"nêhirawisiw\"; the Moose Cree, East Cree, Naskapi, and Montagnais as \"iriniw\" etc.", "what are its people?", "UNANSWERABLE", "what is its first contact?", "In Manitoba, the Cree were first contacted by Europeans in 1682.", "what is its relation with the un?", "UNANSWERABLE", "what are its subgroups?", "The Cree are generally divided into eight groups based on dialect and region.", "what are few of these group names?", "The Plains Cree and Attikamekw, Moose Cree, East Cree, Naskapi, and Montagnais; coastal East Cree and Naskapi.", "what is it in contemporary times?", "UNANSWERABLE"]}
{"conversations": ["who sings on the dark side of the moon", "Pink Floyd.", "when was the song released?", "1 March 1973.", "who were the members of the band mentioned above?", "Syd Barrett, Nick Mason, Roger Waters and Richard Wright.", "what was their genre of music?", "Rock band and psychedelic pop group.", "who founded this band?", "Syd Barrett, Nick Mason, Roger Waters and Richard Wright.", "what was role of the first person in the band mentioned above?", "Guitar and lead vocals.", "can you name his debut album?", "The Piper at the Gates of Dawn.", "when was it released?", "1967.", "where was he born?", "Cambridge, Cambridgeshire.", "who was the lead drummer of the fist band mentioned above?", "Nick Mason.", "is he married?", "Mason's first marriage was to Lindy Rutter,. is now married to his second wife Annette Lynton", "is he still living?", "Yes.", "apart from music, what are his hobbies?", "Motor racing."]}
{"conversations": ["what is the double seven day scuffle?", "A physical altercation on July 7, 1963.", "between who?", "The secret police of Ngô Đình Nhu—the brother of President Ngô Đình Diệm—and a group of US journalists.", "who was arrested?", "Browne and Arnett.", "who was interrogated?", "Browne and Arnett.", "why did it take place?", "Because of the Huế Phật Đản shootings.", "was anybody injured or harmed?", "Yes, nine unarmed Buddhist civilians were killed.", "were browne and arnett the us journalists?", "Yes.", "were there any other journalists?", "UNANSWERABLE", "in which country did this incident take place?", "Vietnam.", "what was the reason for the shootings that you mentioned earlier?", "Since Buddhists were protesting against a government ban on flying the Buddhist flag on the day of Phật Đản.", "how did the government react?", "They alleged that a Việt Cộng guerrilla had caused the incident by setting off the initial explosion, sparking a stampede.", "after the buddhists were killer, what were the community reactions?", "UNANSWERABLE", "did the buddhists have any demands?", "Yes, freedom to fly the Buddhist flag and religious equality between Buddhists and Catholics.", "was there a trial?", "Yes, by Nguyễn Khánh."]}
{"conversations": ["what is massospondylus?", "Genus of sauropodomorph dinosaur", "who discovered this species?", "Joseph Millard Orpen", "where was it found?", "Upper Elliot Formation at Harrismith, South Africa", "what other historic species have been discovered in the country mentioned above?", "Hominid species; Australopithecus africanus, Australopithecus sediba, etc.", "what are the different wars that have happened in this country?", "Boer Wars", "when did the first of these wars happen?", "16 December 1880 - 23 March 1881", "which events caused the outbreak of it?", "Violation of the Sand River Convention of 1852, and the Bloemfontein Convention of 1854, by the British.", "what are some animals found in the country mentioned previously?", "Lions, African leopards, South African cheetahs, etc.", "in which region is the second animal found?", "Most of sub-Saharan Africa", "what does it look like?", "They are pale yellow to deep gold, and is patterned with black rosettes while the head, lower limbs and belly are spotted with solid black.", "what animal does it feed on?", "Rodents, birds, small and large antelopes, etc.", "how long does the fourth animal live?", "It is difficult to determine how long antelope live in the wild.", "can this animal be domesticated?", "Antelope do not typically display traits required for domestication."]}
{"conversations": ["who does melissa george play in greys anatomy", "Sadie Harris", "where was she born?", "Perth, Western Australia", "which was her debut movie?", "\"Dark City\"", "who directed this film?", "Alex Proyas", "when was the series premiered?", "March 27, 2005", "where?", "American Broadcasting Company", "does it broadcast any sport related progammes?", "Sports programming is provided on occasion, primarily on weekend afternoons.", "where is it's studio located?", "Burbank, California", "what was the series about?", "It is an American medical drama television series.", "who produced it?", "It is produced by ShondaLand, in association with The Mark Gordon Company, and ABC Studios.", "who were the other actors in it?", "Ellen Pompeo, Sandra Oh, Katherine Heigl, Justin Chambers, T. R. Knight, Chandra Wilson, James Pickens Jr., Isaiah Washington and Patrick Dempsey.", "where was it filmed?", "Los Angeles, California.", "was it adapted into any other form of art?", "In 2010, \"A Corazón Abierto\" (\"An Open Heart\"), an adaptation of the series, was made by the Colombian network RCN TV. It aired for 2 seasons", "was the film received well?", "The film received generally positive reviews.", "did it get nominated for any award?", "The film won and was nominated for several awards in 1998."]}
{"conversations": ["when did the lyrics to o canada change", "In 1990, 2002, 2018", "does this song have any relation to the country it is about?", "Yes - 'O Canada' is the national anthem of Canada.", "who is the composer of this song?", "Calixa Lavallée", "where is he from?", "Born near Verchères, Quebec in Canada", "can you name some other works of his apart from the former song?", "At age 13, Lavallée performed a piano concert at the Théâtre royal de Montréal; Lavallée worked as a pianist, organist and music teacher, and also conducted orchestral and operatic productions in concert halls, including the Montréal Academy of Music in Montréal", "was the national anthem also written in different languages?", "Yes- English and French.", "who was this song adopted by?", "Special Joint Committee of the Senate and House of Commons on the National and Royal Anthems", "when was the house you mentioned established?", "1867", "who did this house include?", "Speaker, deputy speaker, deputy chair of Committees, assistant deputy chair of Committees", "was the anthem originally written in another language?", "It was originally written in French", "when is this song normally sung?", "provincial law in Manitoba, New Brunswick, Nova Scotia, Ontario and Prince Edward Island mandate the national anthem be played daily in public elementary and secondary schools. \"O Canada\" is to be played in British Columbia schools at least three times a year at assemblies.", "can you mention one etiquette that needs to be followed when the song is being played?", "When it is performed at an event, is to either start or end the ceremonies with the anthem. Civilian men usually remove their hats, while women and children are not required to do so. Military men and women in uniform traditionally keep their hats on.", "was the anthem adapted by anyone?", "Yes - \"O Canada's\" melody was adapted for the school anthem of the Ateneo de Manila University."]}
{"conversations": ["where did 12 years a slave take place", "Principal photography took place in New Orleans, Louisiana", "what is the film about?", "A story of a New York State-born free African-American man who was kidnapped in Washington, D.C., by two conmen in 1841 and sold into slavery.", "mention a few of its marketing scenarios?", "During its marketing campaign, \"12 Years a Slave\" received unpaid endorsements by celebrities such as Kanye West and P. Diddy. In a video posted by Revolt, Combs urged viewers to see \"12 Years a Slave\" by stating: \"This movie is very painful but very honest, and is a part of the healing process.", "where did the first screening happen?", "Telluride Film Festival", "when did such a festival start?", "The festival was started in 1974", "for the aforementioned film, where did the festival organized?", "UNANSWERABLE", "in what style is the festival conducted?", "Each year, an artist is selected to produce the poster art for the festival. The sole requirement for the poster is that the word SHOW be featured.", "who composed the score for the aforementioned film?", "Hans Zimmer", "name a few accolades received by him?", "Lifetime Achievement Award, the Frederick Loewe Award", "mention a few works done by him in the 2020s?", "\"No Time to Die\", \"Hillbilly Elegy\" and  Major League Soccer released an anthem for its 25th season, which was composed by Zimmer.", "how did he start his career with?", "Zimmer began his career playing keyboards and synthesizers in the 1970s, with the band Krakatoa. He worked with the Buggles, a new wave band formed in London in 1977 with Trevor Horn, Geoff Downes, and Bruce Woolley.", "who are the actors in the aforementioned film?", "Chiwetel Ejiofor,  Michael Fassbender, Benedict Cumberbatch, Paul Dano, Paul Giamatti, Lupita Nyong'o, Sarah Paulson, Brad Pitt, and Alfre Woodard feature in supporting roles.", "describe the third actor's image in society?", "He has since been called \"The Thinking Woman's Crumpet\" and has been a mainstay in numerous \"Sexiest Man Alive\" lists including those of \"Empire\" and \"People\". \"Tatler\" listed Cumberbatch in the \"Most Eligible Bachelors in the United Kingdom\"", "does he have a production company?", "Yes, SunnyMarch Ltd.", "is he known for his impression?", "Adept at impersonating others, Cumberbatch was referred to as the \"New King of Celebrity Impressionists\" by \"Vulture\" magazine. He has imitated celebrities on a number of chat shows, such as \"The Graham Norton Show\" on the BBC"]}
{"conversations": ["who did george harrison wrote the song something for", "Pattie Boyd", "who was she?", "She is an English model and photographer.", "who sang the above mentioned song?", "Joe Cocker", "which album is it a part of?", "\"Abbey Road\"", "can you name some of the other tracks from it?", "\"Come Together\"", "can you describe in brief the famous photograph that appeared on the cover of this album?", "The front cover was a photograph of the group on a zebra crossing based on ideas that McCartney sketched", "who clicked it?", "Iain Macmillan", "which organisation did he work for?", "UNANSWERABLE", "can you name the group you talked about with reference to the album cover?", "Beatles", "do they still produce music together?", "No, the group broke up."]}
{"conversations": ["the general surface wind circulation associated with the high-pressure center (h) is most likely", "A high-pressure area, high ,or anticyclone.", "how is it formed?", "Winds within high-pressure areas flow outward from the higher pressure areas near their centers towards the lower pressure areas further from their centers. Gravity adds to the forces. The winds are further twisted due to Coriolis effect.", "could i know more about the effect mentioned above?", "This is an apparent, but fictitious, force that arises when an observer is in a rotating reference frame, due to the conservation of angular momentum of the air as it moves towards or away from the Earth's axis of rotation.", "how is it related to the wind conditions?", "They are associated with light winds at the surface and subsidence through the lower portion of the troposphere.", "what is the last term used above?", "It is the lowest layer of earth's atmosphere.", "what does it consist of?", "Nitrogrn, oxygen, argon, carbon dioxide and small amounts of other gases.", "who discovered the former from the list above?", "Daniel Rutherford.", "what are its properties?", "It has seven electrons and one of the highest electronegativities among the elements.", "what are its uses?", "Synthetically produced nitrogenous compounds like ammonia and nitrates are key industrial fertilisers, and fertiliser nitrates are key pollutants in the eutrophication of water systems.", "regarding, the water systems process mentioned by you, is it a natural process?", "It is mostly caused by phosphate and nitrogen from various human sources.", "where is the scientist mentioned above from?", "Scotland.", "how did he discover the gas?", "By the isolation of the particle."]}
{"conversations": ["where is sedna located in the solar system", "In the outer reaches of the Solar System.", "who discovered it?", "Michael Brown (Caltech), Chad Trujillo (Gemini Observatory), and David Rabinowitz (Yale University).", "who gave it it's name?", "Michael Brown.", "what does it look like?", "It is a large planetoid, surface is redd.", "the system mentioned above, what does it consist of?", "Sun, the giant planets, four terrestrial planets, the dwarf planets, moons, asteroids, and comets.", "the first thing mentioned, does it have any religious inclusion?", "Yes, the Sun was worshipped as the god Ra, personified as the goddess.", "which religion did they worship him as the above?", "Proto-Indo-European religion,  ancient Greek religion, ancient Sumerians.", "does the ancient religion have any concepts of after death revival?", "They believed in an underworld where the spirits of the dead went after death ,also embraced the idea of reincarnation.", "what is the smallest planet in the system mentioned earlier?", "Mercury.", "how does this planet look?", "Mercury has dorsa (also called \"wrinkle-ridges\"), Moon-like highlands, montes (mountains), planitiae (plains), rupes (escarpments), and valles (valleys)."]}
{"conversations": ["when did the movie the thing come out", "1982", "what is the movie about?", "It tells the story of a group of American researchers in Antarctica who encounter the eponymous \"Thing\", a parasitic extraterrestrial life-form that assimilates, then imitates other organisms.", "who wrote it?", "Bill Lancaster.", "who is the director?", "John Carpenter", "where is he from?", "Carthage, New York", "what film genre is he known for?", "Low-budget horror films.", "what are the methods he is known for using in his movies?", "His films are characterized by minimalist lighting and photography, static cameras, use of steadicam, and distinctive synthesized scores (usually self-composed).", "was he married?", "Yes - Carpenter was married to Barbeau from January 1, 1979, to 1984.", "who's films did he take interest in his early days?", "Howard Hawks and John Ford", "where is ford from?", "Cape Elizabeth, Maine.", "what was his position in the war?", "Head of the photographic unit for the Office of Strategic Services.", "what did he do after the war?", "After the war, Ford remained an officer in the United States Navy Reserve."]}
{"conversations": ["how many times has liverpool won the premiership", "Nineteen times", "when was this football club formed?", "In 1892", "who was its founder?", "John Houlding", "what was this person's profession?", "He was the chairman of the Club", "how would you describe this club's badge?", "It has the city's symbol of the liver bird in its badge", "where do they play their home games?", "At Anfield", "is this above place a stadium?", "Yes it is a stadium", "other than sports, does this place also host other events?", "It has been a venue for musicians of different genres as well as evangelical preachers", "approximately how many people can be seated in this place?", "It has a seating capacity of 53,394", "can you name a few players or managers from that sporting club in the 19th century?", "Jürgen Klopp and Rafael Benítez", "when did the first person begin his football career?", "In 1990", "where was he born?", "16 June 1967", "what was the match he played in germany between 2013-2015?", "He managed Dortmund during this time"]}
{"conversations": ["when is the new dr who season starting", "UNANSWERABLE", "what is doctor who (series 10)?", "The main story arc for the first half of the series revolved around the Doctor and Nardole occupying themselves as a university professor and assistant while they guard an underground vault containing Missy, who the Doctor has sworn to protect for a thousand years after her supposed execution.", "who played the main character?", "Peter Capaldi.", "who is this person?", "He is a Scottish actor, writer, director, and singer.", "where was he born?", "Glasgow, Scotland.", "where did he study?", "At St Teresa's Primary School in Possilpark, St Matthew's Primary School in Bishopbriggs and St Ninian's High School, Kirkintilloch, before attending the Glasgow School of Art.", "how did he begin his acting career?", "His first starring role on television was as Luke Wakefield, a strange man who imagines he has witnessed a crime, in the BBC drama series \"Mr Wakefield's Crusade\".", "what is the historical record behind this art school?", "In 2019, GSA was placed 8th in the 2019 QS World Rankings for Art and Design, and the school maintained its 8th place ranking in 2020.", "did any fire break out here?", "Yes, the original Mackintosh building was severely damaged by fire on 23 May 2014.", "how many campuses do they have?", "It has several, The School of Fine Art, The School of Design, The Innovation School and The Mackintosh School of Architecture to name a few."]}
{"conversations": ["i know why the caged bird sings poem explanation", "It is a coming-of-age story that illustrates how strength of character and a love of literature can help overcome racism and trauma.", "who is the author of this poem?", "Maya Angelou.", "where was she born?", "St. Louis, Missouri.", "was she the only child?", "No, she was the second child.", "did she receive any rewards?", "Yes,  the Spingarn Medal, the National Medal of Arts and the Presidential Medal of Freedom.", "what is the latter medal about?", "The Presidential Medal of Freedom is an award bestowed by the president of the United States to recognize people who have made \"an especially meritorious contribution to the security or national interests of the United States, world peace, cultural or other significant public or private endeavors\".", "by which us president was she given this ?", "UNANSWERABLE", "any other famous personalities who have received this medal?", "Colin Powell, Ellsworth Bunker, etc.", "why did the former receive this medal?", "UNANSWERABLE", "what did he do for a living?", "He is an American politician, diplomat and retired four-star general."]}
{"conversations": ["when was family guy cancelled the second time", "2002.", "who were the creators of this show?", "MacFarlane.", "who is the main character?", "Peter Griffin.", "who is he?", "He is a fictional character who is married to Lois Griffin and is the father of Meg, Chris, and Stewie.", "who dubs the speech for this character?", "Seth MacFarlane.", "who are the ancestors of the character?", "Father Mickey McFinnigan, mother Thelma, raised by Francis and Thelma Griffin.", "who is the voice-actor mentioned above?", "He is an American actor, animator, writer, producer, director, comedian, and singer.", "any other shows he has been in?", "The Orville, American Dad and The Cleveland Show.", "any movies he has been in?", "Ted, Ted 2 and A Million Ways to Die in the West.", "when was the last movie released?", "2014.", "who was the director of it?", "Seth MacFarlane.", "who composed the music for it?", "Joel McNeely.", "what genre is this movie?", "American Western comedy."]}
{"conversations": ["what is an oribi?", "It is a small antelope.", "where is it found?", "Eastern, southern and western Africa from savannahs, floodplains and tropical grasslands", "how does it look like?", "This antelope features a slightly raised back, and long neck and limbs. The glossy, yellowish to rufous brown coat contrasts with the white chin, throat, underparts and rump. The bushy tail, brown to black on the outside, has white insides.", "what family does it belong to?", "It was the sole member of its genus", "can you tell me about its diet?", "Oribi prefers fresh grasses and browses occasionally. Grasses can constitute up to 90% of the diet; preferred varieties include \"Andropogon\", \"Eulalia\", \"Hyparrhenia", "is it under threat of extinction?", "They are estimated as Vulnerable. Hunting is a relatively minor threat,  numbers have also declined due to agricultural expansion and competition from livestock.", "have any steps been taken for their protection?", "Yes, The oribi occurs in a number of protected areas throughout its range, such as: Gashaka Gumti National Park in Nigeria, the Pendjari and W National Parks (Benin); Aouk Hunting Zone (Chad); Benoue, Bouba Njida and Faro National Parks (Cameroon); Manovo-Gounda St. Floris National Park (Central African Republic);", "what type of other animals are found in the first park?", "Some species include yellow-backed duiker, African golden cat (\"Profelis aurata\"), The African buffalo, the largest population in Nigeria of chimpanzee (\"Pan troglodytes\")", "and plant species?", "Red sunbird bush, an ornate species of the acanthus family", "where is this park located?", "Nigeria", "how does this country get its name?", "The name from the Niger River running through the country."]}
{"conversations": ["is avatar aang in the legend of korra", "Yes. Voiced by D.B. Sweeney", "what exactly is this avatar?", "It is a fictional character and the protagonist of Nickelodeon's animated television series", "what is the personality like?", "He is a vegetarian, reluctant to fight and kill", "does he have any power?", "Yes. He can  easily overcome any opponent that tries to fight him. He can also use all 4 elements at the same time.", "which four elements are those?", "Air, water, earth and fire", "who created the character?", "Michael Dante DiMartino and Bryan Konietzko", "which series does it belong to?", "The Last Airbender", "who are the characters in this series?", "Avatar Roku, Aang, Monk Gyatso,", "where was it filmed?", "UNANSWERABLE", "has it won any awards?", "UNANSWERABLE", "where is the former creator of the character from?", "Shelburne, Vermont."]}
{"conversations": ["what are the 3 smallest bones in the human body", "Strapes is one of them", "what is the size of this above bone?", "Roughly 3 x 2.5mm", "which part of the body is this located?", "Middle ear of humans", "besides the human, is this bony structure present in other living species in the animal kingdom?", "It is one of three ossicles in mammals, in non-mammalian four-legged animals its homologous form is called the columella", "what are the functions this bony structure serves?", "It transmits sound vibrations from the incus to the oval window, a membrane-covered opening to the inner ear.", "are there any variations of this bony structure?", "It appears to be relatively constant in size in different ethnic groups", "can this bony structure get affected or impaired?", "Yes, its impairment causes conductive hearing loss", "is there any remedy to solve this?", "Two common treatments are stapedectomy and stapedotomy", "how is the first treatment that you mentioned - carried out?", "It is the surgical removal of the stapes and replacement with an artificial prosthesis", "what are some of the complications involved?", "Causes fibrosis-related damage to the base of the bone, or obliterative otosclerosis, resulting in obliteration of the base.", "what does the term otosclerosis mean?", "A condition where one or more foci of irregularly laid spongy bone replace part of normally dense enchondral layer of bony otic capsule in the bony labyrinth.", "what is the main difference between the treatment we discussed versus stapedotomy?", "In the former the Stapes is replaced by artificial prosthesis whereas in the latter an artificial prosthesis is inserted by making a small hole in the base of the stapes", "with reference to the tiny bone discussed earlier, when does the development of it begin?", "From the second pharyngeal arch during the sixth to eighth week of embryological life.", "is there any intellect who first observed and discussed this tiny bony structure?", "Yes, Giovanni Filippo Ingrassia although there is some controversy regarding it", "what is the profession of this mentioned person?", "Italian physician and professor at the University of Naples"]}
{"conversations": ["is karen gillan in the fires of pompeii", "Karen Gillan returned in the fifth series to play Amy Pond.", "what is the fires of pompeii?", "It is the second episode of the fourth series of the British science fiction television series \"Doctor Who\".", "what is its storyline?", "The Tenth Doctor and Donna arrive in Pompeii the day before the eruption of Mount Vesuvius in 79.", "who is the aforesaid person?", "UNANSWERABLE", "who is the aforesaid actress mentioned in the series?", "She is a Scottish actress, filmmaker and former model.", "where was she born?", "Inverness.", "how did she begin her career as an actress?", "Her early television acting career included guest appearances on several television shows, with her first role being in an episode of ITV crime drama \"Rebus\".", "what is this latter mentioned?", "It is a puzzle device that combines the use of illustrated pictures with individual letters to depict words and/or phrases.", "how is picture associated with this?", "The term \"rebus\" also refers to the use of a pictogram to represent a syllabic sound.", "what is the aforementioned british tv series all about?", "It is a detective drama series based on the \"Inspector Rebus\" novels.", "what is its premises?", "\"Doctor Who\" follows the adventures of the title character, a rogue Time Lord with somewhat unknown origins who goes by the name \"the Doctor\".", "what was revealed about this character?", "In \"The Name of the Doctor\", the Eleventh Doctor tells companion Clara Oswald that the name \"Doctor\" is essentially a promise he made."]}
{"conversations": ["in which country did the battle of sio take place?", "Papua New Guinea.", "on what date did this fight begin?", "December 1943.", "whom was it fought between?", "Australian and Papuan forces , and the Japanese.", "what were the causes which led to this clash?", "To remove the Japanese control over the region.", "what weapons were used to fight in this?", "Artillery guns and tanks.", "can you name anyone warrior or commander who belonged to the first force mentioned previously who fought in this?", "Lieutenant General Frank Berryman.", "what's the above person's date of birth?", "11 April 1894.", "which place was he born?", "Geelong, Victoria.", "can you name a few countries in which he landed to participate in battles?", "Egypt and France.", "can you name anyone warrior or commander who belonged to the second country's force mentioned previously who fought in sio?", "UNANSWERABLE", "can you name anyone warrior or commander who belonged to the third country's force mentioned previously who fought in that battle?", "Lieutenant General Shigeru Katagiri .", "on what date did this battle end?", "March 1944.", "in the end, who claimed victory?", "Both sides managed to accomplish their objectives; the Japanese withdrew, while the Australians exacted a terrible toll.", "approximately many people died in this fight?", "Around 2,700 Japanese troops died.", "with reference to the warrior/commander who was born in victoria, whom did he marry?", "Muriel Whipp."]}
{"conversations": ["what is neighborhood watch?", "An episode of  television series \"White Collar\".", "which episode is it?", "Thirteenth", "who is the producer of this episode?", "UNANSWERABLE", "when did this episode release?", "January 31, 2012", "who are the characters in this episode?", "Elizabeth Burke, Mozzie, Neal Caffrey", "what is the role played by the first character?", "UNANSWERABLE", "how is the personality of the third character?", "He s presented as a charming, sophisticated gentleman with a wide range of knowledge.", "where is he from?", "St. Louis, Missouri", "was he also a con artist?", "Yes", "who did he work for as an artist?", "No one, he began running cons with Kate and Mozzie.", "how is he related to peter burke?", "Agent Peter Burke was the case agent assigned to catch him.", "where was this episode produced?", "UNANSWERABLE", "how much rating did the episode receive?", "It ranked eleventh overall in the 18–49 demographic for the night and finished fifth in its timeslot."]}
{"conversations": ["what are the life stages of a dragonfly", "Dragonflies are hemimetabolous insects; they do not have a pupal stage and undergo an incomplete metamorphosis with a series of nymphal stages from which the adult emerges.", "what are they ?", "It is an insect belonging to the order Odonata, infraorder Anisoptera.", "any conservation efforts to protect it ?", "In 1997, the International Union for Conservation of Nature set up a status survey and conservation action plan for dragonflies.", "talk about their coloration ?", "It is often a combination of yellow, red, brown, and black pigments, with structural colours.", "what are its behavior patterns ?", "Many dragonflies, particularly males, are territorial. Some defend a territory against others of their own species, some against other species of dragonfly and a few against insects in unrelated groups.", "what about its sex ratios ?", "The sex ratio of male to female dragonflies varies both temporally and spatially.", "what are their flight speeds ?", "It can travel at 100 body-lengths per second in forward flight, and three lengths per second backwards.", "what are their cultural references ?", "Many Native American tribes consider dragonflies to be medicine animals that had special powers.", "how are they described in poetry and literature ?", "Lafcadio Hearn wrote in his 1901 book \"A Japanese Miscellany\" that Japanese poets had created dragonfly \"haiku\" \"almost as numerous as are the dragonflies themselves in the early autumn.\"", "who is this person ?", "Japanese writer", "where was he born ?", "Greek Ionian Island of Lefkada", "what legacy he left behind ?", "In later years, some critics would accuse Hearn of exoticizing Japan, but because he offered the West some of its first descriptions of pre-industrial and Meiji Era Japan, his work is generally regarded as having historical value."]}
{"conversations": ["does callie baby die in season 7 episode 18", "No", "who plays the character mentioned above?", "Sara Ramirez.", "apart from acting, does she have a career in any other profession?", "She is a singer and songwriter.", "name some of her songs ?", "Silent Night", "what is the significance of the above song?", "It is a popular Christmas carol", "who has written it?", "Joseph Mohr", "the above mentioned episode is from which series?", "\"Grey's Anatomy\"", "name some characters of it.", "Meredith Grey, Alex Karev, Miranda Bailey and Richard Webber", "what is the real name of the third character mentioned in the above list?", "Chandra Wilson", "which movie did she debute in?", "\"Philadelphia\"", "what was it about?", "It is a 1993 American legal drama film to acknowledge HIV/AIDS, homosexuality, and homophobia."]}
{"conversations": ["who has played fiyero in wicked on broadway", "Norbert Leo Butz", "who composed the lyrics for this musical?", "Stephen Schwartz", "is this musical adapted from a story?", "Yes, it is based on a novel by Gregory Maguire, which is a retelling of \"The Wonderful Wizard of Oz\" by L. Frank Baum.", "what is this story about?", "It chronicles the adventures of a young farm girl named Dorothy in the magical Land of Oz, after she and her pet dog Toto are swept away from their Kansas home by a cyclone.", "what is the genre of this musical?", "UNANSWERABLE", "where was it recorded?", "UNANSWERABLE", "who produced this musical?", "Universal Stage Productions in coalition with Marc Platt, Jon B. Platt and David Stone.", "where was it first premier?", "October 2003", "did this musical go on an international tour?", "Yes, the tour opened at the Alhambra Theatre in Bradford, England.", "who founded this theatre?", "UNANSWERABLE", "how is the australian productions related to this musical?", "This production of the musical opened on July 12, 2008, with previews commencing June 27 at the Regent Theatre in Melbourne."]}
{"conversations": ["what does gulf stream refer to?", "It is a warm and swift Atlantic ocean current", "where does it originate?", "It originates in the Gulf of Mexico and stretches to the tip of Florida, and follows the eastern coastlines of the United States and Newfoundland before crossing the Atlantic Ocean as the North Atlantic Current.", "does it help a cyclone to form?", "Its presence has led to the development of strong cyclones of all types, both within the atmosphere and within the ocean.", "does it have any specific properties?", "It is a western-intensified current, driven largely by wind stress.", "did it's origin witness any shipwreck?", "A ship \"Mardi Gras\" sank around the early 19th century about off the coast of Louisiana in of water. The German submarine \"U-166\" was a Type IXC U-boat of Nazi Germany's \"Kriegsmarine\" during World War II was laid down.", "where does the submarine belong to?", "The Kriegsmarine, navy of Nazi Germany", "how many ships it has?", "UNANSWERABLE", "is there any destroyer a part of it?", "Yes,  Zerstörer", "how are the navy personnel ranked?", "UNANSWERABLE", "is there any air unit they operate?", "Trägergeschwader 186"]}
{"conversations": ["what is the location of mars in the solar system", "Mars is the fourth planet from the Sun", "is it known by any other names?", "Yes, \"Red Planet\" in English", "are there any volcanoes there?", "Yes, Olympus Mons", "who named it?", "Named after observations made by Mariner 9", "what was that?", "From Nix Olympica; a volcano. Astronomers adopted the name \"Olympus Mons\" for the albedo feature known as Nix Olympica", "was that a spaceship that made the observations?", "It was a robotic space probe", "have any other space probes landed on the planet discussed above?", "Yes, \"Mariner 4\", \"Viking 1\", etc", "did the first one land on the planet or was it just a fly by?", "A flyby mode", "how did it meet its end?", "The gas supply in the attitude control system was exhausted, and between December 10 and 11, a total of 83 micrometeoroid hits perturbation of the spacecraft's attitude and degradation of the signal strength", "what is found at the polar regions of the planet?", "The caps at both poles consist primarily (70%) of water ice; frozen carbon dioxide layer is in northern cap and south cap has a permanent dry ice cover", "are there any features resulting from impacts?", "Yes, impact craters", "are they named?", "Yes, Hellas impact basin", "is there any discussion about the intelligent lifeform on the planet?", "Yes, fashionable idea of intelligent Martians", "how are they portrayed in fiction?", "W. S. Lach-Szyrma's novel \"Aleriel, or A Voyage to Other Worlds\" is the first published work to apply the word \"Martian\" as a noun.", "are they seen as invaders?", "Yes, in fiction; in H. G. Wells' novel \"The War of the Worlds\""]}
{"conversations": ["how many post credit scenes in ant mand and the wasp", "Two.", "what is this ant-man?", "It is an American superhero film.", "what is the storyline of this film?", "Two years after Scott Lang was placed under house arrest due to his involvement with the Avengers, in violation of the Sokovia Accords, Hank Pym and his daughter Hope van Dyne briefly manage to open a tunnel to the quantum realm.", "what is the definition of this aforesaid genre of film?", "Action, comedy.", "who directed the film mentioned?", "Peyton Reed.", "where is he from?", "Raleigh, North Carolina.", "how did he begin his career?", "Peyton Reed was a DJ for WXYC, the UNC student radio station, during his time enrolled at the university. He worked as a van driver on the set of Bull Durham in 1987, which was filmed in his hometown of Raleigh, North Carolina. He also recorded music under the name manCHILD with UNC classmate Norwood Cheek.", "what are some films he made?", "\"Bring It On\", \"Down with Love\", \"The Break-Up\", \"Yes Man\", \"Ant-Man\" and its sequel, \"Ant-Man and the Wasp\".", "who are the main actors in the third one?", "Vince Vaughn and Jennifer Aniston.", "who is the former actor?", "He is an American actor, producer, screenwriter, and comedian.", "where did he spend his early days?", "He grew up in Buffalo Grove, Illinois, then moved to Lake Forest. He was introduced to musical theater at a young age and decided to become an actor in 1987"]}
{"conversations": ["arwen's dad in lord of the rings", "Her father was Elrond half-elven, a descendant of the Man Tuor.", "what is an elven?", "UNANSWERABLE", "who created the aforementioned character?", "J. R. R. Tolkien", "are there any other names of the character?", "UNANSWERABLE", "is the character referred in any literature?", "Yes, in \"The Tale of Aragorn and Arwen\".", "what kind of literary work is it?", "The tale is set in the Third and Fourth Ages of fictional universe.", "is it a novel?", "It is a story within the Appendices of J. R. R. Tolkien's \"The Lord of the Rings\".", "what is the story about?", "It narrates the love of the mortal Man Aragorn and the immortal Elf-maiden Arwen, telling the story of their first meeting, their eventual betrothal and marriage, and the circumstances of their deaths.", "who is the mortal man?", "Aragorn is a fictional character who was a Ranger of the North, first introduced with the name Strider and later revealed to be the heir of Isildur, King of Gondor. He was a confidant of Gandalf and part of the quest to destroy the One Ring and defeat the Dark Lord Sauron.", "does he have any other names?", "\"Trotter\" \"Strider\" “Padathir” and \"Du-finnion” to name a few.", "was he depicted in any film?", "Yes, \"The Hunt for Gollum\".", "what is the film about?", "The film is set in Middle-earth, when the wizard Gandalf the Grey fears that Gollum may reveal information about the One Ring to Sauron. Gandalf sends ranger Aragorn on a quest to find Gollum.", "who was in charge of its vfx?", "Adam Thomas", "who is he?", "UNANSWERABLE", "who was its director?", "UNANSWERABLE"]}
{"conversations": ["who is elwyn roy king?", "A fighter ace in the Australian Flying Corps (AFC) during World War I", "has he been a part of any other war?", "Yes - World War II", "how did he die?", "cerebral oedema", "did he get a military funeral service?", "Yes - his funeral service was attended by hundreds of mourners from the military and civil aviation world", "did an air staff chief attend it?", "Yes - Sir Charles Burnett", "the flying corps that king served, when was it formed?", "1912", "do they provide trainings?", "Yes - they conduct both pilot and mechanic training", "what are the causes of the disease king had?", "Brain injuries from ischemic stroke, subarachnoid hemorrhage, traumatic brain injury etc", "how can we diagnose it?", "Close monitoring of a person's level of consciousness; awareness of any new or worsening focal neurological deficits; Immediate recognition of Cerebral edema and brain herniation", "can it be treated?", "perfusion, oxygenation, and venous drainage, decrease cerebral metabolic demands, and to stabilize the osmolality pressure gradient between the brain and the surrounding vasculature."]}
{"conversations": ["where do jet streams occur in the atmosphere", "On Earth, the main jet streams are located near the altitude of the tropopause and are westerly winds", "how were they discovered?", "In 1920s, Wasaburo Oishi, detected the jet stream from a site near Mount Fuji.", "where is this mountain located?", "It is  located on the island of Honshū, is the highest mountain in Japan", "how do people climb this mountain?", "Climbers usually start at the fifth stations, as these are reachable by car or by bus. The summit is the tenth station on each trail. The stations on different routes are at different elevations", "is it a volcanic mountain?", "Yes, Scientists have identified four distinct phases of volcanic activity in the formation of Mount Fuji. The first phase, called \"Sen-komitake\", is composed of an andesite core recently discovered deep within the mountain.", "is it a threat currently?", "Yes,  indicators suggestive of heightened eruptive danger, such as active fumaroles and recently discovered faults, are typical occurrences at this type of volcano.", "are there any adventure activities nearby it?", "Yes, Several paragliding schools use the wide sandy/grassy slope between Gotemba and Subashiri parking lots as a training hill.", "how do you reach to this mountain?", "The closest airport with scheduled international service is Mt. Fuji Shizuoka Airport.", "which is the famous sport in the country where this mountain located?", "Traditionally, sumo is considered Japan's national sport. Japanese martial arts such as judo, karate and kendo are also widely practiced and enjoyed by spectators in the country.", "which are the famous tourist attractions there?", "UNANSWERABLE", "what type of food do they have?", "Japanese curry, \"wagashi\", green tea ice cream.", "how is the first mentioned dish served?", "Japanese curry rice is served in anything from a flat plate to a soup bowl. The curry is poured over rice in any manner and amount.", "when was this curry known in the country?", "Curry was introduced to Japan during the Meiji era."]}
{"conversations": ["what does patterns in nature refer to?", "They are visible regularities of form found in the natural world.", "what patterns does it include?", "It includes symmetries, trees, spirals, meanders, waves, foams, tessellations, cracks and stripes.", "what is it caused by?", "Causes can be in the mathematics that governs what patterns can physically form, and among living things in the effects of natural selection, that govern how patterns evolve.", "were these indicated in any books?", "UNANSWERABLE", "can you name anyone from history who has done such researches on this?", "Leonardo da Vinci", "where was he born?", "In the Tuscan hill town of Vinci", "was he into painting?", "Yes his main achievement is as a painter", "can you name some of his works?", "\"Baptism of Christ\"", "when was it painted?", "UNANSWERABLE", "what was it about?", "UNANSWERABLE", "when did he die?", "On 2 May 1519"]}
{"conversations": ["who elected senators under the provisions of the constitution as originally ratified", "State legislative election.", "who proposed this amendment?", "The Seventeenth Amendment (Amendment XVII).", "when did it become the part of constitution?", "On April 8, 1913.", "what were the issues related to it?", "Legislative corruption and electoral deadlocks.", "who were reformers for the calls for constitutional amendment?", "Barack Obama (President), Joe Biden (Vice President), Hillary Clinton (Secretary of State), and Ken Salazar (Secretary of the Interior).", "who is the first one?", "He is an American politician and attorney who served as the 44th president of the United States.", "where was he from?", "Honolulu, Hawaii.", "what is his religious stance?", "Obama commented on his religious views, saying: I'm a Christian by choice.", "what did he do for lgbtq?", "He signed the Matthew Shepard and James Byrd Jr. Hate Crimes Prevention Act, a measure that expanded the 1969 United States federal hate-crime law to include crimes motivated by a victim's actual or perceived gender, sexual orientation, gender identity, or disability.", "which acts were signed by him in domestic policy?", "Lilly Ledbetter Fair Pay Act of 2009, Health Care and Education Reconciliation Act, Patient Protection and Affordable Care Act."]}
{"conversations": ["the wolf and the lion game of thrones episode", "Fifth episode", "can you mention any characters from this episode?", "Lord Eddard Stark, Tyrion Lannister, Catelyn Stark", "can you mention any actor from this episode?", "Finn Jones, Kate Dickie, Lino Facioli, Brendan McCormack were some of them.", "where was the episode shot?", "The Paint Hall studio, Shane's Castle, Fort St Angelo (Maltese town of Vittoriosa).", "the castle that you just mentioned, is it a real castle?", "Yes, it is a ruined castle near Randalstown in County Antrim, Northern Ireland.", "when was it built?", "1345", "by whom?", "A member of the Clandeboy O'Neill dynasty.", "has it served as the filming location for any other works?", "UNANSWERABLE", "what are the origins of the dynasty that you just mentioned?", "Irish Gaelic origin", "were they rulers?", "Yes, they were Kings of Cenél nEógain.", "do they have any successors in foreign nations?", "Yes, in Scotland.", "what is their family crest?", "The coat of arms were white with a red left hand  (though a right hand is used today). The red hand by itself has become a symbol of the O'Neill name.", "what does this left hand represent?", "The high kings."]}
{"conversations": ["who was adam eckfeldt?", "John Adam Eckfeldt was a worker and official of the United States Mint.", "when did he start designing coins?", "1793", "which coins did he work on in the mint?", "1792 half disme", "what was his contribution as a chief coiner?", "He put aside interesting foreign coins sent to the mint as bullion. These pieces became the Mint's Cabinet, or coin collection.", "where is this collection housed?", "Smithsonian Institution", "when was it founded?", "August 10, 1846", "how many of these museums are there?", "Nineteen", "what are their publications?", "\"Smithsonian\" magazine.", "who started this magazine?", "S. Dillon Ripley", "is there anything notable about display of 'enola gay' there?", "The magazine changed the exhibit, displaying the aircraft only with associated technical data.", "where is the museum located?", "UNANSWERABLE"]}
{"conversations": ["we would expect what with low pressure in the northern hemisphere", "234 significant extratropical cyclones form each winter", "how does a low pressure area form?", "Cyclogenesis is the development and strengthening of cyclonic circulations", "what does the first word mean?", "It  is the development and strengthening of cyclonic circulations in the atmosphere results in the formation of low pressure area", "how is this associated with the weather?", "UNANSWERABLE", "what are some of its related terms?", "It is the opposite of cyclolysis", "which scaled are used to measure it?", "The macroscale, the synoptic scale, the mesoscale, and the microscale", "what does the first one do?", "It deals with systems with global size, such as the Madden–Julian oscillation", "who invented the second one?", "UNANSWERABLE", "what is the function of the third one?", "It deals with  the study of weather systems smaller than synoptic scale systems but larger than microscale and storm-scale cumulus systems", "is the fourth one the opposite of the first one?", "Yes, it is smallest of the meteorological scales", "what results does the second one give?", "It  covers a portion of a continent, such as extratropical cyclones, with dimensions of across", "where do low pressure areas form?", "It forms where the air pressure is lower than that of surrounding locations"]}
{"conversations": ["where is chad located?", "North-central Africa.", "what kind of weather does it have?", "Tropical", "which ethnic groups are based there?", "Sara, Arabs, Toubous", "is the first group based in any other country as well?", "Yes - Central African Republic, Sudan", "what is the status of human rights in the second place?", "Muslims who convert to Christianity can face the death penalty,  88% of women in Sudan had undergone female genital mutilation, restricting women's rights and allowing child marriage", "which international organizations are trying to help the people there?", "World Food Program (WFP), the United Nations Development Programme (UNDP), Operation Lifeline Sudan (OLS)", "why was the last one formed?", "April 1989", "what is the purpose of the second organization?", "Technical and investment cooperation among nations; advocate for change; connect countries to knowledge, experience and resources to help people build a better life", "what is their contribution towards tackling hiv/aids?", "To prevent spreading of and reduce the impact of HIV/AIDS", "which criticism has it have to face?", "Irregularities in its finances in North Korea; counterfeit US dollars in the Programmes safe"]}
{"conversations": ["who is josh hutcherson?", "He is an American actor and producer.", "does he own any production company?", "No.", "what was his role in the film that gave him a breakthrough?", "Jesse Aarons.", "and which movie was it?", "Bridge to Terabithia.", "what is the storyline of it?", "It tells the story of bullied kids Jesse Aarons and Leslie Burke, 12-year-old neighbors who create a fantasy world called Terabithia and spend their free time together in an abandoned tree house.", "who sort of film is it?", "UNANSWERABLE", "what is its genre?", "Fantasy adventure film.", "who managed the graphical effects?", "Weta Digital.", "who owns it?", "Peter Jackson, Richard Taylor, and Jamie Selkirk.", "can you name a few movies in which they have worked?", "King Kong, Avatar and The Jungle Book."]}
{"conversations": ["what do dc stand for in washington dc", "District of Columbia.", "where is it located ?", "In the United States of America.", "name some landmarks located here ?", "The Lincoln Memorial, the United States Capitol, the Washington Monument and the Jefferson Pier, to name a few.", "how is the crime rate here ?", "A 2010 study found that 5% percent of city blocks accounted for more than 25% of the district's total crimes.", "name some sister cities of this city ?", "Paris and Rome.", "name some public transportation found in this city ?", "Roadways, metro and airports, to name a few.", "when was the fist memorial mentioned above constructed ?", "1868.", "why was it constructed ?", "It was public memorial to United States President Abraham Lincoln.", "what educational qualification he held ?", "He was mostly self-educated, except for some schooling from itinerant teachers of less than 12 months aggregate.", "what were his religious beliefs?", "He was a religious skeptic.", "what was his mothers name ?", "Nancy Lincoln.", "how did she die ?", "Milk sickness.", "was he assassinated ?", "Yes, by John Wilkes Booth.", "when was he assassinated ?", "April 15, 1865.", "when did he become the president ?", "1861.", "was ever re elected ?", "Yes, on March 4, 1865, Lincoln delivered his second inaugural address."]}
{"conversations": ["google what is the capital of new york", "Albany", "is it a place of immigrants?", "Yes, it has Dutch, Germans, English,  Italians and Poles, to name a few.", "can you name some of its historical sites?", "The Ten Broeck Mansion, USS \"Slater\" (DE-766) museum ship.", "is it a technologically advanced city?", "Yes, Tech Valley is a marketing name for the eastern part - a high-tech competitor to regions such as Silicon Valley and Boston.", "the latter valley you mentioned; from where did its name originate?", "The word \"silicon\" in the name originally referred to the large number of innovators and manufacturers in the region specializing in silicon-based MOS transistors and integrated circuit chips.", "is there any computer club located here?", "Yes, the Homebrew Computer Club", "what kind of club is this?", "An early computer hobbyist group - played an influential role in the development of the microcomputer revolution and the rise of that aspect of the Silicon Valley information technology industrial complex.", "when was it started?", "March 1975", "who are its members?", "Steve Jobs and Steve Wozniak, George Morrow, John Draper", "to which family does the first person belongs?", "He was born to Abdulfattah Jandali and Joanne Schieble, and was adopted by Paul and Clara Jobs (née Hagopian).", "is he related to any company that manufactures computers?", "Yes, Apple Inc.", "how is he connected to disney?", "He was a member of The Walt Disney Company's board of directors following its acquisition of Pixar.", "is this last mentioned thing another company?", "No, it is an American computer animation studio", "where is it located?", "Emeryville, California", "the desktop manufacturing company you mentioned earlier; what are its other products?", "iPhone, iPad,  the Mac, iPod etc."]}
{"conversations": ["who was the james bond character based on", "A number of elements had a real-life background, taken from people whom the author knew or events he was aware of. Some aspects of the character and tastes replicate those of the author himself.", "what is the inspiration behind the specific number used to refer to the character?", "It was assigned by the author in reference to one of British naval intelligence's key achievements of World War I and helped in breaking the German diplomatic code.", "which movies does this character appear in?", "\"Dr. No”, \"You Only Live Twice”, \"On Her Majesty's Secret Service” and \"Diamonds Are Forever” are some of them.", "are these movies based on any novel?", "\"Dr. No” is based on the 1958 novel of the same name by Ian Fleming.", "who is this author?", "Ian Fleming", "did he fight in any war?", "Yes, the \"Second World War\".", "when did he start writing the novels?", "1952", "anything significant about the style in which he wrote?", "He used to write for about three hours in the morning and another hour between six and seven in the evening. He would never correct anything and I never go back to see what he had written.", "how did he die?", "Heart attack.", "of the four movies mentioned earlier, when was the second one released?", "1967", "who were the main cast members?", "Sean Connery", "which character did he play?", "He starred as the fictional MI6 agent \"James Bond\".", "how was it received among critics?", "The reviews were mixed. An example of a negative review by Roger Ebert of the \"Chicago Sun-Times\" rated the film two-and-a-half stars out of four, in which he criticised the focus on gadgets and stated \"the formula fails to work its magic\"."]}
{"conversations": ["when was the idea of an atom first developed describe this theory", "According to this idea, if one were to take a lump of matter and cut it into ever smaller pieces, one would eventually reach a point where the pieces could not be further cut into anything smaller.", "who talked about this theory for the first time?", "John Dalton", "apart from this theory, what were his other contributions to science?", "Colour blindness.", "what happens when someone has this condition?", "It is the decreased ability to see color or differences in color. It can impair such tasks as selecting ripe fruit, choosing clothing, and reading traffic lights. People may also be uncomfortable in bright environments and have decreased visual acuity.", "how is it diagnosed?", "\"The Ishihara Color Test\"", "who is named after?", "Shinobu Ishihara", "where was he from?", "Tokyo", "how did the city derive its name?", "UNANSWERABLE", "can you name some of its major landmarks?", "\"Tokyo Tower\" and \"Tokyo Skytree\" are two of them.", "what does the former primarily function as?", "It functions as a radio and television broadcasting antenna support structure and is a tourist destination that houses several different attractions."]}
{"conversations": ["where did the gunpowder come from in the gunpowder plot", "They were discovered hidden under piles of faggots and coal.", "what was the main aim of this plot?", "To kill King James.", "this plot was led by whom?", "A group of provincial English Catholics led by Robert Catesby.", "what was to restore by killing the king?", "Elizabeth, was to be installed as the Catholic head of state.", "did they succeed in killing king?", "No, it was a failed assassination attempt.", "what was the outcome they faced when failed?", "Although Catesby and Percy escaped the executioner, their bodies were exhumed and decapitated, and their heads exhibited, some were tied to hurdles and dragged through the crowded streets of London, Thomas, Ambrose. Robert and Guy Fawkes were hanged", "when was he born the leader who led this plot?", "After 2 March 1572", "was he married?", "Yes, to Anne Throckmorton", "from which college did he finish his studies?", "Seminary college of Douai", "any notable relatives of him?", "Yes, Kit Harington"]}
{"conversations": ["where is sauron during the lord of the rings", "He rules the land of Mordor", "where is this land?", "It lay to the east of Gondor and the great river Anduin, and to the south of Mirkwood.", "where does this character and place make a mention?", "The Lord of the Rings", "what is this?", "An epic high fantasy novel", "can you explain the physical appearance of the ruler mentioned above?", "Sauron took the form of a werewolf. Then he assumed a serpent-like form, and finally changed back \"from monster to his own accustomed [human-like] form\".", "who has written the above mentioned novel?", "J. R. R. Tolkien.", "what was her view on religion?", "He was a Roman Catholic and had a  special devotion to the blessed sacrament; he encouraged frequent reception of Holy Communion to his son", "where was he from?", "England", "can you name some other novels by him?", "The Hobbit, The Children of Húrin", "when was the second book that is mentioned above, published?", "17 April 2007"]}
{"conversations": ["where does the man with the golden gun take place", "Britain", "who are the actors?", "Christopher Lee, Joseph Wiseman, Britt Ekland", "is this a movie?", "Yes", "who composed the music?", "John Barry", "when was it released?", "Released in the United Kingdom the same day it was premiered", "can you please name some movies the third actress acted in?", "\"The Night They Raided Minsky's\", \"Get Carter\", \"The Wicker Man\"", "did the original movie have stunt men?", "Yes, a stuntman drove the \"car plane\" to a runway.", "what kind of reviews did it receive?", "Mixed reviews", "what themes did it have?", "1973 energy crisis", "were any props used?", "Three Golden Gun props were made"]}
{"conversations": ["where do the nuclear and weak interaction forces occur", "In the Nuclear Fission", "what is this process about?", "The weak interaction, also known as the weak force or weak nuclear force, is the mechanism of interaction between subatomic particles responsible for the radioactive decay of atoms.", "what is meant by the process where it occur?", "Nuclear fission is a nuclear reaction or a radioactive decay process in which the nucleus of an atom splits into two or more smaller, lighter nuclei.", "who discovered it?", "German Otto Hahn and his assistant Fritz Strassmann", "where is the former from?", "He was from Frankfurt am Main", "what else has he discovered?", "Radioactive isotopes of radium, thorium, protactinium and uranium, Phenomena of Radioactive recoil & Nuclear Isomerism among many others.", "did he receive any award?", "Yes. Nobel Prize in Chemistry in 1944 along with many others.", "how someone gets selected for this prize?", "One is awarded for outstanding contributions in chemistry, physics, literature, peace, and physiology or medicine.", "how much money does the winner get?", "UNANSWERABLE", "who founded this award?", "The executors of his will were Ragnar Sohlman and Rudolf Lilljequist founded this award as per Alfred Nobel's last Will.", "who was the scientist mentioned last?", "UNANSWERABLE", "will it be presented posthumously?", "UNANSWERABLE"]}
{"conversations": ["the mitochrondria is the powerhouse of the cell", "Yes.", "who was the first to discover it?", "Richard Altmann.", "what exactly is it?", "It is a semi autonomous double-membrane-bound organelle found in most eukaryotic organisms.", "who is the above-mentioned person?", "A German pathologist and histologist.", "when did he discover this organelle mentioned above?", "1890.", "where is he from?", "Deutsch Eylau in the Province of Prussia.", "where is this province located?", "Kingdom of Prussia.", "who are the natives of this kingdom?", "UNANSWERABLE", "which year did it experience a plague?", "1708.", "has it experienced any wars?", "Thirty Years' War, the Great Northern War and others.", "where was the latter war fought?", "Swedish Holstein-Gottorp, Swedish Livonia, and Swedish Ingria among others.", "when did it end?", "1721.", "what was the reason behind the start of the war?", "The war began when an alliance of Denmark–Norway, Saxony and Russia, sensing an opportunity as Sweden was ruled by the young Charles XII, declared war on the Swedish Empire.", "did the former war mentioned earlier, really stretch for thirty years?", "Yes, from 1618 to 1648.", "how many lives were lost to it?", "Estimates range from 4.5 to 8 million."]}
{"conversations": ["when was the first man made diamond made", "1954", "what are the materials required to make this?", "Pure carbon, the belt press, the cubic press and the split-sphere (BARS) press.", "what temperature-pressure conditions are required fopr this?", "High pressure, high temperature.", "can you mention any of its uses?", "Machine tools and cutting tools; as a Thermal conductor; as an Optical material; semiconductors ; gemstones", "what is the first one?", "A machine for handling or machining metal or other rigid materials, usually by cutting, boring, grinding, shearing, or other forms of deformation", "can you provide me the historical background for such tools?", "Forerunners of machine tools included bow drills and potter's wheels, which had existed in ancient Egypt prior to 2500 BC, and lathes, known to have existed in multiple regions of Europe since at least 1000 to 500 BC.", "can you name any prominent figure involved in this background?", "Leonardo da Vinci", "where was he born?", "Tuscan hill town of Vinci, Republic of Florence.", "what was his profession?", "Painter, engineer", "can you name any such painted work by him?", "Mona Lisa, The Last Supper", "by whom was the second one commissioned?", "Ludovico Sforza - Duke of Milan", "what media was used for this work?", "Oil painting", "did it needed repairs later?", "Yes -  Between 1946 and 1954, undertook a clean-and-stabilise restoration, which Brera director was involved in. Pellicioli reattached paint to the wall using a clear shellac, making it relatively darker and more colorful, and removed some of the overpainting. However, as of 1972, the repainting done in various restorations had made the heads of saints Peter, Andrew, and James differ significantly from the original design.", "what is the cultural significance of this painted piece?", "It has frequently been referenced, reproduced, or parodied in Western culture.", "has it been referred to in any movies as well?", "Yes - Viridiana, MASH, Jesus Christ Superstar"]}
{"conversations": ["where may have the mycenaeans ultimately ended up", "Cyprus and the Levantine coast", "where is the former place located?", "In the Eastern Mediterranean - south of Turkey; west of Syria and Lebanon; north of Egypt, Israel, and Palestine; and southeast of Greece.", "how was the place during the middle ages?", "When the Roman Empire was divided into Eastern and Western parts in 395, Cyprus became part of the East Roman, or Byzantine Empire.", "what cultural influence does it have?", "Greek Cypriots have influences from Greece and Christianity, while Turkish Cypriots have influences from Turkey and Islam.", "what is the aforesaid place which is located at the southern turkey?", "Cyprus is an island country", "where is the aforesaid eastern mediterranean located?", "It is a loose definition of the eastern approximate half, or third, of the Mediterranean Sea.", "which are the places it surrounds?", "All of that sea's coastal zones in Southeast Europe, northern Egypt and far Western Asia.", "how do you define the first one?", "It is a geographical region of Europe, consisting primarily of the coterminous Balkan Peninsula.", "what relation does it have with the cia?", "The \"CIA World Factbook\" lists the countries included in this region.", "what is the geography of this place?", "UNANSWERABLE", "when did the aforesaid empire of 395 era had its transition to empire?", "In the 3rd century BC"]}
{"conversations": ["when was i know why the caged bird sings poem written", "1969", "who was the author?", "Maya Angelou", "is it a part of a book?", "An autobiography describing the early years of the poet.", "what inspired the name of this text?", "The title of the book comes from the third stanza of Dunbar's poem \"Sympathy\".", "when was this poem published?", "UNANSWERABLE", "what's the full name of the author you just mentioned?", "Paul Laurence Dunbar", "where was he born?", "Dayton, Ohio.", "who were his parents?", "Matilda and Joshua.", "what are some of the major themes covered in the previously mentioned autobiography?", "Racism and trauma.", "did the author of the book go through this in her childhood?", "Yes, Maya, the younger version of Angelou and the book's central character, has been called \"a symbolic character for every black girl growing up in America\"."]}
{"conversations": ["what is the scientific name of blacknose shark?", "Carcharhinus acronotus", "where is it commonly found?", "Tropical and subtropical waters of the western Atlantic Ocean", "who described it first?", "Felipe Poey", "can you describe their habitat?", "They inhabits the continental and insular shelves off the eastern coast of the Americas, as far north as North Carolina and as far south as southern Brazil.", "what can you tell me about its conservation status?", "the U.S. National Oceanic and Atmospheric Administration announced that it being overfished, and proposed new conservation measures.", "how are its interactions with human?", "They have never been implicated in an attack on humans.", "what can you tell me about the aforesaid administration?", "It is an American scientific agency.", "what is its function?", "UNANSWERABLE", "what services do they offer?", "Data and Information Service (NESDIS), the National Marine Fisheries Service (NMFS), the National Ocean Service (NOS), to name some.", "when was its formation?", "October 3, 1970", "where is it located?", "UNANSWERABLE", "what is its role in national ocean service?", "It focuses on ensuring that ocean and coastal areas are safe, healthy, and productive.", "can you tell me about its oceanographic division?", "It ensures the quality of all data collected by CO-OPS, and produces/disseminates operational products from this data stream."]}
{"conversations": ["who broke salt law in belgaum in 1930", "UNANSWERABLE", "what was the salt march ?", "The Salt March, also known as the Salt Satyagraha, Dandi March and the Dandi Satyagraha, was an act of nonviolent civil disobedience in colonial India .", "when di it take place ?", "From 12 March 1930 to 6 April 1930.", "why did it take place ?", "As a direct action campaign of tax resistance and nonviolent protest against the British salt monopoly. Another reason for this march was that the Civil Disobedience Movement needed a strong inauguration that would inspire more people to follow Gandhi's example.", "what was its impact ?", "British documents show that the British government was shaken by satyagraha.", "what were its long term effects ?", "Indian, British, and world opinion increasingly began to recognise the legitimacy of claims by Gandhi and the Congress Party for sovereignty and self-rule. The Satyagraha campaign of the 1930s also forced the British to recognise that their control of India depended entirely on the consent of the Indians – Salt Satyagraha was a significant step in the British losing that consent.", "was it ever re enacted ?", "Yes, on its 75th anniversary.", "are there any memorials based on this event ?", "Yes, the National Salt Satyagraha Memorial.", "which type of salt was used ?", "The salt that is used daily.", "what does satyagraha mean ?", "Satyagraha is a synthesis of the Sanskrit words \"Satya\" (truth) and \"Agraha\" (insistence on). For Gandhi, satyagraha went far beyond mere \"passive resistance\" and became strength in practising nonviolent methods."]}
{"conversations": ["the last episode of rick and morty season 3", "The third season of \"Rick and Morty\", an American animated television series", "who were the main characters in it?", "Rick Sanchez and Morty Smith", "which actor played the former?", "Justin Roiland", "did he make any video games?", "Roiland set up a video game studio", "what kind of a character was it?", "He is a cynical mad scientist", "who created it?", "Justin Roiland and Dan Harmon", "where was the latter born?", "Milwaukee, Wisconsin", "has he worked on any other project?", "Yes, \"Heat Vision and Jack\"", "which was the first series he worked with?", "\"Community\"", "when was it released?", "2009", "has he received any award?", "Nominated in two Emmy categories: Outstanding Writing for a Variety Special and Outstanding Original Music and Lyrics", "which one of his works earned him the first one?", "UNANSWERABLE", "is he married?", "Yes, married girlfriend Erin McGathy", "is he alive?", "Yes"]}
{"conversations": ["when did jk rowling wrote the harry potter books", "Her debut novel was written between approximately June 1990 and some time in 1995.", "who is j.k. rowling?", "A British writer and philanthropist.", "what is her full name?", "Joanne Kathleen Rowling", "who were her parents?", "Science technician Anne and Rolls-Royce aircraft engineer Peter James Rowling.", "did she get married?", "Yes -She married Portuguese television journalist Jorge Arantes in 1992 but they separated. Then she married Neil Murray a Scottish doctor in 2001", "how many kids does she have?", "3 kids - Jessica Isabel Rowling Arantes, David Gordon Rowling Murray, Mackenzie Jean Rowling", "where did she study?", "Wyedean School and College, University of Exeter.", "what are her views on religions?", "She identifies herself as a Christian; She believes in God, not magic; she is an adherent of the Church of England; believes in an afterlife, and that her faith plays a part in her books.", "what was her inspiration to write the aforementioned books?", "In 1990, while she was on a train trip from Manchester to London, the idea for a story of a young boy attending a school of wizardry \"came fully formed\" into her mind. Her headmaster at St Michael's, Alfred Dunn, has been suggested as the inspiration for the \"Harry Potter\" headmaster Albus Dumbledore. Her mother's death heavily affected Rowling's writing", "who is the book's publisher?", "Bloomsbury.", "were the books adapted into anything other media form?", "Yes - films, illustrated version, media games, board games, audiobooks", "does she donate to any charity?", "Yes - In 2002, Rowling contributed a foreword to \"Magic\", an anthology of fiction published by Bloomsbury Publishing, helping to raise money for the National Council for One Parent Families.", "what are her views on politics?", "centre-left political views; she donated £1 million to the Labour Party, and publicly endorsed Labour Prime Minister Gordon Brown", "does she have any legal problems?", "Yes - Rowling, her publishers, and Time Warner have taken numerous legal actions to protect their copyright. The worldwide popularity of the \"Harry Potter\" series has led to  locally produced, unauthorised sequels and other derivative works.", "has she written anything else apart from the originally mentioned books?", "Yes - The Ickabog, The Casual Vacancy, The Cuckoo's Calling", "what awards has she received?", "Her book 'Harry Potter and the Philosopher's Stone' won the Nestlé Smarties Book Prize, British Book Award for Children's Book of the Year."]}
{"conversations": ["where do guinea pigs come from in the wild", "They originated in the Andes of South America", "how do they look like?", "Guinea pigs are large for rodents; the common pet breeds weigh between when full grown and measure between in length", "which club is associated with it?", "Cavy clubs dedicated to the showing and breeding of guinea pigs have been established worldwide.", "what reference do they have in literature?", "\"The Fairy Caravan\", a novel by Beatrix Potter, and Michael Bond's Olga da Polga series for children, both feature guinea pigs as the protagonist. Another appearance is in \"The Magician's Nephew\" by C. S. Lewis: in the first of his \"The Chronicles of Narnia\" series, a guinea pig is the first creature to travel to the Wood between the Worlds.", "is there any specific program for their breeding?", "Yes, Peruvian research universities, especially La Molina National Agrarian University, began experimental programs", "you have mentioned three authors above; has the first one done any scientific illustrations?", "Yes, a collection of her fungus paintings at the Perth Museum and Art Gallery in Perth", "and any conservation work?", "She supported he National Trust for Places of Historic Interest or Natural Beauty.", "who founded this trust?", "Octavia Hill, Sir Robert Hunter and Hardwicke Rawnsley", "can you mention some of its art collections?", "\"Self-portrait wearing a white feathered bonnet\"", "which house or garden comes under this trust?", "UNANSWERABLE", "what are some of the collections of the above mentioned museum?", "UNANSWERABLE", "you have mentioned three founders above; who is the first one?", "He was an English social reformer, whose main concern was the welfare of the inhabitants of cities, especially London, in the second half of the nineteenth century", "did he do anything for the poor class?", "Yes, Hill began her work, the model dwelling movement had been in existence for twenty years, royal and select committees had sat to examine the problems of urban well-being, and the first of many tranches of legislation aimed at improving working class housing had been passed.", "how do the aforementioned animal behave?", "Guinea pigs can learn complex paths to food, and can accurately remember a learned path for months. Their strongest problem-solving strategy is motion.", "are they used for any research work?", "Yes, in scientific experimentation"]}
{"conversations": ["what is 'my belarusy'?", "It is the national anthem of Belarus.", "who composed it?", "Sakalowski", "when was it adopted?", "1955", "can you extract any one line from this?", "UNANSWERABLE", "in which continent does that country belong to?", "Europe", "what is the capital of that country?", "Minsk", "what languages are spoken in that country?", "Russian and Belarusian", "can you name a few heritage sites there?", "Mir Castle Complex, the Nesvizh Castle, the Belovezhskaya Pushcha and the Struve Geodetic Arc.", "where exactly is the first place mentioned above located?", "It is located in the town of Mir, in the Kareličy District of the Hrodna voblast", "approximately in which century or which year was it constructed?", "16th century", "can you name a few people who lived in that?", "Dominik Hieronim Radziwiłł, Stefania, Maria, etc.", "who was the first person mentioned above?", "He was Ordynat of Nesvizh and Olyka and owner of Biržai, Dubingiai, Słuck and Kapyl estates."]}
{"conversations": ["where was the movie american graffiti filmed at", "Petaluma, \"Mel's Drive-In\" in San Francisco, Sonoma, Richmond, Novato, and the \"Buchanan Field Airport\" in Concord were some of the locations.", "when was it screened?", "1973", "who were the actors in this film?", "Richard Dreyfuss, Ron Howard, Paul Le Mat, Harrison Ford, Charles Martin Smith and Cindy Williams, to name a few.", "when was the last actor mentioned born?", "August 22nd, 1947.", "where is the actor from?", "\"Van Nuys\", a district of Los Angeles, California.", "whom was this person married to?", "Bill Hudson", "where is the first actor mentioned earlier from?", "Brooklyn, New York", "which books did he write?", "He co-authored with science-fiction writer Harry Turtledove for the novel \"The Two Georges”.", "when was this novel published?", "1995", "which genre is this novel?", "It is an \"alternate history\" and \"detective thriller\".", "which awards did the aforementioned movie win?", "It won \"Best Motion Picture (Musical or Comedy)\" at the 31st Golden Globe Awards.", "who directed this film?", "George Lucas", "which movies is this director best known for?", "\"Star Wars\" and \"Indiana Jones\" are two of them."]}
{"conversations": ["what year is the wire season 1 set in", "UNANSWERABLE", "what is the wire?", "It is an American crime drama television series", "who created it?", "David Simon", "where was it filmed?", "Set and produced in Baltimore, Maryland", "who were the characters?", "Detective Bunk Moreland, Detective Jimmy McNulty, Cedric Daniels to name a few", "who plays the first character's role?", "Wendell Pierce", "has this actor been a part of any other show?", "Yes, \"Treme\"", "which network was this show aired on?", "HBO", "when was it first aired?", "\"Treme\" premiered on April 11, 2010", "has pierce been a part of any charity work?", "Pierce started the non-profit, Pontchartrain Park Community Development Corp.", "what is the purpose of this corp.?", "To build new affordable solar and geothermal homes in the area for families displaced by Hurricane Katrina.", "where did this hurricane originate from?", "Southeastern Bahamas", "what was its impact?", "According to the National Hurricane Center, 1,836 fatalities can be attributed to the storm: 1 in Kentucky, 2 each in Alabama, Georgia, and Ohio, 14 in Florida, 238 in Mississippi, and 1,577 in Louisiana.", "what was its effect on environment?", "It caused substantial beach erosion, in some cases completely devastating coastal areas.", "what role did noaa play during this disaster?", "The National Hurricane Center issued many tropical cyclone warnings and watches throughout the duration of Katrina.", "is pierce a businessman too?", "Yes, Pierce considers himself a \"true capitalist\" and a \"classic entrepreneur.\""]}
{"conversations": ["when did the first silesian war take place?", "1740", "where?", "Silesia, Moravia and Bohemia", "between whom?", "Prussia and Austria", "what was its prime cause?", "Brandenburg–Prussia's ruling House of Hohenzollern held dynastic claims to various duchies within the Habsburg province of Silesia", "when was this ruling house established?", "The family arose during the 11th century", "where did they live?", "The family arose in the area around the town of Hechingen in Swabia", "what is the geographical location of this last place?", "Southwestern Germany", "which language did they speak?", "Swabian, Swabian German", "how is this latter one classified?", "Swabian is categorized as an Alemannic dialect, which in turn is one of the two types of Upper German dialects", "can you mention one of its characteristic?", "The voiced plosives, the post-alveolar fricative, and the frequent use of diminutives based on \"l\" suffixes gives the dialect a very \"soft\" or \"mild\" feel", "how is it related to mass media?", "The Baden-Württemberg Chamber of Commerce launched an advertising campaign with the slogan \"We can [do] everything. Except [speak] Standard German\" to boost Swabian pride for their dialect and industrial achievements."]}
{"conversations": ["who was president when the hoover dam was built", "Franklin D. Roosevelt.", "where is this dam located?", "Black Canyon of the Colorado River, on the border between the U.S. states of Nevada and Arizona.", "did anyone try to find resources on this dam?", "An initial attempt at diverting the Colorado river for irrigation purposes occurred in the late 1890s, when land speculator William Beatty built the Alamo Canal just north of the Mexican border; the canal dipped into Mexico before running to a desolate area Beatty named the Imperial Valley.", "how the climate like in this valley?", "It often has summer temperatures well over , but from late October until mid-April the temperature is relatively mild and can sometimes even reach low temperatures not expected in a desert.", "is there any fort situated here?", "Yes, Fort Yuma", "and who was it built by?", "UNANSWERABLE", "who is the design of the dam attributed to?", "John L. Savage.", "where is he from?", "Cooksville, Wisconsin", "was a part of any association?", "After leaving the U.S. Bureau of Reclamation Idaho Division, Savage began an eight-year association with A. J. Wiley, an engineer in Boise, Idaho.", "can you name some other works of his apart from the dam?", "Salmon River Dam, the Swan Falls Power Plant on the Snake River, the Barber Dam on the Boise River, the Twin Falls North Side Canal System, and the American Falls Power Plant.", "did anyone die during the construction of the dam?", "There were 112 deaths reported as associated with the construction of the dam."]}
{"conversations": ["who is the prophet who was thrown into the sea and swallowed by the whale", "Jonah", "which sea was he swallowed in ?", "UNANSWERABLE", "who is he ?", "A prophet in the Hebrew Bible of the northern kingdom of Israel in about the 8th century BCE.", "where was he born ?", "UNANSWERABLE", "the book you mentioned above what is it ?", "The canonical collection of Hebrew scriptures, including the Torah.", "what is the second thing you have mentioned ?", "It can most specifically mean the first five books of the Hebrew Bible.", "in which language was it written in ?", "It can even mean the totality of Jewish teaching, culture, and practice, whether derived from biblical texts or later rabbinic writings.", "was it translated into jewish ?", ". A number of Jewish English Bible translations have been published, for example by Artscroll publications", "this language is spoken in which country ?", "UNANSWERABLE", "what are its alternative names ?", "'Pentateuch'"]}
{"conversations": ["what does the red on the german flag represent", "Red and white were also colours of the Hanseatic League (13th–17th century). Hanseatic trading ships were identifiable by their red-white pennants, and most Hanseatic cities adopted red and white as their city colours (see Hanseatic flags)", "when was it accepted as the national flag?", "1848", "what are napoleonic wars?", "The Napoleonic Wars (1803–1815) were a series of major conflicts pitting the French Empire and its allies, led by Napoleon I.", "what is the league mentioned above?", "It was a commercial and defensive confederation of merchant guilds and market towns in Northwestern and Central Europe.", "when was it founded?", "late 1100s.", "what can you tell me about the place you mentioned just above?", "The concept of Central Europe is based on a common historical, social and cultural identity and is a patchwork of territories that are traditionally Catholic and Protestant.", "how was it before ww i?", "UNANSWERABLE", "what alllanguages are spoken there?", "UNANSWERABLE", "what are the various agricultural produces found there?", "hops, rye and barley, rapeseed, among others.", "can you name any educational institutes ?", "The Central European University"]}
{"conversations": ["what is hydrus?", "Small constellation in the deep southern sky.", "what are its characteristics?", "Irregular in shape and its tail has been shortened to make space for this last constellation he had drawn up.", "name a few stars in the constellation?", "Beta Hydri, Alpha Hydri, etc.", "where did the second star get its name from?", "Chinese system", "who decribed the constellation for the first time?", "Goes back to prehistory.", "what does deep sky objects mean in the context of the constellation?", "UNANSWERABLE", "name a few mordern constellations?", "UNANSWERABLE", "where did the terminology for the term constellation get?", "Late Latin term", "what does late latin mean?", "Scholarly name for the written Latin of late antiquity.", "is there any literature in the late antiquity?", "Known for the declining use of classical Greek and Latin, and the rise of literary cultures in Syriac, Armenian, etc and marks a shift in literary style."]}
{"conversations": ["when was the last time mauna loa volcano erupted", "March 24 to April 15, 1984.", "what is the main entity?", "It is one of five volcanoes that form the Island of Hawaii in the U.S. state of Hawaiʻi in the Pacific Ocean.", "what is its weather like?", "It has a tropical climate with warm temperatures at lower elevations and cool to cold temperatures higher up year-round.", "who monitors this volcano?", "The Hawaiian Volcano Observatory, a branch of the United States Geological Survey.", "who founded it ?", "Thomas A. Jaggar.", "where is it located?", "A temporary offices located in Hilo on the Island of Hawaii.", "mention few volcanoes it monitors?", "Kīlauea, Mauna Loa, Hualālai, and Haleakalā.", "name few dangers of the second?", "It is a sudden, massive collapse of the volcano's flanks,  large earthquakes could trigger rapid flank collapses along these lines, creating massive landslides and possibly triggering equally large tsunamis.", "any recent updates seen in the third?", "The 2006 Kiholo Bay earthquake.", "where did this natural calamity occur?", "The epicenter was just to the north in Kiholo Bay near Māhukona.", "mention few destructions it caused?", "Significant structural damages at least 61 buildings were destroyed and red-tagged by officials, roads and bridges collapsed or had deep cracks.", "any electrical failure associated with it?", "Power plants automatically shut off power to prevent damage, and generators tripped on Oahu, causing overloads in the electrical grid.", "any observatory body associated ?", "Yes, a number of the telescopes at the Mauna Kea Observatories sustained minor damage, primarily Kecks 1 and 2 at the W. M. Keck Observatory, and the Canada–France–Hawaii Telescope.", "where is the last situated?", "It is located near the summit of Mauna Kea mountain on Hawaii's Big Island.", "how is the weather of the mountain just mentioned?", "It has an alpine climate, the average monthly temperature remains above freezing throughout the year.", "mention few leisure places ?", "Recreation parks, hunting, multiple hiking trails, Star Gazing."]}
{"conversations": ["what year did harry met sally come out", "1989", "who directed this film?", "Rob Reiner", "who are the lead actors in the film?", "Billy Crystal and Meg Ryan", "who composed the music for it?", "Harry Connick Jr. and Marc Shaiman", "who is the fist actor?", "He  is an American actor, comedian, singer, writer, producer, director, and television host.", "what are some of the awards conferred to him?", "Six Primetime Emmy Awards, a Tony Award, and a Mark Twain Prize", "any other films in which he acted?", "Rabbit Test, The Princess Bride, Throw Momma from the Train etc", "what is the last film about from the above mentioned list?", "It is about a novelist Larry Donner who struggles with writer's block due to his resentment towards his ex-wife Margaret, and Owen Lift who lives with his overbearing, hard and paranoid mother fanatsizes about killing her but can't summon the courage to.", "who were the other co-actors of him in the film?", "Kate Mulgrew, Danny DeVito, Anne Ramsey etc", "what critical responses did the film receive?", "The film received mixed reviews.", "what is the second award recognized as?", "It recognizes excellence in live Broadway theatre.", "when was this award founded?", "1947", "and by whom?", "A committee of the American Theatre Wing headed by Brock Pemberton.", "which are some criticisms that the award faced?", "Some critics have suggested that the Tony Awards are primarily a promotional vehicle for a small number of large production companies and theatre owners in New York City and when they eliminated the sound design awards in 2014.", "how did this award get its name?", "The award is named after Antoinette Perry, nicknamed Tony."]}
{"conversations": ["who was the first president of india to be elected unopposed", "Neelam Sanjiva Reddy", "was he involved in freedom struggle?", "Yes, he joined the Indian struggle for independence.", "which other political posts did he have?", "President of the Indian National Congress, Union Minister of Steel and Mines, Union Minister of Transport, Civil Aviation, Shipping and Tourism, speaker of the Lok Sabha, etc.", "which political party was he associated with?", "Indian National Congress Party in the Indian independence movement and Janata Party as a candidate for Parliament.", "when was the second political party established?", "23 January 1977", "what was its role during emergency?", "A state of emergency enabled the central government to issue executive decrees without requiring the consent of Parliament.", "what was the party's major economic policy?", "t launched the Sixth Five-Year Plan, aiming to boost agricultural production and rural industries.", "who was instrumental in founding the party?", "Jayaprakash Narayan, Jivatram Kripalani, George Fernandes, Morarji Desai, etc.", "what was the role of the third leader in the railway strike?", "It was organised by him and was President of the All India Railwaymen's Federation.", "when did the fourth founder die?", "10 April 1995"]}
{"conversations": ["what is nach dir, herr, verlanget mich, bwv 150?", "An extant cantata or a piece of music .", "where is this music from?", "The original piece is lost and this survives in a copy made by C F Penzel.", "who composed this score?", "Bach.", "what is the history behind this score?", "On the basis of the text, it has been suggested that the work was written for a penitential service.", "what is the origin of this above mentioned service?", "It was developed by the  Irish abbots Cummean ,Columbanus and Archbishop of Canterbury, Theodore of Tarsus.", "where was the last mentioned person born?", "Tarsus in Cilicia.", "what was his early life like?", "He most likely studied at Antioch, and later was forced to leave his birthplace due to Muslim rule. He studied in Constantinopole and then travelled to Rome. He was consecrated archbishop of Canterbury in Rome on 688. .", "what was his duty as archbishop of this place?", "Conducted a survey of English Church, appointed various bishops, and initiated various reforms. He also intervened in the battle against the Mericans and restored peace between the parties involved.", "when did his veneration take place?", "His saint's day is 19 September in the Catholic Church, Church of England, Eastern Orthodox Church, and Episcopal Church (USA).", "what are the sacraments of the first mentioned church?", "Baptism, Confirmation, the Eucharist, Penance, Anointing of the Sick, Holy Orders and Holy Matrimony.", "what is the last mentioned sacrament?", "It is a phrase used by Christians to describe marriage."]}
{"conversations": ["how long does a red fox live in the wild", "In the wild they typically do not survive past 5 years of age.", "what is red fox?", "It is the largest of the true foxes and one of the most widely distributed members of the order Carnivora.", "where did it originate?", "The species is Eurasian in origin.", "how did it evolve?", "It is considered a more specialised form of \"Vulpes\" than the Afghan, corsac and Bengal foxes in the direction of size and adaptation to carnivory.", "what is the appearance of this third type of fox?", "It is a relatively small fox with an elongated muzzle, long, pointed ears, and a bushy tail about 50 to 60% of the length of the head and body.", "where is it found?", "he Bengal fox is distributed throughout much of the Indian subcontinent with the exception of the wet forests and the extreme arid zone.", "what does this fox eat?", "Rodents, reptiles, crabs, termites, insects, small birds, and fruits.", "what are its dangers?", "Lack of habitat protection", "how does it communicate?", "A chattering cry is the most common call. They also growl, whine, whimper, and bark.", "what is the second kind of fox?", "UNANSWERABLE"]}
{"conversations": ["who won the bharat ratna award in 2018", "UNANSWERABLE", "when was this award initially given?", "2 January 1954", "what is the eligibility to receive this award?", "One must be of exceptional service/performance of the highest order irrespective of race, occupation,position or sex", "who presents the award?", "President", "was it a part of any controversy?", "Yes. Jawaharlal Nehru has been targeted of awarding Bharat Ratna to himself while serving as Prime Minister of India in 1955", "can you name any award winners?", "Sachin Tendulkar ,Mother Teresa, Dhono Keshav Karve", "what can you tell me about the former award holder?", "He is a former Indian international cricketer, also was the captain of the Indian national team.", "when did he begin his career?", "15 November 1989", "what can you tell me about his playing style?", "He is cross-dominant, bats, bowls and throws with his right hand, but writes with his left hand", "when did become the captain?", "1996", "can you mention any of his achievements?", "Champions League Twenty20 ,  Asia Cup 2012"]}
{"conversations": ["why is michael myers the way he is", "UNANSWERABLE", "who is this aforesaid person?", "He is a fictional character from the \"Halloween\" series of slasher films.", "how does he appear in this film?", "He first appears in 1978 in John Carpenter's \"Halloween\" as a young boy who murders his elder sister, Judith Myers.", "where is this above mentioned director from?", "From New York", "what are some student films that he made?", "Captain Voyeur was one", "what is known about this one?", "he 8-minute film is about a bored computer worker who becomes fixated on a woman at work and follows her back to her home", "who plays the main character here?", "UNANSWERABLE", "where did the aforementioned director study?", "USC Cinema", "what was his private life like?", "He met his future wife, actress Adrienne Barbeau, on the set of his 1978 television film \"Someone's Watching Me!\". Carpenter was married to Barbeau from January 1, 1979, to 1984. During their marriage, Barbeau starred in \"The Fog\", and also appeared in \"Escape from New York\". The couple had one son, John Howard Jr. (born May 7, 1984), nicknamed \"Cody\" to avoid confusion with his father.", "where was this actress from?", "Sacramento, California,", "how did she start her acting career?", "She ame to prominence in the 1970s as Broadway's original Rizzo in the musical \"Grease\", and as Carol Traynor, the divorced daughter of Maude Findlay (played by Beatrice Arthur) on the sitcom \"Maude\""]}
{"conversations": ["what part of canada are the property brothers from", "Vancouver, British Columbia", "what is the series about?", "Drew is a real estate expert who scouts neglected houses and negotiates their purchases. His brother, Jonathan, is a licensed contractor who then renovates the houses. Together, the Property Brothers help families find, buy, and transform fixer-uppers into dream homes on a strict timeline and budget.", "when was this show released?", "UNANSWERABLE", "who are its producers?", "Scott Brothers Entertainment", "how was this show received by the people?", "It was top rated during its debut and attracted more than 10 million US viewers by the fifth season.", "how many episodes does it have?", "100 Episodes", "of the two brothers, where was the former born?", "Vancouver, British Columbia", "does he have any other siblings?", "Yes, Jonathan Scott", "did he have any other career apart from acting?", "Yes, he is active in various philanthropic projects.", "when did he began his career on tv?", "2008", "who are his parents?", "Jim and Joanne Scott", "has he won any accolades?", "Yes,  Leo Award, nominated for a Rose d'Or award etc"]}
{"conversations": ["how long does it take for painted turtles to hatch", "Hatched turtles grow until sexual maturity: 2–9 years for males, 6–16 for females.", "where are they most commonly found?", "North America", "and what is their preferred domain of habitation?", "It lives in slow-moving fresh waters, from southern Canada to northern Mexico, and from the Atlantic to the Pacific", "who labelled this species for the first time?", "UNANSWERABLE", "what do they mostly feed on?", "It also consumes plants and skims the surface of the water with its mouth open to catch small particles of food.", "are they preyed on by other animals?", "Garter snakes, crows, chipmunks, thirteen-lined ground and gray squirrels, skunks, groundhogs, raccoons, badgers, gray and red fox, and humans.", "where did this particular species of fox you just mentioned originate?", "The species is Eurasian in origin, and may have evolved from either \"Vulpes alopecoides\" or the related Chinese \"V. chikushanensis\", both of which lived during the Middle Villafranchian", "when did they migrate to north america?", "Red foxes colonised the North American continent in two waves: during or before the Illinoian glaciation, and during the Wisconsinan glaciation.", "do they appear in any myths or legends?", "Yes, In Greek mythology, the Teumessian fox or Cadmean vixen, was a gigantic fox that was destined never to be caught. The fox was one of the children of Echidna. In Celtic mythology, the red fox is a symbolic animal", "can you name some of historical records from which the myths of the last culture you mentioned has been gleaned?", "As a result of the scarcity of surviving materials bearing written Gaulish, it is surmised that the most of the Celtic writings were destroyed by the Romans, although a written form of Gaulish using Greek, Latin and North Italic alphabets was used", "who were the people using the language you are talking about?", "Celtic tribes, encompassing present day France, Luxembourg, Belgium, most of Switzerland, and parts of Northern Italy, the Netherlands, and Germany, particularly the west bank of the Rhin"]}
{"conversations": ["where is rubidium found on the periodic table", "It is the 37th element.", "what letters are used to represent it?", "Rb", "who discovered it?", "Robert Bunsen and Gustav Kirchhoff", "who is the former?", "German chemist", "which university did he attend?", "UNANSWERABLE", "what scientific law did the latter introduce?", "Kirchhoff's circuit laws, laws of spectroscopy and law of thermochemistry.", "can you briefly describe the first one?", "His  first law is that the algebraic sum of currents in a network of conductors meeting at a point (or node) is zero. The second law is that in a closed circuit, the directed sums of the voltages in a closed system is zero.", "what is the role of any scientist in the same field as the former?", "They study the composition of matter and its properties, carefully describe the properties they study in terms of quantities, with detail on the level of molecules and their component atoms, etc.", "name some pioneers in this field.", "UNANSWERABLE", "what are some recognitions given to scientists in this field?", "Nobel Prize in Chemistry", "when was this prize instituted?", "1901", "where does it get its name from?", "From Alfred Nobel"]}
{"conversations": ["who was the leader of the soviet union when sputnik was launched", "Nikita Khrushchev", "when was this satellite launched?", "4 October 1957", "which place was it launched from?", "Site No.1/5, at the 5th Tyuratam range, in Kazakh SSR", "which was the organization behind this launch?", "UNANSWERABLE", "where was the leader mentioned above born?", "Kalinovka village in what is now Russia's Kursk Oblast", "was he against any religion?", "Yes. He was anti-religious", "in what way did he push this belief forward?", "He banned all services held outside of church walls, renewed enforcement of the 1929 legislation banning pilgrimages, and recorded the personal identities of all adults requesting church baptisms, weddings, or funerals", "of the three practices finally mentioned, elaborate on the first one.", "It is a Christian rite of admission and adoption, almost invariably with the use of water, into Christianity", "where does the name of this practice come from?", "Through Latin from the neuter Greek concept noun \"baptisma\", which is a neologism in the New Testament derived from the masculine Greek noun \"baptismos\"", "which place did this practice start from?", "UNANSWERABLE", "is this practice applicable to objects?", "The word \"baptism\" is sometimes used to describe the inauguration of certain objects for use"]}
{"conversations": ["who was little tich?", "Harry Relph, professionally known as Little Tich, was a English music hall comedian and dancer best known for acrobatic dance.", "where all has he performed?", "Theatre Royal, Barnard's Music Hall, English music hall", "what did he perform in the first theatre?", "The first of the Drury Lane pantomimes in which Little Tich appeared was \"Humpty Dumpty\"", "when?", "1891", "is it a character?", "It is a character in an English nursery rhyme, portrayed as an anthropomorphic egg.", "who created it?", "Its origins are obscure, and several theories have been advanced to suggest original meanings.", "has this character ever appeared in a film?", "Yes, in All the King's Men", "what was the storyline of the movie?", "The plot focuses on the rise and fall of the ambitious and ruthless politician, Willie Stark  in the American South.", "who did the title role?", "UNANSWERABLE", "who was casted for the role of the politician?", "Broderick Crawford"]}
{"conversations": ["who played jason voorhees in friday the 13th", "Ari Lehman", "who is this character?", "He is the main character from the \"Friday the 13th\" movie series.", "does he hide his face?", "Yes he wears a hockey goalie mask in \"Friday the 13th Part III\".", "how is this date significant in italy?", "Due to Americanization, young people consider Friday the 13th unlucky, even though 13 is generally considered a lucky number.", "is it anyway linked to mishaps on roads?", "A study in the \"British Medical Journal\" stated that \"'the risk of hospital admission as a result of a transport accident \"may\" be increased by as much as 52 percent' on the 13th\". Subsequent studies have disproved any correlation between Friday the 13th and the rate of accidents.", "what other characters were present in the movie mentioned earlier?", "Chris Higgins, Shelly", "what is the genre of this movie?", "Slasher film", "what sort of movies are these?", "These are a subgenre of horror films involving a killer murdering a group of people, usually by use of bladed tools", "have they inspired any other media?", "Yes - TV shows,video games, books, and comics.", "is the person who played the villain a musician as well?", "Yes, in 2004 he formed his punk metal band whose name, First Jason, is based upon his role as Jason Voorhees.", "what other movies did he act in?", "\"Manny's Orphans\""]}
{"conversations": ["who had hits rehab and back to black", "Amy Jade Winehouse.", "what is the latter?", "It is the second and final studio album by English singer and songwriter Amy Winehouse, released on 27 October 2006 by Island Records.", "which places did she go on tour after this album was released?", "\"Little Noise Sessions Charity Concert\" at the \"Union Chapel in Islington, London” and \"Jools Holland's Annual Hootenanny” are two of them.", "did she suffer from any addiction?", "Yes, drinking and drugs.", "was this connected to her death?", "Yes", "in what way?", "The coroner’s explained that her blood alcohol content was 416 per 100 (0.416%) at the time of her death which is more than five times the legal drink-drive limit. The unintended consequences of such potentially fatal levels was her sudden death.", "where is the first location of the concert situated?", "Islington, England.", "where does the former mentioned here get its name from?", "The name originates from the word “Isledon\".", "any famous markets in this place?", "Yes, there were 56 ale-house keepers in Upper Street that offer pleasure and tea gardens where activities such as archery, skittle alleys and bowling are conducted.", "what is the famous chapel in this place?", "Union Chapel", "when was it built?", "In the late19th century.", "who built it?", "UNANSWERABLE", "does it have any projects for homeless people?", "Yes, \"The Margins Project\"."]}
{"conversations": ["who is 30 seconds to mars touring with", "Muse and PVRIS", "who are the members of the band?", "Jared Leto and Shannon Leto", "which was their first ever album?", "\"30 Seconds to Mars\"", "has the first band member also been in any movies?", "Yes, \"How to Make an American Quilt\" ,  \"Fight Club\" , \"The Thin Red Line\",  \"Urban Legend\"  are some of the movies", "what is his political stance?", "He supported Senator Barack Obama of Illinois during presidential election", "is the singer/actor also a businessman?", "Yes, he launched the social media management and digital marketing company and also launched the online platform", "what is the company called?", "The Hive", "what is the story of this actor's second movie mentioned above?", "The unnamed Narrator is an automobile recall specialist who is unfulfilled by his job and possessions and suffers from chronic insomnia. He finds catharsis by attending support groups and posing as a sufferer of several diseases, curing his insomni", "who were the other actors in this movie?", "Brad Pitt, Edward Norton, Helena Bonham Carter , etc.", "for which scenes or characters were special effects used?", "\"The Game\" scenes", "in what way has it impacted popular culture?", "The film was perceived as the forerunner of a new mood in American political life", "who is the actress mentioned above in a relationship with?", "Burton", "has she been awarded for any of her roles?", "Yes, she has been the recipient of a  BAFTA Award, a Critics' Choice Movie Award, an International Emmy Award and two Screen Actors Guild Awards, eight Golden Globe Awards and four Primetime Emmy Awards and many more"]}
{"conversations": ["what is the symbol of flag of ecuador?", "It consists of horizontal bands of yellow (double width), blue and red.", "who designed it?", "UNANSWERABLE", "does it resemble any other flag?", "Yes, Colombia and Venezuela", "which pledge is related to it?", "Juramento a la Bandera", "does the above latter country face any kind of shortage?", "Yes, products like milk, various meats, basic necessities etc.", "is any rights suspended over there?", "Yes, constitutional rights.", "why?", "The approval of the extension of States of emergency corresponds to the National Assembly.", "which government is in power here during 1999 and onwards?", "The Bolivarian government", "can you name any person from this government form?", "Hugo Chávez", "how is he connected to it?", "He was a Venezuelan president and founded the Fifth Republic Movement.", "when was the foundation found?", "July 1997", "what was the movement about?", "It was a democratic socialist political party in Venezuela.", "can you mention one of its aims?", "They were committed to the Bolivarian Revolution and claimed to be the political voice of the country's poor.", "was it dissolved?", "No, but there were plans to dissolve the party.", "when did the mentioned revolution start?", "UNANSWERABLE"]}
{"conversations": ["the movement of food in food pipe is called", "Peristaltic contractions.", "enumerate any notable structural mention?", "Taste buds, mediastinum, diaphragm, trachea, etc.", "what does the first thing mentioned here compose of?", "Taste receptor cells.", "does it have any functionality?", "Yes, they are involved in detecting the five elements of taste perception: salty, sour, bitter, sweet and umami.", "where does the last word derive it's name from?", "Japanese.", "when was it discovered?", "1908.", "what is it define as?", "As a savory and is characteristic of broths and cooked meats.", "enumerate any particular properties mentioned?", "It has a mild but lasting aftertaste associated with salivation and a sensation of furriness on the tongue, stimulating the throat, the roof and the back of the mouth.", "is there a mention of food stuff having high proportions of the said thing?", "Yes, mushrooms, smoked or fermented fish, shellfish, etc.", "what is the definition of the last food item?", "It is an exoskeleton-bearing aquatic invertebrates used as food.", "are there any benefits by it's consumption?", "It is an important source of protein.", "what is the relevance of this kind of food in the country mentioned earlier?", "In the Japanese cuisine, chefs often use shellfish and their roe in different dishes.", "what is the other thing other than shellfish mentioned in the above answer?", "Roe or hard roe is the fully ripe internal egg masses in the ovaries, or the released external egg masses of fish and certain marine animals, such as shrimp, scallop, sea urchins, and squid."]}
{"conversations": ["how many lengths did secretariat win the belmont stakes", "31 lengths.", "who was \"secretariat\"?", "An American Thoroughbred racehorse.", "who owned this horse?", "Penny Chenery.", "how many years did it's career is racing last?", "From 1972 to 1973.", "which was the last race the horse competed in?", "Canadian International Stakes .", "where is this competition held?", "Woodbine Racetrack in Toronto, Ontario.", "who built this racetrack?", "The Ontario Jockey Club under E.P. Taylor.", "how did the above mentioned horse die?", "He was euthanized.", "why was he euthanized?", "Secretariat became afflicted with laminitis—a painful and debilitating hoof condition. When his condition failed to improve after a month of treatment, he was euthanized.", "what is the cause of this illness?", "A severe inflammatory event is thought to damage the basal epithelial cells, resulting in dysfunction of the hemidesmosomes and subsequent reduction in adherence between the epithelial cells and the basement membrane. Normal forces placed on the hoof are then strong enough to tear the remaining laminae, resulting in a failure of the interdigitation of the epidermal and dermal laminae between the hoof wall and the coffin bone."]}
{"conversations": ["hypothalamic amenorrhea will result in the increased secretion of thyroid stimulating hormone (tsh)", "UNANSWERABLE", "what is hypopituitarism?", "A decreased (\"hypo\") secretion of one or more of the eight hormones normally produced by the pituitary gland at the base of the brain.", "what are the indications of it?", "Insufficiency of follicle-stimulating hormone (FSH) and/or luteinizing hormone (LH) leading to sex hormone abnormalities. Growth hormone deficiency is more common in people with an underlying tumor than those with other causes.", "how this can be treated?", "Removing the underlying cause, treating the hormone deficiencies, and addressing any other repercussions that arise from the hormone deficiencies.", "you mentioned a gland above, where is it located in human body?", "The bottom of the hypothalamus at the base of the brain.", "what is the size of this gland?", "The size of a pea", "what is the functions of anterior lobe of this gland?", "Synthesizes and secretes hormones; regulates several physiological processes including stress, growth, reproduction, and lactation.", "which hormones are synthesized by this lobe?", "Growth hormone, follicle-stimulating hormone (FSH) and luteinizing hormone (LH), thyroid stimulating hormone (TSH) etc", "how is the posterior lobe different from the anterior lobe?", "It store and secretes (but does not synthesize) the important endocrine hormones.", "in which other animals this gland can be found?", "All vertebrates such as mammals, amphibians, reptiles, and birds,", "what is the clinical significance of this gland?", "There are diseases involving the pituitary gland. The functions of the pituitary gland can be adversely affected by an over- or under-production of associated hormones. The Pituitary gland growth during adolescence can be altered by early life stress such as childhood maltreatment or maternal dysphoric behavior.", "what is the third mentioned vertebrates from the above list?", "They are tetrapod animals in the class Reptilia, comprising today's turtles, crocodilians, snakes, amphisbaenians, lizards, tuatara, and their extinct relatives", "do they play any roles in cultures and religions?", "Yes - In Egyptian history, the Nile cobra was worshipped as one of the gods and was also used for sinister purposes; In Hinduism, snakes are worshipped as gods; The turtle has a symbol of steadfastness and tranquility in religion, mythology, and folklore from around the world.", "what  type of reproduction is common in this class?", "Reptiles generally reproduce sexually; Most reptiles lay amniotic eggs", "are they commercially farmed by humans?", "Yes - Crocodiles are farmed for the hides and meat; Snakes are also farmed for the purpose of research and the collection of venom for the creation of antivenom."]}
{"conversations": ["which cities in croatia are famous for their protective walls and forts", "Dubrovnik", "in which country is this state located in ?", "UNANSWERABLE", "which country is this city located in ?", "Croatia", "how is the weather in this country ?", "Moderately warm and rainy continental climate", "what is the capital of the country ?", "Zagreb", "does the country play any sports ?", "Yes. There are more than 400,000 active sportspeople there", "any major sports they are famous for ?", "Football", "name any players of the team ?", "UNANSWERABLE", "which religions are followed in this country ?", "Christianity and Islam", "are there any specific fasting requirements for the latter religion ?", "Yes. Fasting from food and drink, among other things, must be performed from dawn to dusk during the month of Ramadan"]}
{"conversations": ["who told the magi to follow the star", "Matthew's account suggests that the Magi knew from the star that the \"king of the Jews\" had been born before they arrived in Jerusalem", "who is this magi?", "The Magi (often translated as \"wise men\"), but is more accurately astrologers.", "who is this star?", "Other writers highly suggest that the star was a comet. Halley's Comet was visible in 12 BC and another object, possibly a comet or nova, was seen by Chinese and Korean stargazers in about 5 BC", "what is this aforesaid comet?", "Halley's Comet or Comet Halley, officially designated 1P/Halley, is a short-period comet visible from Earth every 75–76 years.", "why did this aforesaid star was born?", "According to the Gospel of Matthew, the star was born to lead the Magi to the birth place of Jesus.", "which prophecy needed to be fulfilled?", "The Star of Bethlehem is traditionally linked to the Star Prophecy in the Book of Numbers: \"I see him, but not now; I behold him, but not near; A Star shall come out of Jacob; A Scepter shall rise out of Israel, And batter the brow of Moab, And destroy all the sons of tumult.\"", "what is the structure of this aforesaid book of numbers?", "Most commentators divide Numbers into three sections based on locale (Mount Sinai, Kadesh-Barnea and the plains of Moab), linked by two travel sections; an alternative is to see it as structured around the two generations of those condemned to die in the wilderness and the new generation who will enter Canaan, making a theological distinction between the disobedience of the first generation and the obedience of the second.", "did anyone translate it?", "UNANSWERABLE", "where is this mount located?", "In the Sinai Peninsula of Egypt", "what is its religious significance?", "The summit has a mosque that is still used by Muslims, and a Greek Orthodox chapel, constructed in 1934 on the ruins of a 16th-century church, that is not open to the public", "what did this aforementioned comet do in 1910?", "The 1910 approach, which came into naked-eye view around 10 April and came to perihelion on 20 April, was notable for several reasons: it was the first approach of which photographs exist, and the first for which spectroscopic data were obtained."]}
{"conversations": ["selena if i could fall in love with you", "UNANSWERABLE", "is 'i could fall in love' a song?", "Yes, It is a song recorded by American Tejano singer Selena.", "who is the composer?", "Sandy Masuo of the \"St. Louis Post-Dispatch\" wrote the song.", "when was it released?", "26 June 1995.", "how was it received?", "It received a generally positive response from music critics.", "who are the critics?", "Ed Morales of \"Vibe\", an editor from the \"Star-News\" and Larry Flick of \"Billboard\".", "how did it perform on the charts?", "It debuted at number four on the Hot Latin Tracks chart on 1 July 1995 and peaked at number two the following week.", "which other songs has the singer sang?", "Entre a Mi Mundo, Como la Flor, Amor Prohibido.", "what's her full name?", "Selena Quintanilla-Pérez", "was a music video made on the original song?", "Yes.", "who was the director?", "Hector Galan", "which awards did the song win?", "Tejano Crossover Songs of the Year", "what cultural impact did it have?", "The song was played 25 times its first day of availability on US radios on the Harlingen, Texas radio station KBTQ", "were there covers?", "Yes."]}
{"conversations": ["who plays the voice of john smith in pocahontas", "Mel Gibson", "when was the film released?", "June 16, 1995", "what was it's genre?", "History, romantic, drama, music are some them", "who was the director?", "Mike Gabriel and Eric Goldberg", "was it a commercially successful one?", "Yes, its grossed collection was  $346.1 million worldwide.", "did it appear in any television channel?", "Yes, it appear on  Disney Channel", "has it produced any video games?", "Yes, \"Disney Channel All Star Party\"", "what was the game about?", "It is a party game based on several Disney Channel franchises.", "does it have any channel for kids?", "Yes, Disney Junior", "when was it established?", "March 23, 2012"]}
{"conversations": ["what is the getty center in los angeles", "A campus of the Getty Museum and other programs of the Getty Trust.", "who designed this campus?", "Richard Meier", "what architectural pieces are found in this campus center?", "The primary grid structure is a square; most wall and floor elements are squares or some derivative thereof.", "do they have parking space for people visiting this place?", "Yes", "besides the museum, what other building structures are located on this campus?", "Getty Research Institute (GRI), the Getty Conservation Institute, the Getty Foundation, and the J. Paul Getty Trust.", "how is the campus equipped if there is fire?", "Silicone fluid is used as a coolant and fire-resistant poverty weed was added to the slopes around the Center.", "is there a garden in the premises?", "Yes, Central Garden", "besides the flora, what structural pieces will you find in the above?", "A fountain flows toward the garden and appears to fall into a grotto on the north garden wall.", "what will you find in the research institute which you mentioned earlier?", "A research library, publishes books, and produces electronic databases (Getty Publications).", "what are some of the exhibitions they host?", "Julius Shulman, Modernity and the Metropolis", "what are some of their publications?", "\"Series Imprints\" books in the categories of \"Issues and Debates\", \"Texts & Documents\", \"Introduction To\", and \"ReSources\".", "you had mentioned a conservation institute earlier, what are some of the works of this institute?", "Art conservation and architectural conservation.", "what are some of their scientific projects?", "The effect of outdoor and indoor air pollutants on museum collections and the cause of deterioration of the sandstone in the original National Capitol Columns", "could you name a few places they travelled for their field projects?", "Mogao Caves and Yungang Grottoes in China, Sierra de San Francisco in Baja California Sur, etc.", "how do they deliver information about their work to the public?", "Conferences; lectures; books; and online publications, newsletters, video, and audio."]}
{"conversations": ["who is the original singer of you're gonna miss me when i'm gone", "Over the years, the original has been recorded by many artists, most notably by Charlie Monroe. Lulu and the Lampshades were the first to use the cup game for percussion when performing the song", "who is this mentioned person?", "He  was an American country and bluegrass music guitarist.", "does he have siblings?", "Yes, Bill Monroe, Bertha, Birch", "what are his single works?", "UNANSWERABLE", "among the above three brothers; was the first one part of any band?", "Yes,  Blue Grass Boys", "was he also a guitarist?", "No, he was a mandolinist.", "was he into folk music?", "Yes, Monroe's fortunes began to improve during the American folk music revival, associating his style more with traditional folk music than with the country-and-western genre with which it had previously been identified.", "when did this revival touch its highest peak?", "1959", "did any other music genre absorb this genre?", "Yes, Ethnic folk music", "can you name any person or band or anything like that which belonged to this revival period?", "The most successful ethnic performers of the revival were the Greenwich Village folksingers, The Clancy Brothers and Tommy Makem.", "which song or music did this last person compose?", "Makem's best-known songs include \"Four Green Fields\", \"Gentle Annie\"."]}
{"conversations": ["who headed up the manhattan project in britain", "James Chadwick", "who is he?", "He was a British physicist.", "what was he known for?", "His discovery of the neutron.", "can you describe this thing he discovered?", "It is a subatomic particle, symbol or which has a neutral (not positive or negative) charge and a mass slightly greater than that of a proton.", "why was the above project started?", "It helped initiate the effort to build the first atomic bombs in the United States during World War II, and helped carry it through to completion in August 1945 by supplying crucial expertise.", "any other scientist were involved in it?", "Sir Geoffrey Taylor, James Tuck, Niels Bohr, Peierls, Frisch, and Klaus Fuchs", "what field did the last scientist study?", "Mathematics and physics", "why was he sent to prison?", "He was convicted on 1 March 1950 of four counts of breaking the Official Secrets Act by \"communicating information to a potential enemy.", "what was the sentence announced by the court?", "14 years imprisonment", "can you explain the act that he broke?", "It is legislation that provides for the protection of state secrets and official information, mainly related to national security.", "which countries follow it?", "Hong Kong, India, Ireland, Myanmar, Malaysia, Singapore and the United Kingdom etc"]}
{"conversations": ["who does the voice over for bart simpson", "Nancy Jean Cartwright", "when did she start her career?", "She moved to Hollywood in 1978 and trained alongside voice actor Daws Butler.", "who is this other voice actor?", "He worked mostly for the Hanna-Barbera animation production company where he originated the voices of many familiar characters, including Loopy De Loop.", "how did he die?", "He had suffered a stroke and been battling pneumonia in the last few months before he died.", "the disease that he battled with, what are its symptoms?", "Some combination of productive or dry cough, chest pain, fever and difficulty breathing.", "how can it be diagnosed?", "It is typically diagnosed based on a combination of physical signs and a chest X-ray.", "how can it be prevented?", "It includes vaccination, environmental measures and appropriate treatment of other health problems.", "is there any awareness done for it?", "Due to the relatively low awareness of the disease, 12 November was declared as the annual World Pneumonia Day.", "what is its effect on kids?", "It is the leading cause of death among children in low income countries.", "how does pollution effect the first symptom mentioned above?", "It may be caused by air pollution including tobacco smoke, particulate matter, irritant gases, and dampness in a home."]}
{"conversations": ["what are the major global wind systems on earth", "polar easterlies, westerlies to name a few.", "what is the first one about?", "are the dry, cold prevailing winds that blow from the high-pressure areas towards the low-pressure areas.", "how does it effect the precipitation?", "Orographic precipitation occurs on the windward side of mountains and is caused by the rising air motion of a large-scale flow of moist air across the mountain ridge, resulting in adiabatic cooling and condensation.", "are there any trade that depend on this?", "Yes, The trade winds.", "what does it mean?", "They are the prevailing pattern of easterly surface winds found in the tropics near the Earth's equator.", "what is the length of the last thing mentioned?", "The equator is 0.16% longer than a meridian.", "where is it located?", "The precise location of the equator is not truly fixed; the true equatorial plane is perpendicular to the Earth's rotation axis, which drifts about during a year.", "which all countries does it pass through?", "The equator passes through the land of 11 countries. Indonesia straddling the greatest length of the equatorial line.", "how did this country mentioned get the name?", "Derives from Greek and the word meaning \"Indian islands\".", "can you name a few political parties that can be found here?", "The Democratic Party, Great Indonesia Movement Party , Party of the Functional Groups, Prosperous Justice Party to name a few.", "which are the main tourist spots here?", "Bunaken National Park, Raja Ampat Islands,Komodo National Park, the Sawahlunto Coal Mine, royal palaces of Pagaruyung, Ubud, and Yogyakarta.", "which animals are preserved in the first one?", "Emperor angelfish, Almaco jack, spotted seahorse, bluestripe snapper, pinkish basslet and two-lined monocle bream to name a few.", "what is the total population in the country?", "16 million people, it is the world's 4th-most-populous country.", "does it encourage film industry?", "Yes, Independent film making was a rebirth of the film industry since 1998."]}
{"conversations": ["what are the alternating dark and light bands in jupiter’s atmosphere called", "Lightly colored \"zones\" and relatively dark \"belts.\"", "what is the atmosphere like in jupiter?", "It is mostly made of molecular hydrogen and helium in roughly solar proportions; other chemical compounds are present only in small amounts and include methane, ammonia, hydrogen sulfide, and water.", "how can you describe its structure vertically?", "The atmosphere of Jupiter is classified into four layers, by increasing altitude: the troposphere, stratosphere, thermosphere and exosphere", "what is the definition of the first mentioned layer?", "The troposphere is the lowest layer of Earth's atmosphere, and is also where nearly all weather conditions take place.", "what is the flow here like?", "The flow of the atmosphere generally moves in a west to east direction.", "are there different types of flow?", "Yes, Zonal flow, Meridional flow and Atmospheric flow", "how do you explain the first type of flow?", "A zonal flow regime is the meteorological term meaning that the general flow pattern is west to east along the Earth's latitude lines, with weak shortwaves embedded in the flow", "how is the third type of flow?", "UNANSWERABLE", "what is the density of the last chemical compound found in the planet?", "UNANSWERABLE", "what is the size of the aforesaid planet?", "Jupiter's radius is about 1/10 the radius of the Sun", "what is its importance in myth?", "To the Babylonians, this object represented their god Marduk. They used Jupiter's roughly 12-year orbit along the ecliptic to define the constellations of their zodiac", "what are some names of this god?", "UNANSWERABLE", "what is his background?", "Marduk's original character is obscure but he was later associated with water, vegetation, judgment, and magic."]}
{"conversations": ["when does rachel get a job at ralph lauren", "The eighteenth episode of the fifth season of \"Friends\" and 115th overall. It first aired on NBC in the United States on April 8, 1999. In the episode, Rachel (Jennifer Aniston) starts her new job at Ralph Lauren.", "who are the other characters on this show?", "Monica Geller, Phoebe Buffay, Joey Tribbiani, Chandler Bing and Ross Geller  the other characters on this show.", "who produced the episode?", "It was written by Michael Curtis and directed by Todd Holland.", "does it have any cultural references?", "Yes, he songs \"Never There\" by Cake.", "what kind of reception did it receive?", "It was the third highest-rated show on NBC that week, after \"ER\" and \"Frasier\".", "were there any critics?", "Yes, \"Entertainment Weekly\" rated the episode \"C\", in its review of the fifth season.", "what is the full form of the channel you mentioned earlier?", "The National Broadcasting Company.", "who owns it?", "NBCUniversal.", "when was it established?", "August 2, 2004.", "what are the characters real life names?", "Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc, Matthew Perry and David Schwimmer.", "the band you mentioned earlier, name a few other songs by them", "\"Rock 'n' Roll Lifestyle\", \"The Distance\" and \"Short Skirt/Long Jacket\"."]}
{"conversations": ["what was ss christopher columbus?", "An American excursion liner on the Great Lakes", "where is this lake situated?", "The upper mid-east region of North America", "which religions are practiced in that continent?", "Christianity, Atheism,  Buddhism", "what are the symbols associated with the first religion?", "The cross", "are there emblems like that symbol?", "Yes", "what was its significance in pre christian era?", "In the European Bronze Age the cross symbol appeared to carry a religious meaning, perhaps as a symbol of consecration, especially pertaining to burial.", "and what is its significance in christianity?", "UNANSWERABLE", "does the lake mentioned above has any sea transport connection to any ocean?", "Yes, the Great Lakes accessible to ocean-going vessels, shifts in shipping to wider ocean-going container ships", "how does the last type of ship mentioned above carries cargo?", "They carry all of their load in truck-size intermodal containers, in a technique called containerization.", "when did this technique originate?", "The late 18th century", "what are the hazards associated with the process?", "Containers have been used to smuggle contraband or stolen cars.", "are the containers used for anything else?", "Housing, as a cabin or as a workshop, can be used to house computer data centers", "are their any examples of such architecture?", "Yes,  the Aegean, for the Computer Electronics Show in Las Vegas, Nevada, and Tempo Housing in Amsterdam"]}
{"conversations": ["what is roosevelt dime?", "Is the current dime, or ten-cent piece, of the United States", "who designed it?", "John R. Sinnock", "who is he?", "Eighth Chief Engraver of the United States Mint", "mention a few controversies of his?", "The letters \"JS\" actually stood not for John Sinnock, but for Joseph Stalin. The urban folk story coincided with the Second Red Scare. Another controversy was an allegation that Sinnock copied or borrowed the design of the President's profile from a bronze bas relief created by sculptress Selma H. Burke", "did the aforementioned mint struck the roosevelt dime?", "UNANSWERABLE", "who made the dime?", "John R. Sinnock", "when was the united states mint established?", "The Mint was created in 1792", "where is its location?", "In Philadelphia", "what is fort knox and the mint's relation?", "Its primary purpose is for storage of the United States and other countries' gold and silver bullion reserves.", "is it a building or fort?", "Is a fortified vault building", "any recent incident happened over there related to shooting?", "On 18 October 1993, Arthur Hill went on a shooting rampage, killing three and wounding two before attempting suicide, shooting and severely wounding himself.", "how does air corps utilize it?", "As a training base during World War II.", "is it used for protecting valuable objects?", "For protection after the Japanese attack on Pearl Harbor in 1941, the Declaration of Independence, the Constitution of the United States and the Gettysburg Address were all moved for safekeeping", "does it have a high school in its premises?", "It has a high school located on-post, Fort Knox High School", "describe its climate in few words?", "It has hot, humid summers and generally mild to cool winters."]}
{"conversations": ["cast of the movie the girl with the dragon tattoo", "Daniel Craig and Rooney Mara", "what is the movie about?", "Mikael Blomkvist's investigation to find out what happened to a woman from a wealthy family who disappeared 40 years prior. He recruits the help of Salander, a computer hacker.", "where was it film?", "Stockholm, Sweden; Uppsala; Zurich, Switzerland; and finally Oslo, Norway.", "who composed the score for the film?", "Reznor and Ross", "is there a sequel to it?", "Yes, \"The Girl Who Played with Fire\" and \"The Girl Who Kicked the Hornets' Nest\".", "when are these sequels going to be released?", "UNANSWERABLE", "is the latter aforementioned sequel a novel?", "Yes, it is the second novel in the best-selling \"Millennium\" series.", "when was it published?", "Posthumously, in Swedish in 2006 and in English in January 2009.", "how was it received?", "The English version immediately became a number 1 bestseller - Joan Smith at \"The Sunday Times\" said that this novel was “even more gripping and astonishing than the first”.", "mention a few notable stories from the above mentioned media outlet?", "UNANSWERABLE", "any scandals associated with the media outlet?", "In July 2011, it was implicated in the wider News International phone hacking scandal which primarily involved the \"News of the World\".", "when did it come online?", "UNANSWERABLE", "when was it founded?", "18 February 1821", "who founded it?", "Henry White", "who was he?", "UNANSWERABLE", "who plays the role of protagonist in the aforementioned film?", "Daniel Craig"]}
{"conversations": ["date of japanese surrender in world war ii", "September 2, 1945", "what were the divisions within their leadership?", "Suzuki's military-dominated cabinet favored continuing the war. For the Japanese, surrender was unthinkable—Japan had never been successfully invaded or lost a war in its history. Only Mitsumasa Yonai, the Navy minister, was known to desire an early end to the war.", "why did they surrender then?", "August 28, 1945 Japanese Instrument of Surrender was signed", "what happened at hiroshima in this context?", "United States detonated an atomic bomb over the Japanese city of Hiroshima.", "and nagasaki?", "Hours later, the United States dropped a second atomic bomb, this time on the Japanese city of Nagasaki.", "were there any further surrenders followed after this?", "It was broadcasted later that Japan was indeed unconditionally surrendering to the allies.", "which interesting places are there in the former mentioned city?", "Itsukushima Island, also known as Miyajima", "how is the weather here?", "Has a humid subtropical climate characterized by cool to mild winters and hot, humid summers.", "who used to rule this place during 1589 to 1871?", "Mōri Terumoto", "who is this person?", "He was a Japanese \"daimyō\".", "whom did he provide his service to?", "Toyotomi Hideyoshi", "is this person another ruler?", "He is  the \"de facto\" leader", "what does this second last term means?", "It means practices that exist in reality, even though they are not officially recognized by laws.", "did this mention leader build any castle?", "Hideyoshi's rule covers most of the Azuchi–Momoyama period of Japan, partially named after his castle, Momoyama Castle. Hideyoshi left an influential and lasting legacy in Japan, including Osaka Castle", "what was unified during this mentioned period?", "Hideyoshi sought to secure his position by rearranging the holdings of the \"daimyōs\" to his advantage."]}
{"conversations": ["what year did the mayflower land on plymouth bay", "December 16, 1620", "where was this colony located?", "Plymouth, Massachusetts", "which is the ship they traveled to this place in?", "\"Mayflower\"", "is there a society bearing the same name as the ship?", "Yes, The General Society of Mayflower Descendants, or The Mayflower Society", "what was the language spoken by the people who came on the ship?", "UNANSWERABLE", "was the place mentioned earlier associated with any war?", "Yes, Revolutionary War", "what sort of public transportation is found here?", "Several transportation facilities available such as buses, railways, airports, ferry, etc", "are there other cities closely similar to this one?", "Yes, it  has shared a twin-city status with Devon in United Kingdom and Shichigahama, Miyagi Prefecture in Japan", "has the last mentioned prefecture experienced any natural disaster?", "Yes, earthquake and tsunami", "when did these occur?", "On March 11, 2011, a 9.0 magnitude earthquake and a subsequent major tsunami, on  April 7, 2011, a 7.4-magnitude earthquake", "how many people live in this city?", "UNANSWERABLE", "what are some tourist attractions in this place?", "Sendai Castle, Matsushima, the pine-clad islands, etc.", "where is the first mentioned twin-city located?", "England, reaching from the Bristol Channel in the north to the English Channel in the south", "are there any famous people from there?", "Yes, Sir Francis Drake, Sir Humphrey Gilbert, Sir Walter Raleigh, John Oxenham, and many more", "when did humans first start occupying this area?", "30–40,000 years ago,  Mesolithic hunter-gatherer peoples from about 6000 BC"]}
{"conversations": ["where does kevins family go in home alone", "Paris, France", "who are the characters in the film?", "Kevin, Harry Lyme and Marvin \"Marv\" Merchants, Peter, Kate, Buzz, Jeff, Megan, Linnie", "was the film accused of copying?", "Yes, accused for copying 1989 French film \"3615 code Père Noël\"", "how many sequels does the english film have?", "Five", "does the first character mentioned above appear in all of them?", "No, only first two", "who played that role?", "Macaulay Culkin", "did he write any book?", "Yes, novel titled \"Junior\"", "did he also dabble in music?", "Yes, had a New York-based, pizza-themed comedy rock band \"The Pizza Underground\"", "what happens with his character in the sequel?", "UNANSWERABLE", "what was critic's opinion about the original movie?", "Rotten Tomatoes rated 5.65/10, Metacritic gave average score of 63 out of 100 and audiences gave \"A\" grade on an A+ to F scale."]}
{"conversations": ["who provides the voice of mr smithers on the simpsons", "Harry Shearer", "where was he born?", "Los Angeles", "what else were his professions other than being a voice artist?", "He is also an actor, comedian, writer, musician, radio host, director and producer.", "to which radio network was he a host?", "National Public Radio", "what sort of shows has he hosted?", "He was host of the public radio comedy/music program \"Le Show\".", "has the show faced any criticism?", "Yes, Wisconsin Public Radio cancelled \"Le Show\"; Shearer claimed WPR was \"displeased with the political content of the broadcast\".", "what is the music segment of the show about?", "\"An eclectic mix of mysterious music\" is how KCRW describes the music played between other segments on the program. Frequently played tracks are from musicians like Johnny Adams, Astral Project, Marcia Ball etc.", "what were some of the films in which he has acted?", "\"This Is Spinal Tap\", \"The Truman Show\" and \"A Mighty Wind\"", "what religious analogy does the second movie have?", "Christof represented Jesus as an \"off-Christ\" (\"Christ-off\") or Antichrist, - the megalomaniacal Hollywood producer is compared to Lucifer; conversation between Truman and Marlon at the bridge can be compared to one between Moses and God in the Book of Moses.", "in what way is a comparison made to utopia?", "Parallels can be drawn from Thomas More's 1516 book \"Utopia\", in which More describes an island with only one entrance and only one exit.", "who is the former biblical character involved in conversation with god specified above?", "He is the most important prophet in Judaism, and an important prophet in Christianity, Islam, the Baháʼí Faith, and a number of other Abrahamic religions.", "how was he related to founding fathers of us?", "They chose the symbol of Moses leading the Israelites to freedom as a seal that would clearly represent a symbol for the new United States; also inscribed the words of Moses on the Liberty Bell: \"Proclaim Liberty thro' all the Land to all the Inhabitants thereof.\" (Leviticus 25)", "has he abolished slavery?", "Historian Gladys L. Knight describes how leaders who emerged during and after the period in which slavery in the United States was legal often personified the Moses symbol. when Abraham Lincoln was assassinated in 1865 after the passage of the amendment to the Constitution outlawing slavery, Black Americans said they had lost \"their Moses\".", "what does justin martyr say about him?", "He Moses to be \"more trustworthy, profound and truthful because he is \"older\" than the Greek philosophers.\"", "can you mention some of his portrayals in other art forms?", "Michelangelo's statue of Moses"]}
{"conversations": ["how long is the staton island ferry ride", "Approximately 25 minutes", "where is this located?", "The ferry's single route runs through New York Harbor between the New York City boroughs of Manhattan and Staten Island", "when it started its service?", "1810", "who all can ride it?", "Passengers from  New York Harbor between the New York City boroughs of Manhattan and Staten Island", "and how much is its fare?", "In 2012 fare was $4.86,  it rose to $5.87 in 2016, before dropping to $5.16 in 2017. In 2017, it  was $6.50, after accounting for the $2.75 per-passenger fare", "you have mentioned about an island above; what is its geographical location?", "It is a borough of New York City, the island is topographically and geologically a part of New Jersey, the  Island is separated from Long Island by the Narrows and from mainland New Jersey", "so before the aforementioned transport service started in this island, was it a railway junction?", "No,  Staten Island Railway opened after the ferry service", "and what was its date of opening?", "1860", "how is the police related to it?", "The MTA Police Department was created in 1998 with the merger of the Long Island Rail Road Police Department", "what are the various branches of this railway line?", "North Shore Branch  is one of them"]}
{"conversations": ["when does blair have her baby with chuck", "In  the fifth-season Blair reveals to Chuck that she is pregnant with Louis's baby.", "who is she?", "She is one of the main characters of \"Gossip Girl\".", "is it a film?", "No, it is an American teen drama television series.", "when was it premiered?", "September 19, 2007", "where was it filmed?", "New York", "who were the other actors?", "Nate Archibald, Chuck Bass, Jenny Humphrey etc", "which channel did broadcast it?", "The CW network", "when was it established?", "September 18, 2006", "what kinds of programmes does it telecast?", "News programmes and Children's programmes", "was there any sequel of it?", "UNANSWERABLE", "what format were the episodes shot?", "Each episode begins with the home page of the Gossip Girl website and Serena's picture from the pilot episode, then a recap of events relevant to the upcoming narrative and ends again with the homepage of the website, but this time with a picture from another character with a text about a recent event connected with the picture.", "who was the director?", "Josh Schwartz and Stephanie Savage", "where is the former from?", "Providence, Rhode Island", "can you mention any other series directed by him?", "The O.C.", "what was it's genre ?", "American teen drama"]}
{"conversations": ["who plays bad guy in iron man 2", "Justin Hammer", "which other actors are there in this film?", "The film stars Robert Downey Jr. as Tony Stark / Iron Man alongside Gwyneth Paltrow, Don Cheadle, Scarlett Johansson, Sam Rockwell, Mickey Rourke, and Samuel L. Jackson.", "what is the storyline?", "It is a 2010 American superhero film based on the Marvel Comics character Iron Man.", "where is it filmed?", "The bulk of the production took place at Raleigh Studios, few scenes were filmed at Edwards Air Force Base", "where is this air force base located?", "Kern County in Edwards, California", "who is the editor of the mentioned comics series?", "UNANSWERABLE", "is there any themed park based on this comics?", "Yes.  Marvel Super Hero Island at Universal Orlando's Islands of Adventure in Orlando, Florida, which includes rides based on their iconic characters and costumed performers, as well as The Amazing Adventures of Spider-Man ride cloned from Islands of Adventure to Universal Studios Japan.", "when was this island created?", "Marvel Super Hero Island was created in 1999", "can you explain the ride you mentioned in your previous answer?", "UNANSWERABLE", "has it received it award?", "Its  won \"Amusement Today\"s Golden Ticket Award for Best Dark Ride for twelve consecutive years from 1999 through to 2010.", "the japanese studio you have mentioned above; is it also a themed park?", "Yes, located in Osaka, is one of six Universal Studios theme parks, owned and operated by , which is wholly owned by NBCUniversal (as of 2017).", "what are some of its attractions?", "Wizarding World of Harry Potter, Super Nintendo World,Harry Potter and the Forbidden Journey.", "what is the price of its ticket?", "Studio one day passes start at ￥7,091 (￥7,800 with tax) for adults and ￥4,910 (￥5,400 with tax) for children. Seniors (65 years or over) start at ￥6,455 (￥7,100 with tax). Studio two day passes start at ￥14,000 (￥15,400 with tax) for adults and ￥9,546 (￥10,500 with tax) for children.", "the list of actors you have mentioned above; what trouble did the first actor face?", "From 1996 through 2001, Downey was arrested numerous times on charges related to drugs and went through drug treatment programs unsuccessfully, explaining in 1999 to a judge", "can you name some of his blockbuster movies?", "Iron Man\" and Tropic Thunder"]}
{"conversations": ["who is the leader of ruling party in india", "Narendra Modi", "which political party does he currently belong to?", "The Bharatiya Janata Party (BJP)", "when was this party established?", "1980", "mention a few of their social policies.", "It is committed to Hindutva, an ideology articulated by Indian independence activist Vinayak Damodar Savarkar.", "what are some of their economic policies?", "Introduced significant deregulation and privatisation of government owned enterprises. It also introduced tariff-reducing measures. These reforms built off of the initial economic liberalisation", "what are some of the steps this party has taken to safeguard the country from terrorism?", "NDA government carried out nuclear weapons tests, and enacted the Prevention of Terrorism Act, which later came under heavy criticism. It also deployed troops to evict infiltrators from Kargil, and supported the United States' War on Terror.", "what are some of the designated posts in this party?", "UNANSWERABLE", "what are some of the chief ministers who belong to this party?", "UNANSWERABLE", "who all were involved in the establishment of this party?", "Syama Prasad Mukherjee, Mauli Chandra Sharma, Prime Minister Atal Bihari Vajpayee", "who is the second person mentioned?", "A senior Indian politician, originally of the Indian National Congress. He was a founding member of the Bharatiya Jana Sangh", "which educational institutions did he attend?", "Attended the Hindu College"]}
{"conversations": ["who did the voice for simba in lion king", "Matthew Broderick", "can you name the movie ?", "The Lion King", "when was it released?", "June 1994", "who designed the protagonist?", "Mark Henn served as Simba's supervising animator as a cub, Ruben A. Aquino animated the character as he appears as an adult.", "what response did the character receive?", "Universal acclaim, a superbly realized character", "who did the music for the movie?", "Hans Zimmer", "did it receive any award?", "Yes - Golden Globes; for Best Motion Picture – Musical or Comedy and Best Original Score ; Academy Awards for Best Original Score (Hans Zimmer) and Best Original Song with \"Can You Feel the Love Tonight\" ; Annie Awards for Best Animated Feature", "what can you tell me about the person who voiced for the protagonist?", "An American actor and singer", "can you name any one of his works?", "He played Ferris Bueller in 'Ferris Bueller's Day Off' (1986);  He played Leo Bloom in both the Broadway musical 'The Producers' and its 2005 film adaptation.", "when did he begin his career?", "His first major acting role came in an HB Studio workshop production of playwright Horton Foote's \"On Valentine's Day\""]}
{"conversations": ["where is the oakwood cemetery?", "northeastern Troy, New York, United States", "and what is oakwood cemetery?", "It is a nonsectarian rural cemetery.", "mention a few landmarks at that cemetery?", "The monolithic obelisk and Celtic Cross", "name a few famous interments over there?", "E. Harold Cluett, John Paine Cushman, John Dean Dickinson, etc", "who is the third person?", "He was a U.S. Representative from New York.", "when was the cemetery made?", "1848", "what are some famous buildings from troy?", "Frear's Troy Cash Bazaar,Corinthian Courthouse, Troy Public Library,etc.", "describe something about the roads of troy?", "U.S. Route 4 runs north-south through the city. New York Route 7 passes through, east-west through the city, with a bridge west across the Hudson River, as does New York Route 2.", "what are some events that happen at some period?", "In 1707,  Dirck Van der Heyden purchased a farm of , which in 1787 was laid out as a village.", "what is troy to new york?", "It is a city in the U.S. state of New York.", "any rivers flowing through troy?", "Hudson River", "how is the salinity of the river?", "The salt line of the river varies from the north in Poughkeepsie to the south at Battery Park in New York City, though it usually lies near Newburgh", "is it facing the issue of pollution?", "Yes, General Electric's contamination of the river with polychlorinated biphenyls (PCBs)"]}
{"conversations": ["what is don valley parkway?", "It is a municipal expressway.", "has it been represented in media?", "Yes, the music video for the song Subdivisions by Canadian rock group Rush features scenes of the DVP", "when was the construction completed?", "1966", "is it a busy expressway?", "UNANSWERABLE", "what places does it connect?", "It connects Toronto, Ontario, Canada to Gardiner Expressway in downtown Toronto.", "can you elaborate on the architecture of the first place?", "It is a new, brash, rag-tag place—a big mix of periods and styles.", "is the crime rate high here?", "It  has a fairly low diurnal temperature range.", "what all modes of transport are available?", "road, rail and air networks are available", "has there been any developments in the city in the current century?", "They hosted WorldPride in June 2014, and the Pan American Games in 2015", "what is the former?", "It is an event that promotes lesbian, gay, bisexual, transgender, and queer (LGBTQ pride) issues on an international level through parades, festivals and other cultural activities.", "where was it first held?", "UNANSWERABLE", "where would it be held in 2023?", "Sydney, Australia", "about the various groups that you mentioned, have the first one been depicted on films?", "Yes", "and in fiction?", "Yes"]}
{"conversations": ["when did the euro come out in spain", "2002", "what is this ?", "The euro (symbol: €; code: EUR) is the official currency of 19 of the member states of the European Union.", "are there any inflation risk associated with it ?", "In the short term, there was a widespread impression in the population of the eurozone that the introduction of the euro had led to an increase in prices, but this impression was not confirmed by general indices of inflation and other studies.", "what are its linguistic issues ?", "Bulgaria has negotiated an exception; \"euro\" in the Bulgarian Cyrillic alphabet is spelled as eвро and not eуро in all official documents. In the Greek script the term ευρώ (evró) is used", "are its exchange rates flexible ?", "Yes - In the years following the Single European Act, the EU has liberalised its capital markets and, as the ECB has inflation targeting as its monetary policy, the exchange-rate regime of the euro is floating.", "what are its direct uses ?", "It has been used as a trading currency in Cuba since 1998, Syria since 2006, and Venezuela since 2018.", "where is this country located ?", "UNANSWERABLE", "where is this currency used ?", "19 EU member states: Austria, Belgium, Cyprus, Estonia, Finland, France, Germany, Greece, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, the Netherlands, Portugal, Slovakia, Slovenia, and Spain", "where is the first country located ?", "UNANSWERABLE", "name some currencies pegged to this currency ?", "CFA franc, Comorian franc. Cape Verdean escudo, Bulgarian lev)", "which the first currency you have mentioned above ?", "The CFA franc  is the name of two currencies, the West African CFA franc, used in eight West African countries, and the Central African CFA franc, used in six Central African countries.", "how is it evaluated ?", "The European Union's own assessment of the CFA's link to the euro noted that \"benefits from economic integration within each of the two monetary unions of the CFA franc zone, and remained remarkably low between them."]}
{"conversations": ["is turkish airlines a member of the star alliance", "Yes, from December 2006.", "what is this alliance?", "The world's largest global airline alliance.", "why was it formed?", "UNANSWERABLE", "who were the members?", "VARIG, Ansett Australia and Air New Zealand.", "what is the silver category?", "It recognizes that you have shown a good degree of loyalty to Star Alliance member airlines and earns you two privileges that can make your journey smoother.", "what about the gold?", "It is given to customers who have reached a higher level of a member airline's frequent-flyer program.", "earlier you mentioned about a few airlines, where is the third airline from?", "New Zealand", "where is this country located?", "In the southwestern Pacific Ocean.", "how did the name originate?", "Dutch cartographers subsequently renamed Tasman's discovery \"Nova Zeelandia,\" from Latin, after the Dutch province of Zeeland.", "what is the system of governance here?", "A constitutional monarchy with a parliamentary democracy, although its constitution is not codified.", "what languages are spoken here?", "English"]}
{"conversations": ["harry potter and the chamber of secrets full book summary", "The plot follows Harry's second year at Hogwarts School of Witchcraft and Wizardry, during which a series of messages on the walls of the school's corridors warn that the \"Chamber of Secrets\" has been opened and that the \"heir of Slytherin\" would kill all pupils who do not come from all-magical families. These threats are found after attacks that leave residents of the school petrified. Throughout the year, Harry and his friends Ron and Hermione investigate the attacks.", "when was the book published?", "2 June 1999", "what is the theme of the book?", "sacrifice, love, friendship, loyalty, prejudice, and racism.", "does it have any special connection with any other book in this series?", "Yes, \"Chamber of Secrets\" has many links with the sixth book of the series, \"Harry Potter and the Half-Blood Prince\".", "what is the storyline of that book?", "The novel explores the past of the boy wizard's nemesis, Lord Voldemort, and his preparations for the final battle against Voldemort alongside his headmaster and mentor Albus Dumbledore", "what does the headmaster look like?", "Albus Dumbledore is tall and thin, with silver hair and beard so long that they can be tucked into his belt. He has a very long and crooked nose that looks as if it has been broken at least twice. He is also said to have long and skillful fingers. His eyes are described as being a brilliant, soul-piercing shade of blue, and usually twinkled with kindness and mischief.", "which skills does he have?", "Dumbledore is an expert at nonverbal spells and is famous as an alchemist who has worked with Nicolas Flamel, the only known maker of the Philosopher's Stone, and is credited with discovering the twelve uses of dragon's blood.", "does he have any remarkable possessions?", "Pensieve, Deluminator, Elder Wand and Phoenix.", "what is the real name of the boy wizard's nemesis mentioned above?", "Tom Marvolo Riddle", "what are his magical strengths?", "He is known as one of the greatest Legilimens in the world and a highly accomplished Occlumens; he can read minds and shield his own from penetration.", "is he related to any other family apart from the riddle one?", "Yes, Gaunts", "how is he related to them?", "They are the last known descendants of Salazar Slytherin.", "in which city did the alchemist who worked with the headmaster live?", "Paris", "is he a real person or a fictional character?", "UNANSWERABLE"]}
{"conversations": ["on what date did the 1880 democratic national convention occur?", "June 22 to 24, 1880", "what was the purpose for this meeting?", "To nominate Winfield S. Hancock for president and William H. English for vice president in the US presidential election of 1880.", "in which venue was this held?", "Music Hall in Cincinnati, Ohio", "can you name some people who attended this?", "Henry B. Payne", "who is the above person?", "American politician", "can you name a few nominees from this convention?", "Justice Stephen J. Field, Thomas F. Bayard. Gray, to name a few.", "were the nominees selected on the basis of the number of votes or were they selected as per their ambition?", "Number of votes", "who won the largest number of votes in this convention?", "Winfield S. Hancock", "did the above person win the us presidential election of 1880?", "No", "instead who won?", "James A. Garfield", "what's the above person's date of birth?", "November 19, 1831", "when did he take office for the president's role?", "March 4, 1881", "whom did he marry?", "Lucretia Rudolph", "did he participate in a war?", "Middle Creek, Shiloh, and Chickamauga.", "what was his job title in those wars?", "He fought in those", "how did he die?", "By assassination"]}
{"conversations": ["how many floors is the empire state building observation deck", "3 floors.", "where is it located?", "Midtown Manhattan in New York City.", "what is the earlier mentioned building used for?", "UNANSWERABLE", "what kind of architecture does it follow?", "Pre–World War II architecture.", "did the design have any kind of change?", "Yes, it was later increased to 60 and then 80 stories.", "the place where you mentioned it is located, what is it's economics?", "It, along with Lower Manhattan, is one of the world's leading financial centers.", "does it have any kind of headquarters?", "Midtown contains the headquarters of major companies, including 4Kids Entertainment (formerly), Barnes & Noble, Bloomberg L.P. to name a few.", "the kind of architecture mentioned, does any other structure have the same?", "Yes, the Willis Tower's and the John Hancock Center's.", "what's the historical importance of the second structure?", "UNANSWERABLE", "when was the first structure above, built?", "1930 to 1931."]}
{"conversations": ["describe in general terms the structure of ionic solids such as nacl", "Ions typically pack into extremely regular crystalline structures, in an arrangement that minimizes the lattice energy.", "what can you tell me about their boiling point?", "Boiling points exhibit similar trends to melting points in terms of the size of ions and strength of other interactions. When vapourized, the ions are still not freed of one another.", "can you name any compounds?", "Ammonium acetate, zinc oxide, aluminum hydroxide,  aluminium oxide and lead(II) oxide.", "what are the uses of the aforesaid initial one?", "It is also used as a diuretic.", "what can you tell me about its production?", "Ammonium acetate is produced by the neutralization of acetic acid with ammonium carbonate or by saturating glacial acetic acid with ammonia.", "what are the applications of the second one?", "It is used for making plastics, ceramics, glass, cement, rubber, lubricants, paints, ointments, adhesive, sealants, concrete manufacturing, pigments, foods, batteries, ferrites, fire retardants, etc.", "how is it used in the ceramic industry?", "It is used in ceramic glaze and frit compositions.", "can you name the medicines in which they are used?", "Calamine lotion, zinc oxide eugenol and others.", "what are its mechanical properties?", "It is a relatively soft material with approximate hardness of 4.5 on the Mohs scale. Also its elastic constants are smaller than those of relevant III-V semiconductors.", "what is wet chemical process?", "It is a process that starts with aqueous solutions of zinc salts, from which zinc carbonate or zinc hydroxide is precipitated."]}
{"conversations": ["are the oldest rocks in the world in the grand canyon", "Yes, the rock layers exposed in the Grand Canyon and in the Grand Canyon National Park area range in age from about 200 million to nearly 2 billion years old.", "is there any river flowing through or alongside it?", "Yes, Colorado River", "what exactly is that canyon mentioned above?", "It is a steep-sided canyon carved by the Colorado River in Arizona, United States.", "what are some of the tributaries of the water body mentioned above?", "The Colorado is joined by over 25 significant tributaries: Green River,  Gila River ,", "what are some of the flora found near this larger river?", "Creosote bush, saguaro cactus, and Joshua trees", "who were the first to explore this area?", "The Spanish began to explore and colonize western North America.", "has the state where the canyon is located, experienced any natural disasters?", "The first damaging earthquake known to be centered within Arizona occurred on January 25, 1906, also including a series of other earthquakes centered near Socorro, New Mexico.", "how many people live there?", "The United States Census Bureau estimates Arizona's population was 7,278,717 on July 1, 2019, a 13.87% increase since the 2010 United States Census.", "what is the state's policy on marriage between homosexual partners?", "Arizona became the first state in the United States to reject a proposition, Prop 107, that would have banned same-sex marriage and civil unions.", "what is this form of union mentioned here?", "A civil union  is a legally recognized arrangement similar to marriage, created primarily as a means to provide recognition in law for same-sex couples.", "what is the origin of this term?", "The term vary widely from country to country. Some other terms include  civil partnerships, registered partnerships, domestic partnerships, significant relationships."]}
{"conversations": ["what is the new mary poppins movie rated", "On Rotten Tomatoes, the film holds an approval rating of 79% based on 371 reviews, with an average rating of 7.28/10.", "when was this film released?", "2018", "who directed it?", "Rob Marshall", "what is the genre of this motion picture?", "Musical fantasy film", "what is this motion picture all about?", "Set in London during the Great Depression, some twenty-five years after the events of the original film, the film sees Mary Poppins, the former nanny of Jane and Michael Banks, return to them in the wake of the death of Michael's wife.", "which actress played the role of the protagonist?", "Emily Blunt", "how were the protagonist's nature and personality depicted in the film?", "UNANSWERABLE", "where were the scenes filmed at?", "Shepperton Studios in Surrey, England", "is there someone who owns the above studios?", "Yes, the Pinewood Studios Group", "who composed that film's music score?", "Marc Shaiman", "from where did he study music?", "UNANSWERABLE", "is he an activist?", "To protest the passage of California Proposition 8 in November 2008, he wrote a satiric mini-musical called \"Prop 8 — The Musical.\"", "apart from this film, what other films/tv shows has he composed music for?", "Numerous, including \"Broadcast News\", \"Beaches\", \"When Harry Met Sally...\", etc."]}
{"conversations": ["how much is robert f kennedy bridge toll", "drivers pay $9.50 per car or $4.00 per motorcycle for tolls by mail. Customer Service Center pay $6.12 per car or $2.66 per motorcycle.", "which locations are connected by this bridge?", "The bridges link the boroughs of Manhattan, Queens, and the Bronx.", "does it traverse a river?", "Yes -  East River, Harlem River, Bronx Kill", "where does the first river originate?", "Long Island Sound", "are there any other bridges on that river?", "Yes -  Brooklyn Bridge, Williamsburg Bridge, the Queensboro Bridge", "what type of bridge is the first one?", "cable-stayed/suspension bridge", "what types of vehicles use it?", "Only passenger vehicles and pedestrian and bicycle traffic are permitted.", "is the second bridge also same type as the first one?", "No - The Williamsburg Bridge is a suspension bridge", "how many levels does the third bridge have?", "2 - upper level ,  lower level", "is it used for rail traffic as well?", "Yes - it has two elevated railway tracks"]}
{"conversations": ["who directed the first friday the 13th movie", "Sean S. Cunningham", "where was he born?", "New York City", "how did he start his career?", "Cunningham's first jobs after graduating from Stanford included managing theater companies such as New York's Lincoln Center as well as the Oregon Shakespeare Festival.", "where did this latter mentioned festival originate?", "Ashland, Oregon.", "who are some directors associated with this festival?", "Angus L. Bowmer, Jerry Turner and Henry Woronicz.", "who is the first mentioned director?", "He was the founder of the theatre mentioned.", "where is he from?", "Bellingham, Washington.", "what are some of his works?", "\"Love's Labor's Lost\" and \"Cymbeline\".", "how is the latter work criticised and interpreted?", "Lytton Strachey found it \"difficult to resist the conclusion that was getting bored himself.", "is this adapted in screen?", "Yes, in 1913.", "what are some references it has in our culture?", "The first two lines of a song are quoted by Virginia Woolf in \"Mrs. Dalloway\" by the two main characters Clarissa and Septimus Smith."]}
{"conversations": ["who does the voice of marceline on adventure time", "Olivia Olson", "where is she from?", "Los Angeles, California", "how did she begin her profession?", "Singing the song \"All I Want for Christmas Is You", "who wrote this song?", "Mariah Carey", "how did this song perform in charts?", "No. 6 on the \"Billboard\"", "who is the aforesaid person who wrote it?", "An American singer-songwriter and actress.", "where was she from?", "Huntington, New York", "where did she study?", "Harborfields High School in Greenlawn, New York", "how was her childhood like?", "Most of the time she was home alone and began singing at the age of three, often imitating  Verdi's opera \"Rigoletto\" in Italian.", "is she part of any philanthropic activity?", "Yes. She is associated with the Fresh Air Fund.,Ambassador of the World Hunger Relief Movement. name a few", "what are some songs she is famous for?", "One Sweet Day, All I Want for Christmas Is You", "what is her style of music?", "She uses  electronic instruments such as drum machines, keyboards and synthesizers.Many  songs contain piano-driven melodies"]}
{"conversations": ["which of the following is not among the practices of jainism", "Violence, attachment, sensual pleasures, lie and possessiveness are some of them.", "and which are the practices?", "Jains take five main vows: “ahiṃsā”, “satya”, “asteya”, “brahmacharya” and “aparigraha\".", "when did jainism begin?", "Historians date it to 8th or 7th century BCE.", "who is the leader?", "Rishabhanatha", "what are the beliefs?", "It is transtheistic and forecasts that the universe evolves without violating the law of substance dualism, auto executed through the middle ground between the principles of parallelism and interactionism.", "do jains fast?", "They fast particularly during festivals and it is  practiced according to one's ability.", "what food do they eat?", "The practice of non-violence towards all living beings has led to them to follow vegetarian diet.", "and what are they not allowed to eat?", "Eggs, root vegetables such as potatoes, onions, and garlic are some of the food avoided.", "which symbols are used by them?", "\"Swastika\", \"Om\" and \"Ashtamangala\".", "which symbols are used by them?", "\"Swastika\", \"Om\" and \"Ashtamangala\".", "do they have any pilgrimages?", "Yes, they do. \"Nagarparkar\" located at Pakistan  is one of them.", "do they practice meditation?", "Yes, they do.", "what rituals do they follow?", "The basic ritual followed is \"darsana\" of \"deva\", seeing of gods and goddesses..", "which are their different sects?", "It is divided into two major denominations, Digambara and Śvētāmbara.", "which statues do they have?", "They usually depict one of the twenty-four “tīrthaṅkaras”. “Parshvanatha”, “Rishabhanatha\" and “Mahāvīra\" are more popular. They are often seated in lotus position along with protector deities like Ambika.", "can you please name some of their temples", "\"The Palitana\", \"Shikharji \" and \"Jain Narayana\"."]}
{"conversations": ["how much did the blues brothers movie cost to make", "More than $17.5 million", "who directed it?", "John Landis", "who did its background score?", "By rhythm and blues (R&B), soul, and blues singers James Brown, Cab Calloway, Aretha Franklin, Ray Charles, Chaka Khan, and John Lee Hooker", "who starred in this film?", "John Belushi and Dan Aykroy", "what is this r&b refers to?", "Rhythm and blues,  is a genre of popular music that originated in African American communities in the 1940s", "and the next one of r&b?", "Soul music is a popular music genre that originated in the African American community throughout the United States in the 1950s and early 1960s", "you have mentioned a list of singers; is the first one related to any band?", "Yes. The Famous Flames", "is this band involved in any controversy?", "Yes when James Brown was one of the Hall of Fame's first charter members to be inducted", "did he first start the concept of concert?", "UNANSWERABLE", "what other works has he done in his career?", "He made public speeches in schools and continued to advocate the importance of education in school.", "can you name any other song used in the aforementioned film?", "UNANSWERABLE", "where was it filmed?", "Majorly in Chicago and few scenes in Wauconda, Illinois", "which honorable degrees belongs to the above mentioned third singer?", "Degrees from Harvard University and New York University ,Princeton University to name a few", "can you name some campus sites of the second university?", "YEs. Washington Square campus in  of Greenwich Village", "can you name any one famous residents of this village that you mentioned?", "UNANSWERABLE"]}
{"conversations": ["who are the members of the band u2", "Bono, the Edge, Adam Clayton, and Larry Mullen Jr.", "where is this band from ?", "Dublin.", "when was it created", "1976.", "name their first album ?", "\"Boy\".", "what was their musical style ?", "Rock.", "when was the above album released ?", "20 October 1980.", "who is the lead singer of the band ?", "Bono.", "what is he's full name ?", "Paul David Hewson.", "where was he born ?", "Dublin, Ireland.", "name some songs from this band ?", "\"Sunday Bloody Sunday\", \"Pride (In the Name of Love)\", \"With or Without You\", \"I Still Haven't Found What I'm Looking For\".", "the first song when was it released ?", "Released as a single on 21 March 1983.", "name some tours of this band ?", "The Innocence + Experience Tour , U2 360° Tour, the Vertigo tour and others."]}
{"conversations": ["movie about a boy who falls in love with his teacher", "The Boy Next Door.", "were the audience receptive on this film?", "No, it generally negative reviews from film critics.", "who was the writer?", "Isabelle Nuru Dayne and Barbara Curry.", "can you name a few actors who were cast in it?", "Jennifer Lopez, Ryan Guzman, and Ian Nelson, with John Corbett and Kristin Chenoweth.", "has the first actor mentioned above, worked in other films?", "Yes, \"Maid in Manhattan\" and \"Gigli\", to name a few.", "apart from acting, does this person have another career?", "Yes, she is a singer, dancer, fashion designer, producer, and businesswoman.", "how was the above movie, \"the boy...\", promoted?", "Lopez made her largest Hispanic press tour to date in Miami in promotion of \"The Boy Next Door\". She hoped that the film would appeal to Hispanic markets, due to featuring two Hispanic leads.", "who has been her inspiration?", "She was influenced by Tina Turner, James Brown, Michael Jackson, Madonna, Barbra Streisand, and Lady Gaga.", "what was the start of \"kristin's\" career?", "She competed in beauty pageants, winning the title of Miss OCU and was the second runner-up in the Miss Oklahoma pageant in 1991.", "is she married?", "UNANSWERABLE", "has she received any accolades for her movies?", "Yes, she received a star on the Hollywood Walk of Fame.", "has the any participant of the above pageant won the national title?", "Yes, 5 participants.", "do you know the years?", "No,", "who is the last person from the inspiration list above?", "Stefani Joanne Angelina Germanotta, known professionally as Lady Gaga, is an American singer, songwriter and actress."]}
{"conversations": ["where is the solar system located in our galaxy", "The Solar System, is located in the Milky Way's galactic habitable zone.", "what is the milky way?", "It is the galaxy that contains our Solar System.", "can you tell me the names of the stars that form a part of this galaxy?", "The Milky Way may contain ten billion white dwarfs, a billion neutron stars, and a hundred million stellar black holes.", "can this galaxy be seen from earth in the northern hemisphere?", "The Milky Way is visible from Earth as a hazy band of white light, some 30° wide, arching across the night sky.  As viewed from Earth, the visible region of the Milky Way's galactic plane occupies an area of the sky that includes 30 constellations.", "how would you describe its size?", "The Milky Way is the second-largest galaxy in the Local Group with its stellar disk approximately in diameter and, on average, approximately thick. The Milky Way is approximately 890 billion times the mass of the Sun.", "name the structural parts of this.", "UNANSWERABLE", "what is the estimated age of this galaxy?", "Several individual stars have been found in the Milky Way's halo with measured ages very close to the 13.80-billion-year age of the Universe.", "what are the names of the intellects who studied and observed this cluster of stars?", "Aristotle, Anaxagoras, Democritus", "what is the professional background of the first person mentioned?", "He  was a Greek philosopher and polymath during the Classical period in Ancient Greece.", "which period did he exist?", "384–322 BC", "what was his contribution as an intellect?", "Aristotle's work encompassed virtually all facets of intellectual inquiry. Aristotle makes philosophy in the broad sense coextensive with reasoning, which he also would describe as \"science\".", "were any of his original writings recovered?", "The works of Aristotle that have survived from antiquity through medieval manuscript transmission are collected in the Corpus Aristotelicum. These texts, as opposed to Aristotle's lost works, are technical philosophical treatises from within Aristotle's school.", "what is the professional background of the second person mentioned amongst the intellects?", "He was a Pre-Socratic Greek philosopher.", "what were some of his notable contributions?", "He also gave a number of novel scientific accounts of natural phenomena. He deduced a correct explanation for eclipses and described the Sun as a fiery mass larger than the Peloponnese, as well as attempting to explain rainbows and meteors."]}
{"conversations": ["what is referred as ride me to hell?", "It is the third episode of the of the American animated television series \"Ugly Americans\", and the seventeenth overall episode of the series", "when was it aired?", "July 14, 2011", "who directed it?", "Aaron Augenblick and series creator Devin Clark", "any character from it?", "Grimes, Mark Lilly , Callie Maggotbone, Randall", "where was this episode aired?", "United States", "where is the former director from?", "Wilmington, Delaware", "can you mention any other work of his?", "Superjail!, Wonder Showzen and Golden Age", "has the first show been broadcasted internationally?", "It has been broadcast in Canada", "is it a film or tv series?", "Television series", "and the second work?", "Television series", "what's its genre?", "Sketch comedy", "what do you mean by this term?", "It comprises a series of short scenes or vignettes, called \"sketches\", commonly between one and ten minutes long", "how is it related to festivals?", "The growing sketch comedy scene has precipitated the development of sketch comedy festivals in cities all around North America", "and films?", "Several sketch films have been made like  \"If You Don't Stop It... You'll Go Blind\" and the sequel \"Can I Do It... 'Til I Need Glasses?\"", "did this sequel face any court case?", "Robin Williams and his management took legal action against producer Mike Callie and the film distributor for \"false and misleading advertising,\""]}
{"conversations": ["when does the next alice in wonderland come out", "December 7, 2012", "what is the genre of this movie?", "Live-action/animated, dark fantasy,  adventure", "what does the second term mean?", "It is a subgenre of fantasy literary, artistic, and cinematic works that incorporate darker and frightening themes of fantasy", "when did this genre originate?", "UNANSWERABLE", "what is the movie about?", "A nineteen-year-old Alice Kingsleigh, who is told that she can restore the White Queen to her throne, with the help of the Mad Hatter. She is the only one who can slay the Jabberwocky, a dragon-like creature that is controlled by the Red Queen and terrorizes Underland's inhabitants. In this situation, Alice fights against the Red Queen to protect the world", "who plays the protagonist?", "Mia  Wasikowska", "when was movie released?", "February 25, 2010", "does it have any sequel?", "Yes, there are many sequels", "by whom is this directed?", "Tim Burton", "does he have any projects which are yet to be completed?", "In 2012, Shane Acker confirmed that Burton would work with Valve to create his next animated feature film, \"Deep\", since  then, there have been no further mentions of \"Deep\"", "has he received any awards?", "Yes, National Board of Review Awards, Chicago Film Critics Association Awards"]}
{"conversations": ["who was don bradman?", "He was an Australian international cricketer.", "where was he born?", "Cootamundra, New South Wales (NSW).", "what is the climate like in the latter?", "Arid to semi arid climate with rainfall.", "what languages are spoken here?", "English, Mandarin, Arabic, Cantonese, Vietnamese and Greek.", "where is the fourth one commonly spoken?", "Guangzhou and its surrounding area in Southeastern China.", "was this place a center of any revolution?", "Yes, the Uprisings of 1895 and 1911.", "does it have a twin town ?", "Yes.", "people of which ethnic groups can be found here?", "Han Chinese.", "can you name any dynasty belonging to this ethnicity?", "The Han dynasty.", "what is a famous cuisine of this race?", "Spicy food to dim sum and fresh seafood.", "what is the second dish?", "It has a very broad range of flavors, textures, cooking styles and ingredients, and can be classified into regular items, seasonal offerings, weekly specials, banquet dishes, holiday dishes, house signature dishes, travel-friendly, as well as breakfast or lunch foods and late night snacks.", "where does the name originate from?", "The Song Dynasty."]}
{"conversations": ["what tissue types form the wall of the ureter", "urothelial cells", "what is ureter?", "The ureters are tubes made of smooth muscle that propel urine from the kidneys to the urinary bladder.", "what is the size of this tube?", "The ureters are between 1.5 - 6 mm in diameter, and surrounded by a layer of smooth muscle for 1 - 2 cm near their ends just before they enter the bladder.", "can you name one function of this bladder?", "Urine, excreted by the kidneys, collects in the bladder", "do mammals also have this bladder?", "Yes, all mammals have a urinary bladder", "is it also prone to any deadly disease?", "Yes, bladder cancer", "does the tube also have anything to do with the supply of blood?", "Yes, the arteries which supply the ureter vary along its course", "do stones also form here?", "Yes, a kidney stone can move from the kidney and become lodged inside the ureter", "and what causes this stone to form in this tube?", "UNANSWERABLE", "can these tubes also get damaged?", "Yes, Injuries to the ureter can occur after penetrating abdominal injuries, and injuries at high speeds followed by an abrupt stop", "what is the function of the abdomen?", "Functionally, the human abdomen is where most of the digestive tract is placed and so most of the absorption and digestion of food occurs here", "are there any type of exercises for this part of the body?", "Pilates, yoga, T'ai chi, and jogging", "is this part also present in other animals?", "Yes"]}
{"conversations": ["gerard butler sing in phantom of the opera", "Butler had no professional singing experience and had only taken four voice lessons before singing \"The Music of the Night\" for Lloyd Webber.", "who were the actors in the film?", "Gerard Butler, Emmy Rossum, Patrick Wilson, Miranda Richardson, Minnie Driver, and Jennifer Ellison.", "where was it filmed?", "Pinewood Studios", "which other films were shot in this studio?", "\"James Bond\" and \"Carry On\"", "where is it located?", "Iver Heath, Buckinghamshire.", "who was the protagonist of the former movie?", "UNANSWERABLE", "what other interests did the second actor mentioned earlier had apart from acting?", "She is also a singer and songwriter.", "which songs has he written?", "Rossum released her debut album, \"Inside Out\". She also released a Christmas EP the same year, titled \"Carol of the Bells\". In 2013, she released a follow-up album called \"Sentimental Journey\".", "did she do charity work?", "Rossum was a YouthAIDS ambassador and was signed as the spokesperson for Pinkitude, an apparel line inspired by the Pink Panther character, to help raise breast cancer awareness.", "what is the first organization about?", "It is an international nongovernmental, nonprofit education, funding, and health initiative of Population Services International (PSI) that provides humanitarian assistance and brings global awareness to the proliferation of HIV/AIDS", "who is its founder?", "It is an initiative of Population Services International.", "what are the symptoms of the disease that they spread awareness about?", "UNANSWERABLE"]}
{"conversations": ["when was goldilocks and the three bears written", "In 1837.", "what kind of a work is it?", "It is a British 19th-century fairy tale story.", "who is the composer?", "It is a story written by British writer and poet Robert Southey.", "what is the storyline?", "In one version a littele girl who enters the forest home of three bachelor bears whilst they are away. She sits in their chairs, eats some of their porridge, and sleeps in one of their beds. When the bears return and discover her, she wakes up, jumps out of the window, and is never seen again.", "what were the various interpretations this work received?", "The original version of the tale tells of a badly-behaved old woman, the second version replaced the old woman with a little girl named Goldilocks, the third version replaced the original bear trio with Papa Bear, Mama Bear and Baby Bear.", "what can you tell me about his other works?", "\"The Annotated Classic Fairy Tales\",  \"The Tale of the Three Little Pigs\", \"The Uses of Enchantment\".", "was he active in  politics?", "UNANSWERABLE", "what all honors has he received?", "None, But It was well received and most popular fairy tales in the English language.", "what is the structure of his third work mentioned above?", "The first, \"A Pocketful of Magic,\" outlines thoughts on the value of fairy tales for children. The second part, \"In Fairy Land,\" presents psychoanalytical readings of several popular fairy tales.", "how was it received ?", "It has been cited as an influence in many subsequent works that utilise fairy tales and as the inspiration for 1986 musical."]}
{"conversations": ["who wrote the hallelujah chorus from handel messiah", "George Frideric Handel", "what is it?", "It is an English-language oratorio, with a scriptural text compiled by Charles Jennens from the King James Bible, and from the Coverdale Psalter, the version of the \"Psalms\" included with the \"Book of Common Prayer\".", "when was it composed?", "1741", "how many parts does it have?", "3 parts", "was it ever recorded?", "In 1926", "by whom?", "Sir Henry Wood", "on what was it recorded?", "UNANSWERABLE", "do you know the full name of the knight you just mentioned?", "Sir Henry Joseph Wood", "were there live performances of the original work?", "No, they are based on one of three 20th-century performing editions", "where was the writer born?", "Oxford Street, London", "name a few of his other works", "The Lobkowicz Palace, Organ concertos Op. 4 and Op. 7 are few to mention", "what kind of education did he receive?", "Musical education", "where was it at?", "In Weissenfels", "what is his legacy?", "His English oratorios, such as \"Messiah\" and \"Solomon\", the coronation anthems, and various other of his works"]}
{"conversations": ["who wrote the lyrics for the grateful dead", "Robert C. Christie Hunter", "where is he from?", "San Luis Obispo, California", "what are his famous works?", "\"Dark Star\", \"Ripple\", \"Truckin'\", \"China Cat Sunflower\"", "what is the first one about?", "A song released as a single by the Grateful Dead on Warner Bros", "who composed the song?", "Jerry Garcia", "when was it released?", "1968", "was the song performed anywhere?", "Yes, San Francisco's Fillmore West, the Capitol Theater in Port Chester, NY, the Fillmore East", "did the composer start any band?", "Yes, he was a founding member of the Grateful Dead", "when was the band formed?", "1965", "what kind of lifestyle did he follow?", "Because of their public profile, Garcia and his collaborators were occasionally singled out in the American war on drugs."]}
{"conversations": ["i'm just a girl by no doubt", "\"Just a Girl\" is a song by American band No Doubt.", "has anyone sang a cover of it?", "Yes, American country duo Bomshel,  Japanese singer-songwriter Kaela Kimura", "when was the original song released?", "September 21, 1995", "who are the members of the afore-mentioned band?", "The band consists of vocalist Gwen Stefani, guitarist Tom Dumont, bassist Tony Kanal, and drummer Adrian Young.", "what was the vocalists debut album or song?", "Her debut studio album was \"Love. Angel. Music. Baby.\"", "what are some places that she has toured in?", "UNANSWERABLE", "has she acted in any movies?", "She made her film debut playing Jean Harlow in Martin Scorsese's \"The Aviator\"", "who is the second person mentioned here?", "Martin Charles Scorsese  is an American film director, producer, screenwriter, and actor.", "are there any frame and motion techniques that he made popular?", "Yes, he is known for his frequent use of slow motion, freeze frames in films", "what are some projects he has started for improving cinema?", "Scorsese established the World Cinema Project with the mission, to preserve and present marginalized and infrequently screened films from regions generally ill-equipped to preserve their own cinema history.", "when was this project established?", "2007", "who exactly is the female character from his movie mentioned earlier", "Jean Harlow was an American actress and sex symbol.", "what other films has she been portrayed in?", "In 1965, two films about Jean Harlow were released, both titled \"Harlow\".", "what was the cause of her death?", "Harlow began to complain of illness. Her symptoms—fatigue, nausea, fluid retention and abdominal pain— had been ill during the previous year with a severe sunburn and influenza."]}
{"conversations": ["where does the river welland start and finish", "The river rises in the Hothorpe Hills, at Sibbertoft in Northamptonshire, then flows generally northeast to Market Harborough, Stamford and Spalding, to reach The Wash near Fosdyke", "what is the total length of this watercourse?", "UNANSWERABLE", "what are some of its tributaries?", "UNANSWERABLE", "what are the names of the fishes found in the watercourse?", "Wild brown trout, chub and perch", "apart from the source and its mouth, what are some of the places this watercourse passes through?", "It issues at Spring Croft, Church Street. Sibbertoft sits astride one of the principal watersheds in England. Within , the small stream forms the border between Northamptonshire and Leicestershire.", "what are some of the birds or mammals found near the watercourse?", "Swans and geese", "with reference to the mouth of the river which you mentioned earlier, what is its water temperature?", "UNANSWERABLE", "how can one navigate in this river?", "The river as far as Stamford was used by the Romans for navigation, as it formed part of a system including the Car Dyke, which ran along the western edge of the Fens and crossed the river near the modern Folly River. Navigation to Stamford was improved by the canal.", "are there any bridges built across this watercourse?", "Ashlar bridge", "what are the names of those famous people who are involved in any construction activities along this watercourse?", "David Cecil, Daniel Wigmore"]}
{"conversations": ["what does tim mcgraw think of taylor swift's song", "Swift wrote \"Tim McGraw\" during her freshman year of high school, knowing that she and her senior boyfriend would break up at the end of the year when he left for college.Lyrically, the track lists items in order to associate a past relationship, one of them being country artist Tim McGraw's music.", "who has sang this song?", "Taylor Swift.", "who composed the music for it?", "The song was written by Swift and Liz Rose, and produced by Nathan Chapman.", "who is the second person mentioned above?", "An American country music songwriter, best known for her work with American singer-songwriter Taylor Swift.", "was a video made for this song?", "Yes", "who directed the video?", "Trey Fanjoy.", "what genre of music does this singer contribute to?", "Pop, synth-pop, country, country pop and rock.", "who played a major influence on her decision to get into music?", "Shania Twain", "can you name some advertisements that swift has appeared in?", "Verizon Wireless' Mobile Music campaign; a CoverGirl spokesmodel", "what is the latter?", "CoverGirl is an American cosmetics brand", "who is the publication house?", "The authors and publishers of the 2006 novel \"Cathy's Book\" agreed with Procter & Gamble to include references to the makeup line in exchange for promoting the book on its self-care BeingGirl website."]}
{"conversations": ["the culture of the aztec empire was based around which geographic form", "Central Mexico", "this culture became popular between which time period?", "Post-classic period from 1300 to 1521", "which language was spoken by the people of that time?", "Nahuatl language", "what was the reason for the population decline during that time?", "After the arrival of the Europeans in Mexico and the conquest, indigenous populations declined significantly.", "when did they arrive?", "1519–1521", "is human sacrificing a part of the culture mentioned above?", "Yes, death was instrumental in the perpetuation of creation, and gods and humans alike had the responsibility of sacrificing themselves in order to allow life to continue.", "how is the climate of the above mentioned country?", "Cooler temperatures during the winter months  in the north while temperatures are fairly constant year round in the south.", "which ethnicities contributes to the country's population?", "Mestizos, Yucantan, Quintana Roo, Campeche, Oaxaca etc", "what is the most popular sport of the place mentioned?", "Football", "which are the famous tourist spots there?", "Resort town of Cancún, beach town of Playa del Carmen, ecological parks of Xcaret and Xel-Ha etc"]}
{"conversations": ["what is into the groove?", "\"Into the Groove\" is a song", "who sang it?", "American singer Madonna", "who composed it?", "Stephen Bray", "was it ever performed live?", "It was performed during The Virgin Tour in 1985", "how was this tour received by the critics?", "The tour received generally mixed reviews from critics", "can you name a place that this tour covered?", "Tampa and Orlando, Florida", "who performed in it?", "Beastie Boys, DJ Rick Rubin", "was the latter part of any band?", "Rick\" Rubin is a DJ and American record producer and former co-president of Columbia Records.", "where was he born?", "In Long Beach, New York", "what criticisms did he have to face?", "Matt Bellamy of Muse criticized Rubin stating that the band would \"like to thank Rick Rubin for teaching us how not to produce.\"", "did he also receive praise?", "He shows them how to make it better, and he gets more honest and exciting performances out of people than anyone."]}
{"conversations": ["how many states in india ruling by bjp", "12", "what is the full form of the above party ?", "Bharatiya Janata Party", "what was its earlier name ?", "Bharatiya Jana Sangh, popularly known as the Jana Sangh", "when was it formed ?", "1951", "by whom ?", "Syama Prasad Mukherjee", "name some of its chief ministers ?", "UNANSWERABLE", "who is the above person ?", "He was an Indian politician, barrister and academician, who served as the Minister for Industry and Supply in Prime Minister Jawaharlal Nehru's cabinet", "what was his opinion on special status of jammu and kashmir ?", "He was strongly opposed to Article 370, seeing it as a threat to national unity", "how did he die ?", "23 June, 1953", "what legacy he left behind ?", "Shyama Prasad Mukherji College of University of Delhi was established in 1969 in his memory,  the Ahmedabad Municipal Corporation named a bridge after Mukherjee,  the Municipal Corporation of Delhi's (MCD) newly constructed, the tallest building in Delhi, was named the Doctor Syama Prasad Mukherjee Civic Centre, a flyover at Mathikere in Bangalore City Limits was inaugurated and named the Dr Syamaprasad Mukherjee Flyover", "the party first mentioned above what are its social policies ?", "The official philosophy of the BJP is \"Integral humanism,\" a philosophy first formulated by Deendayal Upadhyaya in 1965, who described it as advocating an \"indigenous economic model that puts the human being at center stage.\"", "what are its foreign policy ?", "The Vajpayee government's foreign policy in many ways represented a radical shift from BJP orthodoxy, while maintaining some aspects of it"]}
{"conversations": ["when did construction start on the twin towers", "August 1968", "what was the actual plan behind it?", "David Rockefeller suggested that the Port Authority would be a logical choice for taking on the project. Rockefeller argued that the Trade Center would provide great benefits in facilitating and increasing volume of international commerce coming through the Port of New York and New Jersey.", "who is this aforesaid person?", "An American banker who served as chairman and chief executive of Chase Manhattan Corporation.", "where was he born?", "New York City, New York.", "where was he educated?", "Harvard University, London School of Economics (LSE)", "what happened to the former university during the 20th century?", "The reputation grew, rapid enrollment growth continued as new graduate schools were begun and the undergraduate college expanded; creative scholarships were reinvigorated", "where is this university located?", "Cambridge, Massachusetts.", "what is its ranking?", "In 2019, it was ranked first worldwide", "what are its effects on popular culture?", "The perception of Harvard as a center of either elite achievement, or elitist privilege, has made it a frequent literary and cinematic backdrop.", "what are some films related to it?", "UNANSWERABLE", "where is the latter mentioned school located?", "London, England", "what are some controversies related to it?", "In February 2011, LSE had to face the consequences of matriculating one of Muammar Gaddafi's sons while accepting a £1.5m donation to the university from his family.", "when was it founded?", "1895", "what is the mascot?", "Beaver"]}
{"conversations": ["what movie is count on me by bruno mars in", "UNANSWERABLE", "is the song part of an album?", "Yes, it is from \"Doo-Wops & Hooligans\" album", "how well did it perform commercially?", "It spent two weeks at its peak position of 13,  it was also awarded a platinum plaque by Recorded Music NZ", "was it used in any other media?", "The recording is part of the Belgian/American animated film and the TV show \"Suburgatory\",  it is featured in the film in 2017 and on a commercial for Ferrero SpA", "what is the tv show about?", "The series follows George Altman, a single father who decides to get away from New York City to the suburbs so he can give his teenage daughter, Tessa, a better life.", "who plays the role of tessa in the show?", "Jane Levy", "who is the broadcaster of the show?", "ABC", "what is the rating of the show?", "3.3 among the 18–49 demos with 9.81 million viewers tuning in", "who composed its theme music?", "Jared Faber and Emily Kapnek", "when did it premiere?", "From September 28, 2011 to May 14, 2014"]}
{"conversations": ["rna consists of how many chains of subunits", "Small RNAs mainly include 5.8S ribosomal RNA (rRNA), 5S rRNA, transfer RNA (tRNA), microRNA (miRNA), small interfering RNA (siRNA), small nucleolar RNA (snoRNAs), Piwi-interacting RNA (piRNA), tRNA-derived small RNA (tsRNA) and small rDNA-derived RNA (srRNA)", "are they also double-stranded?", "Yes, Double-stranded RNA is RNA with two complementary strands", "how is it different from dna?", "Analysis of mRNA, tRNA, rRNA, snRNAs, and other non-coding RNAs  has revealed that self-complementary sequences that allow parts of the RNA to fold and pair with itself to form double helices and they are highly structured. Unlike DNA, their structures do not consist of long double helices, but rather collections of short helices packed together into structures akin to proteins", "what is the function of the non-coding ones?", "Silencing of blocks of chromatin via recruitment of Polycomb complex so that messenger RNA could not be transcribed from them", "who discovered it?", "Friedrich Miescher", "what is its role in alzheimer?", "UNANSWERABLE", "what is its double-stranded virus classified into?", "The phylum \"Duplornaviricota\" and the class \"Duplopiviricetes\", which is in the phylum \"Pisuviricota\"", "what is anti-viral in it?", "Dicer", "is this anti-viral found in insect?", "Yes, insects can use it  as potent anntiviral", "what is its therapeutic applications?", "It is used  to produce siRNA therapeutically would be the specificity and diversity of targets it can affect compared to what is currently being used such as antibodies or small molecular inhibitors"]}
{"conversations": ["when does clark meet lois lane in smallville", "Season 4", "who played the above mentioned characters?", "Tom Welling and Erica Durance, respectively.", "what features were given to the second mentioned character, when designing the character?", "She has \"sophisticated, worldly experience\", considered to be more of an adult than the rest of the cast, has a lot of \"nervous energy\" from trying to \"find herself\".", "who directed this series?", "UNANSWERABLE", "how did the first mentioned actor, debut in the entertainment industry?", "Modeling for a Tommy Hilfiger campaign.", "can you name any other series that he has worked in?", "\"Judging Amy\", \"Special Unit 2\", \"Undeclared\".", "can you also mention his directorial works?", "\"Smallville\" episodes \"Fragile\"; \"Hydro\", \"Apocalypse\" to name a few.", "what was the role of the character we were discussing earlier?", "She comes to Smallville investigating the death of her cousin Chloe Sullivan (Allison Mack).", "where is the second mentioned actor from?", "Putnam Valley, New York", "did she receive any awards for her work?", "UNANSWERABLE"]}
{"conversations": ["who played the mummy in the old movies", "Boris Karloff", "has he also acted in any other film?", "Yes - Frankenstein (1931), Bride of Frankenstein (1935) and Son of Frankenstein (1939).", "where is he from?", "Surrey (now London), England.", "what is the 1999 version of the film about?", "The film follows adventurer Rick O'Connell as he travels to Hamunaptra, the City of the Dead, with a librarian and her older brother, where they accidentally awaken Imhotep, a cursed high priest from the reign of the Pharaoh Seti I of 1290 B.C.", "what is the genre of this film?", "Action horror film", "is the place where the character travels to a real place?", "No -It is a fictional Egyptian city in the film.", "who released this film?", "UNANSWERABLE", "who is the director of this film?", "Stephen Sommers.", "who was he?", "American film director and screenwriter", "can you name some other films he has directed?", "The Mummy Returns (2001) ; Van Helsing (2004) ; The Adventures of Huck Finn (1993) ; The Jungle Book (1994)", "is the 1999 version a continuation of the the 1932 version?", "No, it is a remake of the 1932 film", "who are the special effects of the film attributed to?", "John Andrew Berton, Jr. the supervisor of  Industrial Light & Magic's Visual Effects", "who is the main character in this film?", "Rick O'Connell", "who plays the role of the mummy in the movie?", "Arnold Vosloo", "are mummies just a fictional character?", "Imhotep is loosely inspired by the historical figure Imhotep, a noted polymath and counselor to the Pharaoh Djoser in the 27th century BC."]}
{"conversations": ["what is the regina monologues?", "Fourth episode of \"The Simpsons\"' fifteenth season.", "when was it released?", "November 23, 2003", "who directed it?", "Mark Kirkland", "who are the characters in that?", "Mr. Burns, Bart, Milhouse, Marge, Homer, Abraham Simpson, etc.", "what is that episode's story all about, in short?", "Simpson family travel to the United Kingdom for vacation and there, they meet several celebrities. Later, Homer is arrested and locked for accidentally crashing into the Queen's carriage, meanwhile, Abraham Simpson journeys to find Edwina.", "what celebrities do they meet in that episode?", "Tony Blair, Evan Marriott, Ian McKellen and J. K. Rowling", "did all the above people lend their voices for this show speaking in terms of reality?", "Yes", "who is that second celebrity mentioned?", "UNANSWERABLE", "who is that third celebrity mentioned?", "An English actor.", "can you name some of his tv shows/films he has appeared in?", "Richard III, Gods and Monsters, X-Men films, and The Lord of the Rings and The Hobbit trilogies.", "name some of his charitable works.", "Appeared in a series of TV advertisements to support Age UK and umpired in March 2011 for a charity cricket match.", "what rights has he campaigned for?", "LGBT rights", "what is his spouse's name?", "He was gay"]}
{"conversations": ["what factor limits the number of eclipses each year", "The alignment of the Sun, Moon and Earth.", "what is this phenomena ?", "A solar eclipse occurs when a portion of the Earth is engulfed in a shadow cast by the Moon which fully or partially blocks sunlight.", "what are the different types of it ?", "There are four types of solar eclipses.", "what is their frequency ?", "Between two and five solar eclipses occur every year.", "what is their duration ?", "The longest eclipse that has been calculated thus far is 7 minutes 29 seconds.", "does it follow any path ?", "Yes, the Moon's umbra moves rapidly from west to east across the Earth.", "talk about the planet you mentioned above ?", "It is the third planet from the Sun and the only astronomical object known to harbor life.", "talk about its surface ?", "Of the total surface area of Earth about 70.8%, is below sea level an/d covered by ocean water. The pedosphere is the outermost layer of Earth's continental surface and is composed of soil and subject to soil formation processes.", "how is its atmosphere ?", "It is composed of 78.084% nitrogen, 20.946% oxygen, 0.934% argon, and trace amounts of carbon dioxide and other gaseous molecules.", "is there water on this planet ?", "Yes,"]}
{"conversations": ["who was the king of macedonia who built an empire that stretched to india", "Alexander the Great", "where is the above ancient kingdom located?", "On the periphery of Archaic and Classical Greece, and later the dominant state of Hellenistic Greece.", "what is the origin of its name?", "The name Macedonia comes from the ethnonym Μακεδόνες , which itself is derived from the ancient Greek adjective μακεδνός, meaning \"tall, slim\", also the name of a people related to the Dorians, and possibly descriptive of Ancient Macedonians", "who was the leader here before the above mentioned king?", "The Argead king, PhilipII", "which language was spoken here?", "Koine Greek, the \"lingua franca\" of late Classical and Hellenistic Greece, and the native Macedonian language was either a dialect of Greek  similar to Thessalian Greek and Northwestern Greek, or a language closely related to Greek", "where was the aforementioned great king from?", "Ancient Greek kingdom of Macedon", "which city did he find?", "The first, and greatest, was Alexandria in Egypt", "did he fund any temple?", "Yes, the temple of Athena Polias and the temple of Zeus Bottiaios", "can you state the geographic location of the city you mentioned previously?", "Alexandria is located in the country of Egypt, on the southern coast of the Mediterranean.", "which religion is followed here?", "Christianity, Judaism, Islam", "is there any place here which is worshipped?", "Yes, among the places of worship, there are Muslim mosques. Coptic Christian churches are most common churches .There are also other Christian churches as: Greek, Latin and Armenian", "regarding the great king we were talking previously; do you know about his ancestry?", "Argead dynasty", "was he sent to exile?", "Yes, Alexander fled Macedon", "regarding the ancient kingdom above; was any innovation made that time?", "The rotary-operated olive press and Mold-pressed glass"]}
{"conversations": ["who were king and queen of england during ww2", "George VI and Elizabeth Bowes-Lyon", "who is the current leader of this kingdom?", "Queen Elizabeth II.", "how the above mentioned king die?", "Coronary thrombosis.", "what is this disease?", "Formation of a blood clot inside a blood vessel of the heart.", "could you let me know the children names of the female leader mentioned above?", "Charles, Anne, Prince Andrew , and Prince Edward.", "what are the responsibilities carried out by the first name mentioned above?", "As Prince of Wales, Charles undertakes official duties on behalf of the Queen and the Commonwealth realms. He officiates at investitures and attends the funerals of foreign dignitaries.", "does he have children from his second marriage?", "UNANSWERABLE", "any children from his first marriage, their names?", "Yes, Prince William and Prince Harry.", "who has the latter married?", "UNANSWERABLE", "what sports did the prince who we were chatting about earlier, play?", "Polo and fishing.", "what is the origin of the first sport mentioned above?", "It began as a simple game played by mounted Iranian and Turkic nomads in Central Asia, with the current form originating in Iran.", "how many players make a team?", "In beach and snow polo ,each team has three members each and in cowboy polo there are five members in each team.", "in ancient times, what material was the ball that was used for this aport, made of?", "Bamboo, leather covered cork, hard rubber, and willow root."]}
{"conversations": ["oxygen (o2) is formed in photosynthesis as a direct result of", "Light-driven splitting of water during oxygenic photosynthesis", "how does lavoisier contribute?", "He conducted the first adequate quantitative experiments on oxidation and gave the first correct explanation of how combustion works", "what are its isotopes?", "They are variants of a particular chemical element which differ in neutron number, and consequently in nucleon number", "what are its allotropes?", "UNANSWERABLE", "how is it stored?", "UNANSWERABLE", "is it toxic?", "No it is not toxic", "what are its industrial uses?", "UNANSWERABLE", "which scientist was involved in early experiments related to it?", "It was solated by Michael Sendivogius before 1604, but it is commonly believed that the element was discovered independently by Carl Wilhelm Scheele", "which theory was proposed by the second scientist?", "Theory of phlogiston", "which are some of the works of the first scientist?", "He developed ways of purification and creation of various acids, metals and other chemical compounds"]}
{"conversations": ["when was the last time a hurricane hit tampa bay area", "1921", "which areas did it effected?", "Cuba, Pasco County, Manatee County and Sarasota County.", "who ruled the first place?", "Communist Party of Cuba", "which ethnic groups immigrated here?", "Afro-Cubans", "what is one of the principles of its communist party?", "It entails democratic and open discussion of policy issues within the party, followed by the requirement of total unity in upholding the agreed policies.", "when was it founded?", "3 October 1965", "what arrangements were made before the 1921 hurricane?", "Storm warnings were issued eastward from mouth of the Mississippi River and along the east coast of Florida.", "which states surround borders the river you just mentioned?", "States of Minnesota, Wisconsin, Iowa, Illinois, Missouri and Kentucky.", "what is the significance of its name?", "The word Mississippi itself comes from , the French rendering of the Anishinaabe (Ojibwe or Algonquin) name for the river.", "which species can be found here?", "several species of turtles, American alligator and aquatic amphibians."]}
{"conversations": ["full name of current prime minister of india", "Narendra Damodardas Modi", "when did he become the prime minister?", "In 2014", "what has been his policies towards the environment?", "Cancelled the Requirement of clearance  from NBA for projects close to wildlife, rRelaxed or Abolished regulations related to Industrial Activity & Modi lifted a moratorium on new industrial activity in the most polluted areas in the countries.", "did he win another term after the first?", "Yes. By securing 353 seats in the Lok Sabha with the BJP alone winning 303 seats.", "what political party is he affiliated with?", "Modi is a member of the Bharatiya Janata Party (BJP)", "has this party ever been accused of any violence?", "UNANSWERABLE", "when was his party established?", "In 1980", "by whom?", "By the Bharatiya Jana Sangh,", "is mr.modi married?", "Yes. To Jashodaben", "before becoming the pm , what other careers did he have?", "He was the Chief Minister of Gujarat", "did this place face any riot?", "Yes. The Godhra Riots", "why did this take place?", "A Hindu Religious ceremony at the site of the Demolished Babri Masjid and the Demolishing itself was the reason for this.", "how did this masjid get its name?", "The name was derived from Bābarī Masjid meaning Mosque of Babur", "is there any story associated with this?", "Not Particularly. However, it has been a focus of dispute between the Hindu and Muslim communities since the 18th century.", "when was it demolished?", "In 1992"]}
{"conversations": ["who wrote the music and lyrics to the song kinky boots", "Cyndi Lauper", "who is the singer?", "Cyndi Lauper", "whose story does the musical convey?", "Based on the 2005 British film \"Kinky Boots\", the musical tells the story of Charlie Price.", "when was its release?", "2005", "what was the response it received?", "The film received mixed reviews on release, with critics decrying the \"formulaic Britcom plot\"", "what can you tell me about the songwriter?", "She is an American singer, songwriter, actress and activist; her career has spanned over 40 years.", "when did she begin her career?", "1978", "which is her debut work?", "\"She's So Unusual\"", "who released the album?", "Portrait Records", "how many singles were released from the album?", "3", "what was the critical response it received?", "\"She's So Unusual\" was voted the eleventh best album of the year in \"The Village Voice\"s annual Pazz & Jop critics poll for 1984.", "did she receive any awards?", "Yes, she has won awards at the Grammys, Emmys, Tonys, the New York's Outer Critics Circle"]}
{"conversations": ["what is sinestro corps war?", "An American comic book crossover event", "who is the writer?", "Geoff Johns and Dave Gibbons", "who are the characters?", "Hal Jordan, Kyle Rayner, John Stewart and Guy Gardner, and the rest of the Green Lantern Corps", "what are some of the other works of the second writer you mentioned?", "\"The Trials of Nasty Tales\", \"Watchmen\", \"For the Man Who Has Everything\"", "has he worked on anything other than comics?", "Yes, he did the cover art of album \"The Madness\", he served as a consultant on the film \"Watchmen\", background art for the 1994 computer game \"Beneath a Steel Sky\"", "who developed the game you just mentioned?", "British developer Revolution Software", "did it perform well in the market?", "Yes, Eurogamer's Simon Parkin later summarized that it \"sold extremely well\", with lifetime sales between 300,000 and 400,000 units by July 2009", "what is the genre of the computer game?", "cyberpunk, science fiction, point-and-click, adventure game", "does the last genre you mentioned have subgenres?", "Yes, Point-and-click adventure games, Graphic adventures, Puzzle adventure games", "has it revolutionized the japanese games?", "Yes, due to differences in computer hardware, language, and culture, development of adventure games took a different course in Japan compared to Western markets.", "what powers does the first character we talked about has?", "As a Green Lantern, Hal Jordan is semi-invulnerable, capable of projecting hard-light constructions, flight, and utilizing various other abilities through his power ring which are only limited by his imagination and willpower.", "how did he get his fictional name that you just mentioned?", "UNANSWERABLE"]}
{"conversations": ["who is tyrion lannister?", "A fictional character in the \"A Song of Ice and Fire\".", "who created this character?", "George R. R. Martin", "can you describe the character in brief?", "He is a prominent point of view character in the series, having the most viewpoint chapters (49 chapters) in the first five published novels.", "did he appear in the tele series versions as well?", "Yes, in Game of Thrones.", "who plays his character in it?", "UNANSWERABLE", "did this character win any awards?", "The actor won a  Golden Globe Award.", "which tv channel adapted the author's books for a tele series?", "HBO", "do they publish any reading material?", "Yes, a newsmagazine.", "when was this channel set up?", "November 8, 1972", "who owns it?", "WarnerMedia Studios & Networks", "does it cover sports as well?", "Yes, broadcasts sports-related magazine and documentary series.", "can you name any particular sports that they broadcast?", "Wimbledon tennis tournament"]}
{"conversations": ["who is john sherman?", "He was a politician from the U.S. state of Ohio", "did he stand in any election?", "Yes - in the election of 1880", "what connection does he have with the senate house?", "Sherman was elevated to the Senate in 1861.", "is he related to any war?", "Yes - the American Civil War", "when did he retire?", "1898", "what was his position then in politics?", "A politician from the U.S. state of Ohio, a member of the Republican Party, Secretary of the Treasury, Secretary of State", "is this mentioned state prone to earthquakes?", "Yes -  more than 200 earthquakes with a magnitude of 2.0 or higher have occurred in Ohio since 1776.", "who is known as the father of this state?", "Rufus Putnam", "why is he called so?", "He served in both the French and Indian War and the American Revolutionary War. He organized and led the first group of veterans to the Ohio territory.", "where was he from?", "Massachusetts", "when did his first served war take place?", "1754", "between whom was it fought?", "Britain versus France with each side supported by Native American allies", "any particular reason why it was fought?", "It began with a dispute over control of the confluence of the Allegheny River and Monongahela River and the site of the French Fort Duquesne. The dispute erupted into violence in the Battle of Jumonville Glen in May 1754"]}
{"conversations": ["which group of english immigrants first settled in plymouth in 1620", "Puritan Separatists", "when did they start their journey to this place?", "End of July 1620", "what was the name of the ship they traveled on?", "\"Mayflower\"", "was there a company formed?", "UNANSWERABLE", "who was the first person to explore this place?", "Captain John Smith", "what happened in philip's war?", "The cause of the war stems from the increasing numbers of English colonists and their demand for land. As more land was purchased from the Native Americans, they were restricted to smaller territories for themselves.", "what is the story behind the famous rock of this place?", "One of the enduring symbols of the landing of the Pilgrims is Plymouth Rock, a large granodiorite boulder that was near their landing site at Plymouth. However, none of the contemporary accounts of the actual landing makes any mention that the Rock was the specific place of landing.", "was philip known by a different name?", "Yes, He was also known as Metacomet.", "when did he change his name?", "In the spring of 1660", "was there any places named after him?", "UNANSWERABLE", "when was he born?", "1638"]}
{"conversations": ["what advantages does england seem to have to start the industrial revolution", "It transformed  its society into the world's first industrialised nation.", "which age can its history be traced back to?", "780,000 years ago", "what are some of the rivers found in this country?", "Thames, Mersey, Tyne, Severn etc", "any well-known museums here?", "London's British Museum", "where is this museum located?", "Bloomsbury area of London, United Kingdom", "who was the founder?", "Sir Hans Sloane", "which was the new building constructed at the start of the 1900s?", "A conservation laboratory", "what are the middle eastern countries that it has departments for?", "Mesopotamia, Persia, the Arabian Peninsula, Anatolia, the Caucasus, parts of Central Asia, Syria etc", "what are the parks located in the same area as this museum?", "UNANSWERABLE", "is there any type of pollution in the area mentioned earlier?", "Yes, air pollution", "caused by?", "Nitrogen Dioxide (NO2) levels which had significantly exceeded the UK National Objective for cleaner air."]}
{"conversations": ["when did the arthurian legends reach their height of popularity", "With the outbreak of the Second World War.", "who was he?", "He was a legendary British leader who, according to medieval histories and romances, led the defence of Britain against Saxon invaders in the late 5th and early 6th centuries.", "who was he married to?", "UNANSWERABLE", "any novel in which his romance tradition is continuing in 20th century?", "\"The Once and Future King\", \"Arthur Rex\", and \"The Mists of Avalon\".", "who was the author of the first one mentioned above?", "T.H.White.", "when was it first published?", "1958.", "has a film ever been made on this?", "Yes, \"Camelot\".", "any other novel written by the above author?", "\"The Sword in the Stone\".", "where was he born?", "In Bombay, British India.", "what college did he study from?", "Queens' College, Cambridge.", "when was this college founded?", "1448.", "and by whom?", "By Margaret of Anjou.", "who was she?", "The Queen of England and nominally the Queen of France by marriage.", "with whom she was married to?", "King Henry VI.", "when did the above mentioned author die?", "17 January 1964.", "what was the reason for his death?", "Heart failure."]}
{"conversations": ["the three most commonly used sites for intramuscular injections are", "The deltoid muscle of the upper arm, the gluteal muscle of the buttock, in infants, the vastus lateralis muscle of the thigh", "does this have any complications?", "Yes, the most frequent complications of a deltoid injection include pain, redness, and inflammation around the injection site, which are almost always mild and last only a few days at most.", "why is it taken?", "In medicine, it is one of several methods for parenteral administration of medications.", "is it meant for any specific populations?", "In some populations, a change in injection site, needle length, or technique is necessary; for  example, in very young people or frail elderly people, a normal length needle may be too long to safely inject in the desired muscle", "which country was it used first?", "UNANSWERABLE", "can you list some of it's uses?", "Intramuscular injection is commonly used for medication administration, such as, vaccination", "what technique is used for it?", "The injection site is first cleaned using an antimicrobial and allowed to dry, it is performed in a quick, darting motion perpendicular to the skin, at an angle between 72 and 90 degrees.", "when was it first used?", "Injections into muscular tissue may have taken place as early as the year 500, but, by 1961 they had \"essentially taken over the procedure\"", "does it have any side effects?", "No, but, there is a risk of infection from bacteria or other organisms present in the environment or on the skin prior to the injection.", "who discovered it?", "UNANSWERABLE"]}
{"conversations": ["what is checkers speech?", "An address by Senator Richard Nixon.", "who is nixon?", "The 37th president of the United States.", "where was he born?", "Yorba Linda, California.", "what was the watergate scandal?", "It was an array of clandestine and often illegal activities undertaken by members of the Nixon administration.", "describe his policies related to space?", "He disapproved plans for a permanent base on moon, Mars expedition, Manned Orbital Laboratory program for funds. But he approved a five -year cooperative program between NASA and Soviet space program.", "for what was he given a pardon?", "For the Watergate scandal.", "what kind of service did he give to the military?", "He was a lieutenant in the United States Navy.", "did he ever resign from the position of president?", "Yes, as he lost his political support and feared impeachment.", "how was his public image?", "Biographer Elizabeth Drew summarized Nixon as a \"smart, talented man, but most peculiar and haunted of presidents\".", "did he write any books?", "Yes, \"RN: The Memoirs of Richard Nixon\", and nine other books.", "what is the criticism faced by the aforementioned biographer?", "She has been criticised by the editors of \"Snooze: The Best of Our Magazine\"  as \"Elizabeth Drone,\" author of a \"Giant Postcard From Washington.\"", "name a few of her works?", "\"Washington Journal: The Events of 1973-74\" ,\"Portrait of an Election: The 1980 Presidential Campaign\" ,, \"On the Edge: The Clinton Presidency\" , \"Citizen McCain\",  \"George W. Bush's Washington\" , \"Richard M. Nixon\"  and others.", "name of nixon's wife?", "Thelma \"Pat\" Ryan.", "when did he die?", "22 April ,1994.", "what was the cause of his death?", "Cerebral edema caused by stroke."]}
{"conversations": ["what is the meaning of the song alejandro", "The song bids farewell to her lovers.", "whose song is it?", "Lady Gaga", "was it a single release or part of any album?", "It was part of her third EP, \"The Fame Monster\".", "where was it performed live?", "Yes, she performed at The Monster Ball Tour.", "did it perform well on charts?", "It debuted at number 72 on the \"Billboard\" Hot 100 for the issue dated April 17, 2010; debuted on the Mainstream Top 40 chart at number 35, and the Hot Digital Songs chart at number 71.", "what is this above tour you mentioned just?", "It was the second worldwide concert tour by Lady Gaga.", "where did it take place?", "Montreal", "was it broadcasted anywhere?", "Yes, it aired on HBO", "what was its actual concept?", "The musician wanted to put together an expensive looking, beautiful show which would be affordable for her fans - the tour was a \"pop-electro opera\".", "where is this above singer from?", "Manhattan, New York City", "what is her style of music?", "Electroclash, \"ruthlessly catchy naughties pop glazed with Auto-Tune and undergirded with R&B-ish beats.\"", "name some of her notable works?", "Her cover of Elton John's \"Your Song\" for his tribute album \"Revamp\", she starred in \"A Star Is Born\".", "can you explain the first mentioned musical style of her?", "It is a genre of music that fuses 1980s electro, new wave and synth-pop with 1990s techno, retro-style electropop and electronic dance music."]}
{"conversations": ["how late can i buy beer in oregon", "2:30 a.m", "how does people consume it?", "In 2007, Oregon's 2.6 million adults on average drank 32 gallons of beer each, versus 4 gallons of wine and 2 gallons of spirits.", "what are some other drinks that they consume?", "Beer, wine, liquor, whiskey, vodka, tequila, Jack Daniel etc", "what is the second one mentioned?", "It  is an alcoholic drink typically made from fermented grape juice.", "what is the historical account behind it?", "The earliest known traces of wine are from ancient China ( BC), Georgia ( BC), Iran (Persia) ( BC), and Sicily ( BC).", "what are some different types?", "Red wine, White wine, Rose wine, Fruit wine, Mead (honey wine) etc", "what is the first one like?", "Its production process involves extraction of color and flavor components from the grape skin.", "where is it produced?", "They grow almost exclusively between 30 and 50 degrees latitude north and south of the equator.", "how does europe classify this drink in general?", "France has various appellation systems based on the concept of \"terroir\", with classifications ranging from \"Vin de Table\" (\"table wine\") at the bottom, through \"Vin de Pays\" and \"Appellation d'Origine Vin Délimité de Qualité Supérieure\" (AOVDQS), up to \"Appellation d'Origine Contrôlée\", Portugal and Germany created a similar system while Spain, Greece and Italy are based on a dual system.", "what are its culinary usage?", "Sweet dessert wines, stocks, braising, wine sauce etc", "how is it related to christian religion?", "It is used in a sacred rite called the Eucharist.", "what is this aforesaid rite?", "It is a Christian rite that is considered a sacrament in most churches, and as an ordinance in others.", "what is its biblical base?", "The Last Supper appears in all three Synoptic Gospels: Matthew, Mark, and Luke.", "what is its catholic usage?", "The Catholic Church requires its members to receive the sacrament of Penance or Reconciliation before taking Communion if they are aware of having committed a mortal sin and to prepare by fasting, prayer, and other works of piety.", "how is it among the lutherans?", "They believe that the body and blood of Christ are \"truly and substantially present in, with, and under the forms\" of the consecrated bread and wine (the elements), so that communicants eat and drink the body and blood of Christ himself as well as the bread and wine in this sacrament."]}
{"conversations": ["who played anne hathaway's boyfriend in the devil wears prada", "Adrian Grenier", "which year did the movie realease ?", "June 2006", "who were the main actors of this film?", "Meryl Streep, Anne Hathaway", "what role did the former actress play?", "She plays Miranda Priestly, a powerful fashion magazine editor", "what is the story line of the film?", "An aspiring journalist Andrea lands a job as junior personal assistant to Miranda Priestly, the editor-in-chief of \"Runway\" magazine. Andy plans to put up with Miranda's excessive demands and humiliating treatment for one year in the hopes of getting a job as a reporter or writer somewhere else.", "which countries is this film shot in?", "United States, France", "why did they go to the later mentioned country?", "Fox originally refused permission to let Frankel shoot some scenes from the third act in Paris, where it is set, due to the low budget. But after six \"nightmarish\" weeks of shooting, he had an editor cut a \"sizzle reel\" of highlights. That convinced the studio to increase the budget to allow for limited shooting overseas", "did the movie have any songs by any famous singer?", "Yes - U2's 'City of Blinding Lights'; Madonna's 'Vogue' & 'Jump';  KT Tunstall's \"Suddenly I See\"", "what is the second singers style of music?", "disco, dance music,  punk rock", "did the movies receive any awards?", "Meryl Streep won the Golden Globe for Best Actress (Musical/Comedy)."]}
{"conversations": ["large objects ( 10 m) in space originating from a region between jupiter and mars", "Asteroid belt", "can you explain its structure?", "Asteroids become darker and redder with age due to space weathering. Composition is calculated from three primary sources: albedo, surface spectrum, and density.", "how is it classified into groups?", "Orbital classification; Quasi-satellites and horseshoe objects ; Spectral classification", "can you name a belt with similar properties?", "Kuiper belt", "who discovered this?", "David Jewitt", "have there been any missions conducted to study it?", "Yes - 'New Horizons' was launched on January 19, 2006 -the first spacecraft to explore the Kuiper belt", "who launched it?", "NASA", "what is this body?", "The National Aeronautics and Space Administration (NASA; ) is an independent agency of the U.S. Federal Government responsible for the civilian space program, as well as aeronautics and space research.", "when was it created?", "1958", "where is it headquartered?", "Washington, DC"]}
{"conversations": ["who sings that's what makes you beautiful", "One Direction", "where are they from?", "London, England.", "how many songs have they sung?", "UNANSWERABLE", "do they have any albums?", "Yes, \"Up All Night\" (2011), \"Take Me Home\" (2012), \"Midnight Memories\" (2013), among others.", "are they associated with any brands?", "Yes, Pokemon Black and White, Nokia, Colgate, among others.", "what did they do for the third brand?", "They teamed up with Colgate to launch their own One Direction Colgate MaxFresh Power Toothbrush, the One Direction Colgate Maxfresh Manual Toothbrush, and the One Direction Colgate MaxFresh Toothpaste.", "what about the second brand?", "They launched Nokia C3 and Nokia C2-02 phones.", "what are the functions of the latter phone?", "Touch and Type.", "how did the band mentioned earlier associate with this brand?", "To promote the launch Nokia made a series of photos of the band members using the phones to take photos of themselves.", "did this band write the lyrics of the song mentioned in the beginning?", "No. It was written by Savan Kotecha.", "who is she?", "He is an American songwriter and record producer from Austin, Texas."]}
{"conversations": ["which of the following is the ultimate result of evolution", "UNANSWERABLE", "what is evolution?", "It is change in the heritable characteristics of biological populations over successive generations.", "who was the first to study this?", "Charles Darwin and Alfred Russel Wallace", "when was the first one born?", "Shrewsbury, Shropshire", "did he suffer from any illness?", "He had \"an uncomfortable palpitation of the heart\".", "did he publish anything?", "Yes, his theory of evolution with compelling evidence in his 1859 book \"On the Origin of Species\".", "what does modern synthesis state about evolution?", "It explained patterns observed across species in populations, through fossil transitions in palaeontology, and complex cellular mechanisms in developmental biology.", "what is the last type of biology about?", "It is the study of the process by which animals and plants grow and develop.", "does it have any model for organisms?", "UNANSWERABLE", "where has the study of evolution been applied to?", "domestication of plants and animals, genetic engineering, etc."]}
{"conversations": ["when did we get the statue of liverty", "The statue was dedicated on October 28, 1886.", "who built it?", "Gustave Eiffel", "when?", "October 28, 1886", "where?", "UNANSWERABLE", "who designed it?", "A French sculptor \"Frédéric Auguste Bartholdi\".", "what does it symbolize?", "It symbolises freedom and is seen as a welcome sign to immigrants arriving by sea.", "where is the statue located?", "is It is situated in Upper New York Bay on Liberty Island.", "how can you access it?", "By ferries which depart from Liberty State Park in Jersey City and the Battery in Lower Manhattan.", "how were funds raised to build it?", "A large number of money-raising events were organized. As part of one such effort, an auction of art and manuscripts, poet Emma Lazarus was asked to donate an original work.", "are there any inscriptions on it?", "There is an inscription on the left hand of the statue that reads \"tabula ansata\", the date of the U.S. Declaration of Independence."]}
{"conversations": ["what is the crew celebrating in the beginning of the little mermaid", "Prince Eric's birthday.", "what is the genre of the film?", "An animated musical fantasy.", "what is the plot about?", "The film tells the story of a mermaid Princess named Ariel, who dreams of becoming human and falls in love with a human prince named Eric.", "who produced it?", "Walt Disney Feature Animation and Walt Disney.", "was the plot influenced by any story?", "It is based on the 1837 Danish fairy tale of the same name.", "who wrote this tale?", "Hans Christian Andersen", "had he written travalogues?", "\"Shadow Pictures of a Journey to the Harz and Swiss Saxony.", "what language does he use to produce his works?", "Danish", "which country he belonged to?", "Denmark", "what is its capital?", "Copenhagen"]}
{"conversations": ["when did yu yu hakusho anime come out", "October 1992", "who is the main character of the show.", "Yusuke Urameshi", "who was the producer?", "Fuji Television, Yomiko Advertising, and Studio Pierrot", "what genre is this show?", "UNANSWERABLE", "were there any games based on the show?", "Yes, A single Mega Drive game, \"Yū Yū Hakusho Makyō Tōitsusen\", was published in Brazil by Tectoy in 1999 under the title \"Yu Yu Hakusho: Sunset Fighters\".", "what sport is the above mentioned country famous for?", "Football", "what is the weather like there?", "According to the Köppen system, Brazil hosts six major climatic subtypes: desert, equatorial, tropical, semiarid, oceanic and subtropical.", "who were the people of this region influenced by?", "The Portuguese Empire", "where did its name originate from?", "The word \"Brazil\" likely comes from the Portuguese word for brazilwood, a tree that once grew plentifully along the Brazilian coast.", "what beverage is it well known for?", "The national beverage is coffee and cachaça is Brazil's native liquor"]}
{"conversations": ["where is coney island in relation to manhattan", "The southwestern section of the New York City borough of Brooklyn.", "who were the earliest settlers in this region?", "Dutch", "is it a tourist place?", "Yes, it is a vacation destination", "what are some of the sights to see there?", "The New York Aquarium, KeySpan Park, the Ford Amphitheater at Coney Island", "where is the first place located on the island?", "On the Riegelmann Boardwalk in Coney Island", "what is the zip code of the island?", "Coney Island's primary ZIP Code is 11224", "what are the major ethnicities found there?", "African American, White, Asian, Native American", "is there a lot of crime here?", "No, Coney Island's rate of violent crimes per capita is less than that of the city as a whole.", "how many townships are there in the borough mentioned earlier?", "Six townships", "who is the current mayor of this place?", "UNANSWERABLE", "what universities are found here?", "Long Island University and the New York University Tandon School of Engineering", "how has the first one dealt with the current pandemic?", "In response to the COVID-19 pandemic, Long Island University moved all classes to online instruction for the remainder of the semester.", "when did this pandemic start?", "The disease was first identified in December 2019", "which country is it supposed to have originated from?", "China", "what are some ways to prevent the spread of this disease?", "Strategies for preventing transmission of the disease include social distancing, wearing of masks, washing hands, avoiding touching the eyes, nose, or mouth with unwashed hands, and coughing or sneezing into a tissue, and putting the tissue directly into a waste container"]}
{"conversations": ["where is the headwaters of the willamette river", "Columbia River in the Pacific Northwest region of North America", "who were the first people to inhabit the area along the above-mentioned river?", "Native American community", "what was the major trade done on this river?", "Fur trade", "who traded this, to whom?", "French-Canadians working for the Hudson's Bay Company", "who owns this company?", "American business man, Jerry Zucker", "are there any modern stores associated with this company?", "Yes, department stores", "any stores in particular?", "UNANSWERABLE", "did they merger with any other major company?", "Yes, with North West Company", "where is this company located?", "Montreal", "who were the founders?", "John Gregory, Alexander Mackenzie, and Roderick Mackenzie", "when was it founded?", "1787", "who forced them into the merger with the other company mentioned earlier?", "British government", "what was the reason behind the merger?", "To put an end to often-violent competition, which was leading to war between the two"]}
{"conversations": ["is gary cooper an actor?", "Yes", "from which origin?", "Helena, Montana, United States", "what is his style like?", "Natural, authentic, and understated acting style", "with whom he was in relation?", "Veronica Balfe", "did he marry her?", "Yes", "in which films were he involved during the span 1925 to 28?", "The Thundering Herd, Wild Horse Mesa, The Johnstown Flood", "is this above lady also from film industry?", "Yes - American actress", "which film did she work in?", "The Gay Nighties, King Kong, Blood Money", "is she alive?", "No - she died on February 16, 2000.", "who is the director of this second film?", "Merian C. Cooper and Ernest B. Schoedsack.", "what was the above actress's role in it?", "She played parts in \"King Kong\"", "which special effects were used in it?", "Stop-motion animation, matte painting, rear projection and miniatures", "was it a hit or a flop?", "It was a hit"]}
{"conversations": ["who makes up most of the population of antarctica", "5,000 in the summer and much lesser in winter", "where did it get the name from?", "It is the romanised version of the Greek compound word \"antarktiké\" meaning \"opposite to the Arctic\", \"opposite to the north\"", "what kinds of animals can be seen there?", "Some species of marine animals include penguins, blue whales, orcas, colossal squids and fur seals", "what sort of weather conditions it has?", "It is the coldest of Earth's continents.", "how big is the second marine animal mentioned?", "A maximum confirmed length of 29.9 meters (98 feet) and weight of 173 tonnes (190 tons), it is the largest animal known to have ever existed.", "how fast is it while swimming?", "Blue whales leisurely traveling rates is 4.6 mph. The maximum speed of a blue whale while being chased or harassed has been reported at 20 to 48 km/h", "what does it feed on?", "Their diet consists almost exclusively of euphausiids (krill)", "how long does it live?", "73 years", "does it face any threat or problems?", "Norwegian Svend Foyn invented the exploding harpoon gun and by using them with steam and diesel-powered ships to hunt them down.", "is there a need for conserving it?", "Yes, Blue whales are formally classified as \"endangered\" under the Endangered Species Act and considered \"depleted\" and \"strategic\" under the Marine Mammal Protection Act."]}
{"conversations": ["what happened after the earthquake in haiti 2010", "By 24 January 2010, at least 52 aftershocks measuring 4.5 or greater had been recorded. An estimated three million people were affected by the quake.", "what was the richter scale of it?", "catastrophic magnitude 7.0 M on the Moment magnitude scale", "how many casualties were there because of it?", "3 million people affected with a possible death toll of more than 316,000", "who were involved in rescue efforts?", "International Committee of the Red Cross", "who are they?", "a humanitarian organization based in Geneva, Switzerland", "what was their role in the holocaust?", "By taking part in the 1995 ceremony to commemorate the liberation of the Auschwitz concentration camp, the President of the ICRC, Cornelio Sommaruga, paid tribute to all those who had suffered or lost their lives during the war and publicly regretted the past mistakes and shortcomings of the Red Cross with regard to the victims of the concentration camps.", "how do they raise their fund?", "Through donations as: an annual \"Headquarters Appeal\" to cover its internal costs and \"Emergency Appeals\" for its individual missions.", "describe some of their characteristics?", "The original motto of the International Committee of the Red Cross was \"Inter Arma Caritas\" (\"Amidst War, Charity\"). It has three official languages - English, French and Spanish. The official symbol is the Red Cross on white background with the words \"COMITE INTERNATIONAL GENEVE\"", "what is their legal status?", "A legal foundation was created by a formal agreement between the Swiss government and the ICRC. This agreement protects the full sanctity of all ICRC property in Switzerland including its headquarters and archive, grants members and staff legal immunity, exempts the ICRC from all taxes and fees, guarantees protected and duty-free transfer of goods, services, and money etc", "when was it founded?", "17 February 1863", "what is the location of the place where the earthquake occurred?", "near the town of Léogâne (Ouest) and approximately west of Port-au-Prince", "describe in few words the economy of the town?", "Predominately agricultural with the sugarcane industry holds the largest share in the economy."]}
{"conversations": ["washington’s state government is organized into how many branches", "Three", "where was he born ?", "Virginia, United States", "where did he win his first presendency from?", "UNANSWERABLE", "was he associated with any war?", "Yes, Northwest Indian War", "any treaty associated with him?", "Jay Treaty", "where was it signed?", "Britain", "any concerns associated to this treaty?", "From the British perspective, improving relations with the United States was a high priority lest it move into the French orbit. British negotiators ignored elements that wanted harsher terms in order to get a suitable treaty.", "which rights does it refer too?", "Trading rights", "does this treaty affect any culture?", "Recent, popular film culture", "any person associated with this culture?", "Vice President John Adams", "where was he born?", "Braintree, Massachusetts", "any games associated with this place?", "Basketball", "name few ways to travel around in this place?", "By rail, air, and highway facilities."]}
{"conversations": ["what was one of the provisions of the petition of right (1628)", "No person should be forced to provide a gift, loan or tax without an Act of Parliament.", "what does the term \"petition of right\" refer to?", "It is an English constitutional document setting out specific individual protections against the state.", "who formulated it?", "Charles I", "what kinds of provisions does it have?", "No person should be forced to provide a gift, loan or tax without an Act of Parliament. No free individual should be imprisoned or detained unless a cause has been shown. Soldiers or members of the Royal Navy should not be billeted in private houses without the free consent of the owner.", "which period marked the age of sail for the navy mentioned above?", "During the reign of Henry VIII.", "do they have an escort fleet?", "Yes, there are six Type 45 destroyers and 13 Type 23 frigates in active service.", "what is type 45?", "It is also known as the D or \"Daring\" class. It is a class of six guided missile destroyers built for the United Kingdom's Royal Navy.", "did its engine face any trouble?", "On occasion there have been near-complete power generation failures, temporarily disabling propulsion, power generation for weapons, navigational systems and other purposes, leaving the ships vulnerable to \"total electric failure\".", "how strong was their air defense?", "The Royal Navy describes the destroyers' mission as being \"to shield the Fleet from air attack\". It is equipped with the Sea Viper air-defence system utilizing the SAMPSON active electronically scanned array multi-function radar and the S1850M long-range radar. PAAMS is able to track over 2,000 targets and simultaneously control and coordinate multiple missiles in the air at once, allowing a large number of tracks to be intercepted and destroyed at any given time.", "how does the first mentioned radar function?", "The SAMPSON multi function radar can detect all types of targets out to a distance of 400 km, and is capable of tracking hundreds of targets at any one time.", "who developed it?", "It was developed in a partnership between Plessey, Roke Manor Research and the Defence Evaluation and Research Agency"]}
